{"resource_uri": "https://www.courtlistener.com/api/rest/v4/opinions/9889201/", "id": 9889201, "absolute_url": "/opinion/4766664/trump-v-vance/", "cluster_id": 4766664, "cluster": "https://www.courtlistener.com/api/rest/v4/clusters/4766664/", "author_id": null, "author": null, "joined_by": [], "date_created": "2023-10-06T13:26:57.305430-07:00", "date_modified": "2025-06-04T10:25:33.826312-07:00", "author_str": "Alito", "per_curiam": false, "joined_by_str": "", "type": "040dissent", "sha1": "", "page_count": null, "download_url": null, "local_path": null, "plain_text": "", "html": "", "html_lawbox": "", "html_columbia": "", "html_anon_2020": "", "xml_harvard": "<opinion type=\"dissent\">\n<author id=\"p-124\">Justice ALITO, dissenting.</author>\n<p id=\"p-125\">This case is almost certain to be portrayed as a case about the current President and the current political situation, but the case has a much deeper significance. While the decision will of course have a direct effect on President Trump, what the Court holds today will also affect all future Presidents-which is to say, it will affect the Presidency, and that is a matter of great and lasting importance to the Nation.</p>\n<p id=\"p-126\">The event that precipitated this case is unprecedented. Respondent Vance, an elected state prosecutor, launched a criminal investigation of a sitting President and obtained a grand jury subpoena for his records. The specific question before us-whether the subpoena may be enforced-cannot be answered adequately without considering the broader question that frames it: whether the Constitution imposes <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2440\" href=\"#p2440\" id=\"p2440\">*2440</a>restrictions on a State's deployment of its criminal law enforcement powers against a sitting President. If the Constitution sets no such limits, then a local prosecutor may prosecute a sitting President. And if that is allowed, it follows <em>a fortiori</em> that the subpoena at issue can be enforced. On the other hand, if the Constitution does not permit a State to prosecute a sitting President, the next logical question is whether the Constitution restrains any other prosecutorial or investigative weapons.</p>\n<p id=\"p-127\">These are important questions that go to the very structure of the Government created by the Constitution. In evaluating these questions, two important structural features must be taken into account.</p>\n<p id=\"p-128\">I</p>\n<p id=\"p-129\">A</p>\n<p id=\"p-130\">The first is the nature and role of the Presidency. The Presidency, like Congress and the Supreme Court, is a permanent institution created by the Constitution. All three of these institutions are distinct from the human beings who serve in them at any point in time. In the case of Congress or the Supreme Court, the distinction is easy to perceive, since they have multiple Members. But because \"[t]he President is the only person who alone composes a branch of government ..., there is not always a clear line between his personal and official affairs.\" <em>Trump v. Mazars USA, LLP</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626376\" index=\"225\" url=\"https://cite.case.law/s-ct/140/2019/#p2034\">140 S.Ct. 2019</extracted-citation>, 2034, --- L.Ed.2d ---- (2020). As a result, the law's treatment of the person who serves as President can have an important effect on the institution, and the institution of the Presidency plays an indispensable role in our constitutional system.</p>\n<p id=\"p-131\">The Constitution entrusts the President with responsibilities that are essential to the country's safety and wellbeing. The President is Commander in Chief of the Armed Forces. Art. II, § 2, cl. 1. He is responsible for the defense of the country from the moment he enters office until the moment he leaves.</p>\n<p id=\"p-132\">The President also has the lead role in foreign relations. He \"make[s]\" treaties with the advice and consent of the Senate, Art. II, § 2, cl. 2, decides whether to recognize foreign governments, <em>Zivotofsky v. Kerry</em> , <extracted-citation index=\"226\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\">576 U.S. 1</extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"227\" url=\"https://cite.case.law/s-ct/135/2076/\">135 S.Ct. 2076</extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"228\" url=\"https://cite.case.law/s-ct/135/2076/\">192 L.Ed.2d 83</extracted-citation> (2015), enters into and rescinds executive agreements with other countries,<footnotemark>1</footnotemark> meets with foreign leaders, appoints ambassadors, Art. II, § 2, cl. 2, oversees the work of the State Department and intelligence agencies, and exercises important foreign-relations powers under statutes and treaties that give him broad discretion in matters relating to subjects such as terrorism, trade, and immigration.<footnotemark>2</footnotemark></p>\n<p id=\"p-133\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2441\" href=\"#p2441\" id=\"p2441\">*2441</a>The Constitution vests the President with \"the executive Power\" of the United States, Art. II, § 1, cl. 1, and entrusts him with the responsibility \"to take Care that the Laws be faithfully executed,\" § 3. As the head of the Executive Branch, the President is ultimately responsible for everything done by all the departments and agencies of the Federal Government and a federal civilian work force that includes millions of employees. These weighty responsibilities impose enormous burdens on the time and energy of any occupant of the Presidency.</p>\n<p id=\"p-134\">\"Constitutionally speaking, the President never sleeps. The President must be ready, at a moment's notice, to do whatever it takes to preserve, protect, and defend the Constitution and the American people.\" Amar &amp; Katyal, Executive Privileges and Immunities: The Nixon and Clinton Cases, <extracted-citation index=\"229\" url=\"https://cite.case.law/citations/?q=108%20Harv.%20L.%20Rev.%20701\">108 Harv. L. Rev. 701</extracted-citation>, 713 (1995). Without a President who is able at all times to carry out the responsibilities of the office, our constitutional system could not operate, and the country would be at risk. That is why the Twenty-fifth Amendment created a mechanism for temporarily transferring the responsibilities of the office to the Vice President if the President is incapacitated for even a brief time. The Amendment has been explicitly invoked on only two occasions, each time for a period of about two hours.<footnotemark>3</footnotemark> This mechanism reflects an appreciation that the Nation cannot <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2442\" href=\"#p2442\" id=\"p2442\">*2442</a>be safely left without a functioning President for even a brief time.</p>\n<p id=\"p-135\">B</p>\n<p id=\"p-136\">The second structural feature is the relationship between the Federal Government and the States. Just as our Constitution balances power against power among the branches of the Federal Government, it also divides power between the Federal Government and the States. The Constitution permitted the States to retain many of the sovereign powers that they previously possessed, see, <em>e.g</em> ., <em>Murphy v. National Collegiate Athletic Assn.</em> , 584 U. S. ----, <extracted-citation case-ids=\"12611443\" index=\"230\" url=\"https://cite.case.law/s-ct/138/1461/\">138 S.Ct. 1461</extracted-citation>, <extracted-citation case-ids=\"12611443\" index=\"231\" url=\"https://cite.case.law/s-ct/138/1461/\">200 L.Ed.2d 854</extracted-citation> (2018), but it gave the Federal Government powers that were deemed essential for the Nation's well-being and, indeed, its survival. And it provided for the Federal Government to be independent of and, within its allotted sphere, supreme over the States. Art. VI, cl. 2. Accordingly, a State may not block or interfere with the lawful work of the National Government.</p>\n<p id=\"p-137\">This was an enduring lesson of Chief Justice Marshall's landmark opinion for the Court in <em>McCulloch v. Maryland</em> , <extracted-citation case-ids=\"4702\" index=\"232\" url=\"https://cite.case.law/us/17/316/#p436\">4 Wheat. 316</extracted-citation>, <extracted-citation case-ids=\"4702\" index=\"233\" url=\"https://cite.case.law/us/17/316/#p436\">4 L.Ed. 579</extracted-citation> (1819). As is well known, the case concerned the attempt by the State of Maryland to regulate and tax the federally chartered Second Bank of the United States. After holding that Congress had the authority to establish the bank, <em>id</em> ., at 425, Marshall's opinion went on to conclude that the State could not tax it. Marshall recognized that the States retained the \"sovereign\" power to tax persons and entities within their jurisdiction, <em>id</em> ., at 429, but this power, he explained, \"is subordinate to, and may be controlled by the constitution of the United States.\" <em><extracted-citation case-ids=\"4702\" index=\"234\" url=\"https://cite.case.law/us/17/316/#p436\">Id.</extracted-citation></em> , at 427. Noting the potency of the taxing power (\"[a] right to tax without limit or control, is essentially a power to destroy,\" <em>id</em> ., at 391 ), he concluded that a State's power to tax had to give way to Congress's authority to charter the bank. In his words, the state power to tax could not be used to \"defeat the legitimate operations,\" <em><extracted-citation case-ids=\"4702\" index=\"235\" url=\"https://cite.case.law/us/17/316/#p436\">id.</extracted-citation></em> , at 427, of the Federal Government or \"to retard, impede, burden, or in any manner control\" it, <em>id</em> ., at 436. Marshall thus held, not simply that Maryland was barred from assessing a crushing tax that threatened the bank's ability to operate, but that the State could not tax the bank at all. He wrote:</p>\n<blockquote id=\"p-138\">\"We are not driven to the perplexing inquiry, so unfit for the judicial department, what degree of taxation is the legitimate use, and what degree may amount to the abuse of the power. The attempt to use it on the means employed by the government of the Union, in pursuance of the constitution, is itself an abuse.\" <em>Id</em> ., at 430.</blockquote>\n<p id=\"p-139\">Even a rule allowing a state tax that did not discriminate between the federally chartered bank and state banks was ruled out. Instead, he concluded that preservation of the Constitution's federal structure demanded that any state effort to tax a federal instrumentality be nipped in the bud.</p>\n<p id=\"p-140\">Building on this principle of federalism, two centuries of case law prohibit the States from taxing,<footnotemark>4</footnotemark> regulating, or otherwise <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2443\" href=\"#p2443\" id=\"p2443\">*2443</a>interfering with the lawful work of federal agencies, instrumentalities, and officers.<footnotemark>5</footnotemark> The Court premised these cases on the principle that \"the activities of the Federal Government are free from regulation by any State. No other adjustment of competing enactments or legal principles is possible.\" <em>Mayo v. United States</em> , <extracted-citation case-ids=\"366486\" index=\"236\" url=\"https://cite.case.law/us/319/441/#p445\">319 U.S. 441</extracted-citation>, 445, <extracted-citation case-ids=\"366486\" index=\"237\" url=\"https://cite.case.law/us/319/441/#p445\">63 S.Ct. 1137</extracted-citation>, <extracted-citation case-ids=\"366486\" index=\"238\" url=\"https://cite.case.law/us/319/441/#p445\">87 L.Ed. 1504</extracted-citation> (1943) (footnote omitted). <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2444\" href=\"#p2444\" id=\"p2444\">*2444</a>II</p>\n<p id=\"p-141\">A</p>\n<p id=\"p-142\">In <em>McCulloch</em> , Maryland's sovereign taxing power had to yield, and in a similar way, a State's sovereign power to enforce its criminal laws must accommodate the indispensable role that the Constitution assigns to the Presidency. This must be the rule with respect to a state prosecution of a sitting President. Both the structure of the Government established by the Constitution and the Constitution's provisions on the impeachment and removal of a President make it clear that the prosecution of a sitting President is out of the question. It has been aptly said that the President is the \"sole indispensable man in government,\"<footnotemark>6</footnotemark> and subjecting a sitting President to criminal prosecution would severely hamper his ability to carry out the vital responsibilities that the Constitution puts in his hands.</p>\n<p id=\"p-143\">Justice Joseph Story endorsed this reasoning in his famous treatise. He wrote that a President's responsibilities necessarily entail \"the power to perform [those duties], without any obstruction or impediment whatsoever,\" and that, as a result, a President is not \"liable to arrest, imprisonment, or detention\" while in office. 3 Commentaries on the Constitution of the United States § 1563, pp. 418-419 (1833).</p>\n<p id=\"p-144\">The constitutional provisions on impeachment provide further support for the rule that a President may not be prosecuted while in office. The Framers foresaw the need to provide for the possibility that a President might be implicated in the commission of a serious offense, and they did not want the country to be forced to endure such a President for the remainder of his term in office. But when a President has been elected by the people pursuant to the procedures set out in the Constitution, it is no small thing to overturn that choice. The Framers therefore crafted a special set of procedures to deal with that contingency. They put the charging decision in the hands of a body that represents all the people (the House of Representatives), not a single prosecutor or the members of a local grand jury. And they entrusted the weighty decision whether to remove a President to a supermajority of Senators, who were expected to exercise reasoned judgment and not the political passions of the day or the sentiments of a particular region.</p>\n<p id=\"p-145\">The Constitution not only sets out the procedures for dealing with a President who is suspected of committing a serious offense; it also specifies the consequences of a judgment adverse to the President. After providing that the judgment cannot impose any punishment beyond removal from the Presidency and disqualification from holding any other federal office, the Constitution states that \"the Party convicted shall nevertheless be liable and subject to Indictment, Trial, Judgment, and Punishment, according to Law.\" Art. I, § 3, cl. 7. The plain implication is that criminal prosecution, like removal from the Presidency and disqualification from other offices, is a consequence that can come about only after the Senate's judgment, not during or prior to the Senate trial.</p>\n<p id=\"p-146\">This was how Hamilton explained the impeachment provisions in the Federalist Papers. He wrote that a President may \"be impeached, tried, and, upon conviction ...<em>would afterwards be liable to prosecution and punishment in the ordinary course of law</em> .\" The Federalist No. 69, p. 416 (C. Rossiter ed. 1961) (emphasis added); see also <em>id</em> ., No. 77, at 464 (A. Hamilton) (a President is \"at all times liable to impeachment, trial, [and] dismission from <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2445\" href=\"#p2445\" id=\"p2445\">*2445</a>office,\" but any other punishment must come only \"by <em>subsequent prosecution</em> in the common course of law\" (emphasis added)).</p>\n<p id=\"p-147\">In the proceedings below, neither respondent, nor the District Court, nor the Second Circuit was willing to concede the fundamental point that a sitting President may not be prosecuted by a local district attorney. Respondent has said that he is investigating the President and, until oral argument in this Court, he never foreswore an intention to charge the President while he is still in office.<footnotemark>7</footnotemark> The District Court conceded only that \"perhaps\" a sitting President could not be prosecuted for an offense punishable by \"lengthy imprisonment\" but that an offense requiring only a short trial would be another matter. <extracted-citation index=\"239\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\">395 F.Supp.3d 283</extracted-citation>, 289, 311 (SDNY 2019). And the Second Circuit was silent on the question.</p>\n<p id=\"p-148\">The scenario apparently contemplated by the District Court is striking. If a sitting President were charged in New York County, would he be arrested and fingerprinted? He would presumably be required to appear for arraignment in criminal court, where the judge would set the conditions for his release. Could he be sent to Rikers Island or be required to post bail? Could the judge impose restrictions on his travel? If the President were scheduled to travel abroad-perhaps to attend a G-7 meeting-would he have to get judicial approval? If the President were charged with a complicated offense requiring a long trial, would he have to put his Presidential responsibilities aside for weeks on end while sitting in a Manhattan courtroom? While the trial was in progress, would aides be able to approach him and whisper in his ear about pressing matters? Would he be able to obtain a recess whenever he needed to speak with an aide at greater length or attend to an urgent matter, such as speaking with a foreign leader? Could he effectively carry out all his essential Presidential responsibilities after the trial day ended and at the same time adequately confer with his trial attorneys regarding his defense? Or should he be expected to give up the right to attend his own trial and be tried in absentia? And if he were convicted, could he be imprisoned? Would aides be installed in a nearby cell?</p>\n<p id=\"p-149\">This entire imagined scene is farcical. The \"right of all the People to a functioning government\" would be sacrificed. Amar &amp; Kalt, The Presidential Privilege Against Prosecution, 2 Nexus 11, 14 (1997). \"Does anyone really think, in a country where common crimes are usually brought before state grand juries by state prosecutors, that it is feasible to subject the president-and thus the country-to every district attorney with a reckless mania for self-promotion?\" C. Black &amp; P. Bobbitt, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2446\" href=\"#p2446\" id=\"p2446\">*2446</a>Impeachment: A Handbook 112 (2018). See also R. Moss, Asst. Atty. Gen., A Sitting President's Amenability to Indictment and Criminal Prosecution, 24 Op. Office of Legal Counsel (OLC) 222, 260 (2000) (Moss Memo); Memorandum from R. Dixon, Asst. Atty. Gen., OLC, Re: Amenability of the President, Vice President, and Other Civil Officers to Federal Criminal Prosecution While in Office (Sept. 24, 1973).</p>\n<p id=\"p-150\">B</p>\n<p id=\"p-151\">While the prosecution of a sitting President provides the most dramatic example of a clash between the indispensable work of the Presidency and a State's exercise of its criminal law enforcement powers, other examples are easy to imagine. Suppose state officers obtained and sought to execute a search warrant for a sitting President's private quarters in the White House. Suppose a state court authorized surveillance of a telephone that a sitting President was known to use. Or suppose that a sitting President was subpoenaed to testify before a state grand jury and, as is generally the rule, no Presidential aides, even those carrying the so-called \"nuclear football,\"<footnotemark>8</footnotemark> were permitted to enter the grand jury room. What these examples illustrate is a principle that this Court has recognized: legal proceedings involving a sitting President must take the responsibilities and demands of the office into account. See <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"240\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. 681</extracted-citation>, 707, <extracted-citation case-ids=\"11652833\" index=\"241\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"242\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997).</p>\n<p id=\"p-152\">It is not enough to recite sayings like \"no man is above the law\" and \"the public has a right to every man's evidence.\" <em>Ante</em> , at 2420. These sayings are true-and important-but they beg the question. The law applies equally to all persons, including a person who happens for a period of time to occupy the Presidency. But there is no question that the nature of the office demands in some instances that the application of laws be adjusted at least until the person's term in office ends.</p>\n<p id=\"p-153\">C</p>\n<p id=\"p-154\">I now come to the specific investigative weapon at issue in the case before us-a subpoena for a sitting President's records. This weapon is less intrusive in an immediate sense than those mentioned above. Since the records are held by, and the subpoena was issued to, a third party, compliance would not require much work on the President's part. And after all, this is just one subpoena.</p>\n<p id=\"p-155\">But we should heed the \"great jurist,\" <em>ante</em> , at 2431, who rejected a similar argument in <em>McCulloch</em> . If we say that a subpoena to a third party is insufficient to undermine a President's performance of his duties, what about a subpoena served on the President himself? Surely in that case, the President could turn over the work of gathering the requested documents to attorneys or others recruited to perform the task. And if one subpoena is permitted, what about two? Or three? Or ten? Drawing a line based on such factors would involve the same sort of \"perplexing inquiry, so unfit for the judicial department\" that Marshall rejected in <em>McCulloch</em> , <extracted-citation case-ids=\"4702\" index=\"243\" url=\"https://cite.case.law/us/17/316/#p436\">4 Wheat. at 430</extracted-citation>.</p>\n<p id=\"p-156\">The Court faced a similar issue when it considered whether a President can be sued for an allegedly unlawful act committed in the performance of official duties. See <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"244\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"245\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"246\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982). We did not ask whether the particular suit before <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2447\" href=\"#p2447\" id=\"p2447\">*2447</a>us would have interfered with the carrying out of Presidential duties. (It could not have had that effect because President Nixon had already left office.)</p>\n<p id=\"p-157\">Instead, we adopted a rule for all such suits, and we should take a similar approach here. The rule should take into account both the effect of subpoenas on the functioning of the Presidency and the risk that they will be used for harassment.</p>\n<p id=\"p-158\">I turn first to the question of the effect of a state grand jury subpoena for a President's records. When the issuance of such a subpoena is part of an investigation that regards the President as a \"target\" or \"subject,\"<footnotemark>9</footnotemark> the subpoena can easily impair a President's \"energetic performance of [his] constitutional duties.\" <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"247\" url=\"https://cite.case.law/us/542/367/#p381\">542 U.S. 367</extracted-citation>, 382, <extracted-citation case-ids=\"2527206\" index=\"248\" url=\"https://cite.case.law/us/542/367/#p381\">124 S.Ct. 2576</extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"249\" url=\"https://cite.case.law/us/542/367/#p381\">159 L.Ed.2d 459</extracted-citation> (2004). Few individuals will simply brush off an indication that they may be within a prosecutor's crosshairs. Few will put the matter out of their minds and go about their work unaffected. For many, the prospect of prosecution will be the first and last thing on their minds every day.</p>\n<p id=\"p-159\">We have come to expect our Presidents to shoulder burdens that very few people could bear, but it is unrealistic to think that the prospect of possible criminal prosecution will not interfere with the performance of the duties of the office. \"[C]riminal litigation uniquely requires [a] President's personal time and energy, and will inevitably entail a considerable if not overwhelming degree of mental preoccupation.\" Moss Memo 254 (emphasis deleted). See also Kavanaugh, Separation of Powers During the Forty-Fourth Presidency and Beyond, <extracted-citation index=\"250\" url=\"https://cite.case.law/citations/?q=93%20Minn.%20L.%20Rev.%201454\">93 Minn. L. Rev. 1454</extracted-citation>, 1461 (2009) (\"[A] President who is concerned about an ongoing criminal investigation is almost inevitably going to do a worse job as President\").</p>\n<p id=\"p-160\">As for the potential use of subpoenas to harass, we need not \" 'exhibit a naiveté from which ordinary citizens are free.' \" <em>Department of Commerce v. New York</em> , 588 U. S. ----, ----, <extracted-citation case-ids=\"12620860\" index=\"251\" url=\"https://cite.case.law/s-ct/139/2551/#p2575\">139 S.Ct. 2551</extracted-citation>, 2575, <extracted-citation case-ids=\"12620860\" index=\"252\" url=\"https://cite.case.law/s-ct/139/2551/#p2575\">204 L.Ed.2d 978</extracted-citation> (2019). As we have recognized, a President is \"an easily identifiable target.\" <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"253\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. at 752-753</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"254\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>. There are more than 2,300 local prosecutors and district attorneys in the country.<footnotemark>10</footnotemark> Many local prosecutors are elected, and many prosecutors have ambitions for higher elected office. (Respondent's famous predecessor Thomas E. Dewey used the office of District Attorney for New York County as a springboard to the governorship of New York and to the Republican nomination for President in 1944 and 1948.) If a sitting President is intensely unpopular in a particular district-and that is a common condition-targeting the President may be an alluring and effective electoral strategy. But it is a strategy that would undermine our constitutional structure.</p>\n<p id=\"p-161\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2448\" href=\"#p2448\" id=\"p2448\">*2448</a>The Framers understood the importance of protecting the Presidency from interference by the States. At the Constitutional Convention, James Wilson argued that the President should be \"as independent as possible ... of the States.\" 1 Records of the Federal Convention of 1787, p. 69 (M. Farrand ed. 1911). He and James Madison successfully opposed a proposal to vest the impeachment power in state legislatures, contending that this \"would open a door for intrigues agst. [the President] in States where his administration tho' just might be unpopular, and might tempt him to pay court to particular States whose leading partizans he might fear.\" <em>Id</em> ., at 86. And to prevent a State from compromising a President's independence, the Convention adopted a provision barring a President from receiving an \"Emolument\" from any State, U. S. Const., Art. II, § 1, cl. 7. See The Federalist No. 73, at 494 (J. Cooke ed. 1961) (A. Hamilton).</p>\n<p id=\"p-162\">Two centuries later, the Court's decision in <em>Clinton</em> reflected a similar concern. The Court held that a sitting President could be sued in federal court, but the Court took pains to reserve judgment on the question whether \"a comparable claim might succeed in a state tribunal.\" <extracted-citation case-ids=\"11652833\" index=\"255\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 691</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"256\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. \"[A]ny direct control by a state court over the President,\" the Court observed, might raise concerns about \"protecting federal officials from possible local prejudice.\" <em>Ibid</em> ., and n. 13.</p>\n<p id=\"p-163\">D</p>\n<p id=\"p-164\">In light of the above, a subpoena like the one now before us should not be enforced unless it meets a test that takes into account the need to prevent interference with a President's discharge of the responsibilities of the office. I agree with the Court that not all such subpoenas should be barred. There may be situations in which there is an urgent and critical need for the subpoenaed information. The situation in the Burr trial, where the documents at issue were sought by a criminal defendant to defend against a charge of treason, is a good example. But in a case like the one at hand, a subpoena should not be allowed unless a heightened standard is met.</p>\n<p id=\"p-165\">Prior cases involving Presidential subpoenas have always applied special, heightened standards. In the Burr trial, Chief Justice Marshall was careful to note that \"in no case of this kind would a court be required to proceed against the president as against an ordinary individual,\" and he held that the subpoena to President Jefferson was permissible only because the prosecutor had shown that the materials sought were \"essential to the justice of the [pending criminal] case.\" <em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"257\" url=\"https://cite.case.law/f-cas/25/187/#p192\">25 F.Cas. 187</extracted-citation>, 192, (No. 14694) (CC Va. 1807) (brackets omitted).</p>\n<p id=\"p-166\">In <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"258\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"259\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"260\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974), where the Watergate Special Prosecutor subpoenaed tape recordings and documents under the control of President Nixon, this Court refused to quash the subpoena because there was a \"demonstrated, specific need for [the] evidence in a pending criminal trial.\" <em>Id</em> ., at 713, <extracted-citation case-ids=\"6174416\" index=\"261\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>. In an earlier Watergate-related case where a Senate Committee subpoenaed President Nixon's White House tapes, the D. C. Circuit refused to order their production because the Committee had failed to show that \"the subpoenaed evidence [wa]s demonstrably critical to the responsible fulfillment of the Committee's functions.\" <em>Senate Select Committee on Presidential Campaign Activities v. Nixon</em> , <extracted-citation case-ids=\"3681739,169479\" index=\"262\" url=\"https://cite.case.law/f2d/498/725/\">498 F.2d 725</extracted-citation>, 731 (1974). Later, when an independent counsel investigating a Cabinet officer wanted to enforce a federal grand jury subpoena for privileged materials held <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2449\" href=\"#p2449\" id=\"p2449\">*2449</a>by the White House counsel, the D. C. Circuit explained that enforcement demanded a \" 'demonstrated, specific need' \" for the materials sought. <em>In re Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"263\" url=\"https://cite.case.law/f3d/121/729/\">121 F.3d 729</extracted-citation>, 736 (1997) (<em>per curiam</em> ).</p>\n<p id=\"p-167\">The important point is not that the subpoena in this case should necessarily be governed by the particular tests used in these cases, most of which involved official records that were claimed to be privileged. Rather, the point is that we should not treat this subpoena like an ordinary grand jury subpoena and should not relegate a President to the meager defenses that are available when an ordinary grand jury subpoena is challenged. But that, at bottom, is the effect of the Court's decision.</p>\n<p id=\"p-168\">The Presidency deserves greater protection. Thus, in a case like this one, a prosecutor should be required (1) to provide at least a general description of the possible offenses that are under investigation, (2) to outline how the subpoenaed records relate to those offenses, and (3) to explain why it is important that the records be produced and why it is necessary for production to occur while the President is still in office.</p>\n<p id=\"p-169\">In the present case, the district attorney made a brief proffer, but important questions were left hanging. It would not be unduly burdensome to insist on answers before enforcing the subpoena.</p>\n<p id=\"p-170\">One obvious question concerns the scope of the subpoena. The subpoena issued by the grand jury is largely a copy of the subpoenas issued by Committees of the House of Representatives, and it would be quite a coincidence if the records relevant to an investigation of possible violations of New York criminal law just so happened to be almost identical to the records thought by congressional Committees to be useful in considering federal legislation. It is therefore appropriate to ask the district attorney to explain the need for the various items that the subpoena covers.</p>\n<p id=\"p-171\">The district attorney should also explain why it is important that the information in question be obtained from the President's records rather than another source. See, <em>e.g.</em> , <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"264\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 702</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"265\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> ; <em>Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"266\" url=\"https://cite.case.law/f3d/121/729/\">121 F.3d at 755</extracted-citation>. And the district attorney should set out why he finds it necessary that the records be produced now as opposed to when the President leaves office. At argument, respondent's counsel told us that his office's concern is the expiration of the statute of limitations,<footnotemark>11</footnotemark> but there are potential solutions to that problem. Even if New York law does not automatically suspend the statute of limitations for prosecuting a President until he leaves office,<footnotemark>12</footnotemark> it may be possible to eliminate the problem by waiver.<footnotemark>13</footnotemark> And if the prosecutor's statute-of-limitations concerns relate to parties other than the President, he should be required to spell that out.</p>\n<p id=\"p-172\">There may be other good reasons why immediate enforcement is important, such as the risk that evidence or important leads will be lost, but if a prosecutor believes that immediate enforcement is needed <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2450\" href=\"#p2450\" id=\"p2450\">*2450</a>for such a reason, the prosecutor should be required to provide a reasonably specific explanation why that is so and why alternative means, such as measures to preserve evidence and prevent spoliation, would not suffice.</p>\n<p id=\"p-173\">E</p>\n<p id=\"p-174\">Unlike this rule, which would not undermine any legitimate state interests, the opinion of the Court provides no real protection for the Presidency. The Court discounts the risk of harassment and assumes that state prosecutors will observe constitutional limitations, <em>ante</em> , at 2429, and I also assume that the great majority of state prosecutors will carry out their responsibilities responsibly. But for the reasons noted, there is a very real risk that some will not.</p>\n<p id=\"p-175\">The Court emphasizes the protection afforded by \"longstanding rules of grand jury secrecy,\" <em>ante</em> , at 2427, but that is no answer to the burdens that subpoenas may inflict, and in any event, grand jury secrecy rules are of limited value as safeguards against harassment. State laws on grand jury secrecy vary and often do not set out disclosure restrictions with the same specificity as federal law.<footnotemark>14</footnotemark></p>\n<p id=\"p-176\">Under New York law, the decision whether to disclose grand jury evidence is committed to the discretion of the supervising judge under a test that simply balances the need for secrecy against \"the public interest.\" <em>In re District Attorney of Suffolk Cty.</em> , <extracted-citation case-ids=\"4391357\" index=\"267\" url=\"https://cite.case.law/ny2d/58/436/#p444\">58 N.Y.2d 436</extracted-citation>, 444, <extracted-citation index=\"268\" url=\"https://cite.case.law/citations/?q=461%20N.Y.S.2d%20773\">461 N.Y.S.2d 773</extracted-citation>, <extracted-citation index=\"269\" url=\"https://cite.case.law/citations/?q=448%20N.E.2d%20440\">448 N.E.2d 440</extracted-citation>, 443-444 (1983) ; see also <em>People v. Fetcho</em> , <extracted-citation case-ids=\"525223\" index=\"270\" url=\"https://cite.case.law/ny2d/91/765/#p769\">91 N.Y.2d 765</extracted-citation>, 769, <extracted-citation case-ids=\"525223\" index=\"271\" url=\"https://cite.case.law/ny2d/91/765/#p769\">676 N.Y.S.2d 106</extracted-citation>, <extracted-citation case-ids=\"525223\" index=\"272\" url=\"https://cite.case.law/ny2d/91/765/#p769\">698 N.E.2d 935</extracted-citation>, 938 (1998). That test provides no solid protection for the Presidency. Reported New York decisions do not deal with whether this test restricts disclosure to, among others, a congressional committee, the state legislature, or the state attorney general and her staff for the purpose of civil litigation. Indeed, since New York legislators have attempted to enact laws to force the disclosure of some of the subpoenaed information, it is not impossible to imagine a trial judge's finding that public disclosure is in the \"public interest.\" And even where grand jury information is not lawfully disclosed, confidential law enforcement information is avidly sought by the media in high-profile cases, leaks of such information are not uncommon, and those responsible are seldom called to account.</p>\n<p id=\"p-177\">The Court notes that \"grand juries are prohibited from engaging\" in \" 'fishing expeditions,' \" <em>ante</em> , at 2428, but an objection on that ground is a very long shot under New York law. In New York, a grand jury subpoena need not be supported by probable cause, <em>In re Nassau Cty. Grand Jury Subpoena Duces Tecum Dated June 24, 2003</em> , <extracted-citation case-ids=\"618798\" index=\"273\" url=\"https://cite.case.law/ny3d/4/665/#p677\">4 N.Y.3d 665</extracted-citation>, 677-678, <extracted-citation case-ids=\"618798\" index=\"274\" url=\"https://cite.case.law/ny3d/4/665/#p677\">797 N.Y.S.2d 790</extracted-citation>, <extracted-citation case-ids=\"618798\" index=\"275\" url=\"https://cite.case.law/ny3d/4/665/#p677\">830 N.E.2d 1118</extracted-citation>, 1126 (2005), and a party seeking to quash a subpoena must show that the documents sought \"can have no conceivable relevance to any legitimate object of investigation.\" <em>In re Grand Jury Subpoenas for Locals 17, 135, and 608</em> , <extracted-citation case-ids=\"4408852\" index=\"276\" url=\"https://cite.case.law/ny2d/72/307/#p315\">72 N.Y.2d 307</extracted-citation>, 317, <extracted-citation index=\"277\" url=\"https://cite.case.law/citations/?q=532%20N.Y.S.2d%20722\">532 N.Y.S.2d 722</extracted-citation>, <extracted-citation index=\"278\" url=\"https://cite.case.law/citations/?q=528%20N.E.2d%201195\">528 N.E.2d 1195</extracted-citation>, 1201 (1988) (quoting <em>Virag v. Hynes</em> , <extracted-citation case-ids=\"2341761\" index=\"279\" url=\"https://cite.case.law/ny2d/54/437/#p442\">54 N.Y.2d 437</extracted-citation>, 444, <extracted-citation index=\"280\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\">446 N.Y.S.2d 196</extracted-citation>, <extracted-citation index=\"281\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\">430 N.E.2d 1249</extracted-citation>, 1253 (1981) ).</p>\n<p id=\"p-178\">The Court says that a President can \"<em>argue</em> that compliance with a particular subpoena would impede his constitutional duties,\" <em>ante</em> , at 2430 (emphasis added), but under the Court's opinions in this case and <em>Mazars</em> , it is not easy to see how such an argument could prevail. The Court makes clear that any stigma or damage to a President's reputation does not count, <em>ante</em> , at 2427, and in <em>Mazars</em> , the Court states that \"burdens on the President's <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2451\" href=\"#p2451\" id=\"p2451\">*2451</a>time and attention\" are generally not of constitutional concern, <em>post</em> , at 2450. Elsewhere in its opinion in this case, the Court takes the position that when a President's non-official records are subpoenaed, his treatment should be little different from that of any other subpoena recipient. <em>Ante</em> , at 2429. The most that the Court holds out is the possibility that there might be some unspecified extraordinary circumstances under which a President might obtain relief.</p>\n<p id=\"p-179\">Finally, the Court touts the ability of a President to challenge a subpoena by \" 'an affirmative showing of impropriety,' including 'bad faith' \" or retaliation for official acts. <em>Ante</em> , at 2428. But \"such objections are almost universally overruled.\" S. Beale et al., Grand Jury Law and Practice § 6:23, p. 6-243 (2014). Direct evidence of impropriety is rarely obtainable, and it will be a challenge to make a circumstantial case unless the prosecutor is required to provide the sort of showing outlined above.</p>\n<p id=\"p-180\">For all practical purposes, the Court's decision places a sitting President in the same unenviable position as any other person whose records are subpoenaed by a grand jury. See <em>ante</em> , at 2429.</p>\n<p id=\"p-181\">Attempting to justify this approach, the Court relies on Marshall's ruling in the Burr trial, but the Court ignores important differences between the situation in that case and the situation here. First, the subpoena in <em>Burr</em> was not issued by a grand jury at the behest of a prosecutor who was investigating the President. Instead, a defendant who was initially on trial for his life sought to obtain exculpatory evidence from the very man who was orchestrating the prosecution. <em>Ante</em> , at 2422. Marshall's ruling took note of the context in which the evidence was sought. He stated: \"If there be a paper in the possession of the executive, which is not of an official nature, he must stand, as respects that paper, in nearly the same situation with any other individual who possesses a paper <em>which might be required for the defense</em> .\" <em>Burr</em> , 25 F.Cas. at 191 (emphasis added).</p>\n<p id=\"p-182\">Second, it is significant that Burr, unlike the prosecutor in the present case, did not have the option of postponing his request for information until the President's term ended. Burr had not chosen to be charged or tried while Jefferson was in office, and by the time Jefferson's tenure ended, his trial was history. Third, because the case was prosecuted in federal court under federal law, it entirely lacked the federalism concerns that lie at the heart of the present case.</p>\n<p id=\"p-183\">The lesson we should take from Marshall's jurisprudence is the lesson of <em>McCulloch</em> -the importance of preventing a State from undermining the lawful exercise of authority conferred by the Constitution on the Federal Government. There is considerable irony in the Court's invocation of Marshall to defend a decision allowing a State's prosecutorial power to run roughshod over the functioning of a branch of the Federal Government.</p>\n<p id=\"p-184\">The Court's other examples of presidential subpoenas, far from supporting the Court's holding, actually show that usual procedures have been substantially altered in cases involving Presidents. In every one of the examples, a President did not testify in person, as is almost always required when a witness is subpoenaed to testify at a criminal trial or before a grand jury, but instead was deposed. <em>Ante</em> , at 2423 - 2424. The examples involving Presidents Ford and Carter occurred under modern federal rules of procedure, and allowing them to testify by deposition represented a sharp departure from conventional practice.<footnotemark>15</footnotemark></p>\n<p id=\"p-185\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2452\" href=\"#p2452\" id=\"p2452\">*2452</a>The Court turns to <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"282\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"283\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"284\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974), but that case arose under markedly different circumstances. Because the trial was in federal court, there was no issue of federalism, and the Court refused to order that the subpoena be quashed because of \"the demonstrated, specific need for evidence in a pending criminal trial.\" <em>Id</em> ., at 713, <extracted-citation case-ids=\"6174416\" index=\"285\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>. In the case now before us, a \"demonstrated, specific need\" is precisely what is lacking.</p>\n<p id=\"p-186\">This Court's decision in <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"286\" url=\"https://cite.case.law/us/520/681/#p704\">520 U. S. 681</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"287\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"288\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997), provides no greater support for today's decision. In that case, as noted, the lawsuit was brought in federal, not state, court, and while the subject of that particular civil suit was embarrassing, the Court addressed the broad question whether a President is immune from civil suits \" 'in all but the most exceptional cases.' \" <em>Id</em> ., at 692, <extracted-citation case-ids=\"11652833\" index=\"289\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. There is no question that a criminal prosecution holds far greater potential for distracting a President and diminishing his ability to carry out his responsibilities than does the average civil suit.</p>\n<p id=\"p-187\">* * *</p>\n<p id=\"p-188\">The subpoena at issue here is unprecedented. Never before has a local prosecutor subpoenaed the records of a sitting President. The Court's decision threatens to impair the functioning of the Presidency and provides no real protection against the use of the subpoena power by the Nation's 2,300+ local prosecutors. Respect for the structure of Government created by the Constitution demands greater protection for an institution that is vital to the Nation's safety and well-being.</p>\n<p id=\"p-189\">I therefore respectfully dissent.</p>\n<footnote label=\"1\">\n<p id=\"p-198\">As I see it, the standards identified by the majority opinion should be considered, in this context, Article II requirements, not just statutory or state-law requirements. Cf. <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"290\" url=\"https://cite.case.law/us/542/367/#p381\">542 U.S. 367</extracted-citation>, 385-392, <extracted-citation case-ids=\"2527206\" index=\"291\" url=\"https://cite.case.law/us/542/367/#p381\">124 S.Ct. 2576</extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"292\" url=\"https://cite.case.law/us/542/367/#p381\">159 L.Ed.2d 459</extracted-citation> (2004) ; <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"293\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. 681</extracted-citation>, 707, <extracted-citation case-ids=\"11652833\" index=\"294\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"295\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997) ; <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"296\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, 749-757, <extracted-citation case-ids=\"6194478\" index=\"297\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"298\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982) ; <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"299\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, 714-716, <extracted-citation case-ids=\"6174416\" index=\"300\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"301\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-199\">The same point-namely, that much may depend on future application-is also true of the four considerations articulated by the Court today in <em>Trump</em> v. <em>Mazars USA, LLP</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626376\" index=\"302\" url=\"https://cite.case.law/s-ct/140/2019/#p2034\">140 S.Ct. 2019</extracted-citation>, 2046-47, --- L.Ed.2d ---- (2020).</p>\n</footnote>\n<footnote label=\"1\">\n<p id=\"p-200\">I do not address the continuing validity of <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"303\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"304\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"305\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982), which no party asks us to revisit.</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-201\">This standard appears to be something that Chief Justice Marshall and President Jefferson, who were often at odds, could agree on. President Jefferson's concern was that the Executive would lose his independence if courts could \"withdraw him entirely from his constitutional duties.\" 10 Works of Thomas Jefferson 404, n. (P. Ford ed. 1905). Relief from enforcement when those duties preclude the President's compliance addresses these concerns.</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-202\">The President and the Solicitor General argue that the grand jury must make a showing of heightened need. I agree with the majority's decision not to adopt this standard, <em>ante</em> , at 2428 - 2430, but for different reasons. The constitutional question in this case is whether the President is able to perform the duties of his office, whereas a heightened need standard addresses a logically independent issue. Under a heightened-need standard, a grand jury with only the usual need for particular information would be refused it when the President is perfectly able to comply, while a grand jury with a heightened need would be entitled to it even if compliance would place undue obligations on the President. This result makes little sense and lacks any basis in the original understanding of the Constitution. I would leave questions of the grand jury's need to state law.</p>\n</footnote>\n<footnote label=\"4\">\n<p id=\"p-206\"><em>Kern-Limerick, Inc. v. Scurlock</em> , <extracted-citation case-ids=\"11299543\" index=\"306\" url=\"https://cite.case.law/us/347/110/#p117\">347 U.S. 110</extracted-citation>, 117, <extracted-citation case-ids=\"11299543\" index=\"307\" url=\"https://cite.case.law/us/347/110/#p117\">74 S.Ct. 403</extracted-citation>, <extracted-citation index=\"308\" url=\"https://cite.case.law/citations/?q=98%20L.%20Ed.%20546\">98 L.Ed. 546</extracted-citation> (1954) (noting that \"recognition of the constitutional immunity of the Federal Government from state exactions rests, of course, upon unquestioned authority\"); <em>Mayo v. United States</em> , <extracted-citation case-ids=\"366486\" index=\"309\" url=\"https://cite.case.law/us/319/441/#p445\">319 U.S. 441</extracted-citation>, 447, <extracted-citation case-ids=\"366486\" index=\"310\" url=\"https://cite.case.law/us/319/441/#p445\">63 S.Ct. 1137</extracted-citation>, <extracted-citation case-ids=\"366486\" index=\"311\" url=\"https://cite.case.law/us/319/441/#p445\">87 L.Ed. 1504</extracted-citation> (1943) (\"These inspection fees are laid directly upon the United States. They are money exactions the payment of which, if they are enforceable, would be required before executing a function of government. Such a requirement is prohibited by the supremacy clause\"); <em>Clallam County v. United States</em> , <extracted-citation case-ids=\"6141709\" index=\"312\" url=\"https://cite.case.law/us/263/341/#p344\">263 U.S. 341</extracted-citation>, 344, <extracted-citation case-ids=\"6141709\" index=\"313\" url=\"https://cite.case.law/us/263/341/#p344\">44 S.Ct. 121</extracted-citation>, <extracted-citation case-ids=\"6141709\" index=\"314\" url=\"https://cite.case.law/us/263/341/#p344\">68 L.Ed. 328</extracted-citation> (1923) (holding that property owned by the United States is immune from state taxation); see also <em>Weston v. City Council of Charleston</em> , <extracted-citation case-ids=\"11338440\" index=\"315\" url=\"https://cite.case.law/us/27/449/#p469\">2 Pet. 449</extracted-citation>, 469, <extracted-citation case-ids=\"11338440\" index=\"316\" url=\"https://cite.case.law/us/27/449/#p469\">7 L.Ed. 481</extracted-citation> (1829) (\"The tax on government stock is thought by this Court to be a tax on the contract, a tax on the power to borrow money on the credit of the United States, and consequently to be repugnant to the constitution\"); <em>Osborn v. Bank of United States</em> , <extracted-citation case-ids=\"1421282\" index=\"317\" url=\"https://cite.case.law/us/22/738/#p867\">9 Wheat. 738</extracted-citation>, 867, <extracted-citation case-ids=\"1421282\" index=\"318\" url=\"https://cite.case.law/us/22/738/#p867\">22 U.S. 738</extracted-citation>, <extracted-citation case-ids=\"1421282\" index=\"319\" url=\"https://cite.case.law/us/22/738/#p867\">6 L.Ed. 204</extracted-citation> (1824) (\"If the trade of the Bank be essential to its character, as a machine for the fiscal operations of the government, that trade must be as exempt from State control as the actual conveyance of the public money. Indeed, a tax bears upon the whole machine; as well upon the faculty of collecting and transmitting the money of the nation, as on that of discounting the notes of individuals. No distinction is taken between them\"); <em>Dawson</em> v. <em>Steager</em> , 586 U. S. ----, ----, <extracted-citation case-ids=\"12623909\" index=\"320\" url=\"https://cite.case.law/s-ct/139/698/#p702\">139 S.Ct. 698</extracted-citation>, 702-703, <extracted-citation case-ids=\"12623909\" index=\"321\" url=\"https://cite.case.law/s-ct/139/698/#p702\">203 L.Ed.2d 29</extracted-citation> (2019) (surveying Court precedent on intergovernmental tax immunity).</p>\n</footnote>\n<footnote label=\"5\">\n<p id=\"p-207\"><em>Goodyear Atomic Corp. v. Miller</em> , <extracted-citation case-ids=\"6212667\" index=\"322\" url=\"https://cite.case.law/us/486/174/#p180\">486 U.S. 174</extracted-citation>, 180, <extracted-citation case-ids=\"6212667\" index=\"323\" url=\"https://cite.case.law/us/486/174/#p180\">108 S.Ct. 1704</extracted-citation>, <extracted-citation case-ids=\"6212667\" index=\"324\" url=\"https://cite.case.law/us/486/174/#p180\">100 L.Ed.2d 158</extracted-citation> (1988) (\"It is well settled that the activities of federal installations are shielded by the Supremacy Clause from direct state regulation unless Congress provides 'clear and unambiguous' authorization for such regulation\"); <em><extracted-citation case-ids=\"6212667\" index=\"325\" url=\"https://cite.case.law/us/486/174/#p180\">id.</extracted-citation></em> , at 181, <extracted-citation case-ids=\"6212667\" index=\"326\" url=\"https://cite.case.law/us/486/174/#p180\">108 S.Ct. 1704</extracted-citation> (concluding that \"a federally owned facility performing a federal function is shielded from direct state regulation, even though the federal function is carried out by a private contractor, unless Congress clearly authorizes such regulation\"); <em>Hancock v. Train</em> , <extracted-citation case-ids=\"6175345\" index=\"327\" url=\"https://cite.case.law/us/426/167/#p178\">426 U.S. 167</extracted-citation>, 178-179, <extracted-citation case-ids=\"6175345\" index=\"328\" url=\"https://cite.case.law/us/426/167/#p178\">96 S.Ct. 2006</extracted-citation>, <extracted-citation case-ids=\"6175345\" index=\"329\" url=\"https://cite.case.law/us/426/167/#p178\">48 L.Ed.2d 555</extracted-citation> (1976) (rejecting state agency's bid to regulate a federal installation and surveying doctrines that establish that \" 'the federal function must be left free' of [state] regulation\"); see also <em>Leslie Miller, Inc. v. Arkansas</em> , <extracted-citation case-ids=\"6160029\" index=\"330\" url=\"https://cite.case.law/us/352/187/#p189\">352 U.S. 187</extracted-citation>, 189-190, <extracted-citation case-ids=\"6160029\" index=\"331\" url=\"https://cite.case.law/us/352/187/#p189\">77 S.Ct. 257</extracted-citation>, <extracted-citation case-ids=\"6160029\" index=\"332\" url=\"https://cite.case.law/us/352/187/#p189\">1 L.Ed.2d 231</extracted-citation> (1956) (<em>per curiam</em> ) (concluding that federal contractors cannot be forced to submit to state licensing procedures that would add to the qualifications required to receive the federal contract); <em>Johnson v. Maryland</em> , <extracted-citation case-ids=\"1160688\" index=\"333\" url=\"https://cite.case.law/us/254/51/#p57\">254 U.S. 51</extracted-citation>, 57, <extracted-citation case-ids=\"1160688\" index=\"334\" url=\"https://cite.case.law/us/254/51/#p57\">41 S.Ct. 16</extracted-citation>, <extracted-citation case-ids=\"1160688\" index=\"335\" url=\"https://cite.case.law/us/254/51/#p57\">65 L.Ed. 126</extracted-citation> (1920) (concluding that federal postal officials may not be required to get a state driver's license to perform their duties and explaining that \"the immunity of the instruments of the United States from state control in the performance of their duties extends to ... requirement[s] that they desist from performance until they satisfy a state officer upon examination that they are competent for a necessary part of them\"); <em>In re Neagle</em> , <extracted-citation case-ids=\"3543151\" index=\"336\" url=\"https://cite.case.law/us/135/1/#p75\">135 U.S. 1</extracted-citation>, 75, <extracted-citation case-ids=\"3543151\" index=\"337\" url=\"https://cite.case.law/us/135/1/#p75\">10 S.Ct. 658</extracted-citation>, <extracted-citation case-ids=\"3543151\" index=\"338\" url=\"https://cite.case.law/us/135/1/#p75\">34 L.Ed. 55</extracted-citation> (1890) (concluding that a federal official may not be \"held in the state court to answer for an act which he [or she] was authorized to do by the law of the United States\"); <em><extracted-citation case-ids=\"3543151\" index=\"339\" url=\"https://cite.case.law/us/135/1/#p75\">id.</extracted-citation></em> , at 62, <extracted-citation case-ids=\"3543151\" index=\"340\" url=\"https://cite.case.law/us/135/1/#p75\">10 S.Ct. 658</extracted-citation> (\"To cite all the cases in which this principle of the supremacy of the government of the United States, in the exercise of all the powers conferred upon it by the Constitution, is maintained, would be an endless task\"); <em>Tarble's Case</em> , <extracted-citation case-ids=\"1134192\" index=\"341\" url=\"https://cite.case.law/us/80/397/#p404\">13 Wall. 397</extracted-citation>, 404, <extracted-citation case-ids=\"1134192\" index=\"342\" url=\"https://cite.case.law/us/80/397/#p404\">20 L.Ed. 597</extracted-citation> (1872) (explaining that States have no authority to \"interfere with the authority of the United States, whether that authority be exercised by a Federal officer or be exercised by a Federal tribunal\"); <em>Crosby v. National Foreign Trade Council</em> , <extracted-citation case-ids=\"9413796\" index=\"343\" url=\"https://cite.case.law/us/530/363/#p376\">530 U.S. 363</extracted-citation>, 376-382, <extracted-citation case-ids=\"9413796\" index=\"344\" url=\"https://cite.case.law/us/530/363/#p376\">120 S.Ct. 2288</extracted-citation>, <extracted-citation case-ids=\"9413796\" index=\"345\" url=\"https://cite.case.law/us/530/363/#p376\">147 L.Ed.2d 352</extracted-citation> (2000) (explaining harm caused by state statutes that would \"compromise the very capacity of the President to speak for the Nation with one voice in dealing with other governments\"); <em>EPA v. California ex rel. State Water Resources Control Bd.</em> , <extracted-citation case-ids=\"6175499\" index=\"346\" url=\"https://cite.case.law/us/426/200/#p211\">426 U.S. 200</extracted-citation>, 211, <extracted-citation case-ids=\"6175499\" index=\"347\" url=\"https://cite.case.law/us/426/200/#p211\">96 S.Ct. 2022</extracted-citation>, <extracted-citation case-ids=\"6175499\" index=\"348\" url=\"https://cite.case.law/us/426/200/#p211\">48 L.Ed.2d 578</extracted-citation> (1976) (\"Federal installations are subject to state regulation only when and to the extent that congressional authorization is clear and unambiguous\"); <em>Arizona v. California</em> , <extracted-citation case-ids=\"434287\" index=\"349\" url=\"https://cite.case.law/us/283/423/#p451\">283 U.S. 423</extracted-citation>, 451, <extracted-citation case-ids=\"434287\" index=\"350\" url=\"https://cite.case.law/us/283/423/#p451\">51 S.Ct. 522</extracted-citation>, <extracted-citation case-ids=\"434287\" index=\"351\" url=\"https://cite.case.law/us/283/423/#p451\">75 L.Ed. 1154</extracted-citation> (1931) (\"The United States may perform its functions without conforming to the police regulations of a State\"); <em>Hunt v. United States</em> , <extracted-citation case-ids=\"3905681\" index=\"352\" url=\"https://cite.case.law/us/278/96/#p100\">278 U.S. 96</extracted-citation>, 100-101, <extracted-citation case-ids=\"3905681\" index=\"353\" url=\"https://cite.case.law/us/278/96/#p100\">49 S.Ct. 38</extracted-citation>, <extracted-citation case-ids=\"3905681\" index=\"354\" url=\"https://cite.case.law/us/278/96/#p100\">73 L.Ed. 200</extracted-citation> (1928) (recognizing that the United States was entitled to an injunction against state officers interfering with private citizens killing deer in national forest under authority of the United States).</p>\n</footnote>\n<footnote label=\"6\">\n<p id=\"p-208\">P. Kurland, Watergate and the Constitution 135 (1978).</p>\n</footnote>\n<footnote label=\"7\">\n<p id=\"p-209\">During oral argument in the Second Circuit, respondent's attorney said the following:</p>\n<p id=\"p-210\">\"It's hard for me to say that there could be no circumstance under which a President could ever imaginably be criminally charged or perhaps tried .... You can invent scenarios where you can imagine that it would be necessary or at least perhaps a good idea for a sitting President to be subject to a criminal charge even by a state while in office.\" Recording of Oral Arg. in No. 19-3204 (CA2, Oct. 23, 2019), at 28:20- 28:40; 36:35-36:45, https://www.ca2.uscourts.gov/decisions/oral_arguments.html.</p>\n<p id=\"p-211\">Respondent's brief in this case says only that \"[f]or the purpose of this case, the Court may assume ... that a sitting President is not amenable to criminal prosecution.\" Brief for Respondent Vance 24-25. During oral argument in this Court, however, counsel for respondent stated: \"We're mindful that as a state actor our office cannot investigate a president for any official acts and that we cannot prosecute a president while in office.\" Tr. of Oral Arg. 54.</p>\n</footnote>\n<footnote label=\"8\">\n<p id=\"p-212\">Atomic Heritage Foundation, Nuclear Briefcases (June 12, 2018), www.atomicheritage.org/history/nuclear-briefcases.</p>\n</footnote>\n<footnote label=\"9\">\n<p id=\"p-213\">Respondent asserts that his office has never characterized President Trump as a \"target\" of the investigation, Brief for Respondent Vance 29, n. 10, but by the same token, respondent has never said that the President is not a \"target.\" Moreover, the terms \"target\" and \"subject\" have no consistent legal meaning. The United States Attorney's Manual defines a \"target\" as \"a person as to whom the prosecutor or the grand jury has substantial evidence linking him or her to the commission of a crime and who, in the judgment of the prosecutor, is a putative defendant.\" Dept. of Justice, Justice Manual, Section 9-11.151 (Jan. 2020), https://www.justice.gov/jm/jm-9-11000-grand-jury#9-11.151/. \"A 'subject' of an investigation\" is defined as \"a person whose conduct is within the scope of the grand jury's investigation.\" <em><extracted-citation case-ids=\"3905681\" index=\"355\" url=\"https://cite.case.law/us/278/96/#p100\">Ibid.</extracted-citation></em> Of course, these definitions are not binding on the State of New York, but under them, it is apparent that the President is at least a \"subject.\"</p>\n</footnote>\n<footnote label=\"10\">\n<p id=\"p-214\">Dept. of Justice, Bureau of Justice Statistics, Prosecutors in State Courts, 2007-Statistical Tables 1 (Dec. 2011).</p>\n</footnote>\n<footnote label=\"11\">\n<p id=\"p-215\">Tr. of Oral Arg. 77, 102.</p>\n</footnote>\n<footnote label=\"12\">\n<p id=\"p-216\">See N. Y. Crim. Proc. Law Ann. § 30.10(4)(a) (West 2010) (statute tolled when defendant outside the jurisdiction); see also <em>People v. Knobel</em> , <extracted-citation case-ids=\"109968\" index=\"356\" url=\"https://cite.case.law/ny2d/94/226/#p230\">94 N.Y.2d 226</extracted-citation>, 230, <extracted-citation case-ids=\"109968\" index=\"357\" url=\"https://cite.case.law/ny2d/94/226/#p230\">701 N.Y.S.2d 695</extracted-citation>, <extracted-citation case-ids=\"109968\" index=\"358\" url=\"https://cite.case.law/ny2d/94/226/#p230\">723 N.E.2d 550</extracted-citation>, 552 (1999) (explaining New York rule for tolling the limitations period when a defendant is \"continuously outside\" the State and concluding that \"all periods of a day or more that a nonresident defendant is out-of-State should be totaled and toll the Statute of Limitations\").</p>\n</footnote>\n<footnote label=\"13\">\n<p id=\"p-217\">See <em>People v. Parilla</em> , <extracted-citation case-ids=\"5697523\" index=\"359\" url=\"https://cite.case.law/ny3d/8/654/#p659\">8 N.Y.3d 654</extracted-citation>, 659, <extracted-citation case-ids=\"5697523\" index=\"360\" url=\"https://cite.case.law/ny3d/8/654/#p659\">838 N.Y.S.2d 824</extracted-citation>, <extracted-citation case-ids=\"5697523\" index=\"361\" url=\"https://cite.case.law/ny3d/8/654/#p659\">870 N.E.2d 142</extracted-citation>, 145 (2007) ; R. Davis &amp; T. Muskus, New York Practice with Forms, 33A Carmody-Wait 2d § 186:34 (June 2020).</p>\n</footnote>\n<footnote label=\"14\">\n<p id=\"p-218\">S. Beale et al., Grand Jury Law and Practice §§ 5:3-5:4 (2018).</p>\n</footnote>\n<footnote label=\"15\">\n<p id=\"p-219\">When President Ford was subpoenaed as a defense witness in the trial of a woman who had attempted to assassinate him, the District Court ruled that Federal Rule of Criminal Procedure 15 allowed him to be deposed at a place of his choosing, instead of testifying in person, and provided for defense counsel but not the defendant herself to be present. Then, as now, Rule 15 permits a witness to be deposed under \"exceptional circumstances\" in order \"to preserve testimony for trial.\" This Rule is generally used when a witness may not be available to testify at trial, not simply when it would be burdensome or inconvenient for the witness to appear. The judge's application of the Rule in this case was innovative. In addition, the defendant was not present when President Ford was deposed. Repeating such a practice today might run into other obstacles. See <em>Coy v. Iowa</em> , <extracted-citation case-ids=\"1774862\" index=\"362\" url=\"https://cite.case.law/us/487/1012/#p1020\">487 U.S. 1012</extracted-citation>, 1020-1021, <extracted-citation case-ids=\"1774862\" index=\"363\" url=\"https://cite.case.law/us/487/1012/#p1020\">108 S.Ct. 2798</extracted-citation>, <extracted-citation case-ids=\"1774862\" index=\"364\" url=\"https://cite.case.law/us/487/1012/#p1020\">101 L.Ed.2d 857</extracted-citation> (1988) ; see also Rule 15(c) (providing for the defendant's presence during the deposition).</p>\n<p id=\"p-220\">A similar procedure appears to have been followed when President Carter testified as a prosecution witness in a criminal trial. No reported case explains the legal authority cited as justification for excusing live testimony, but Rule 15 may have been invoked. As for President Carter's testimony by deposition before a grand jury, although neither the Federal Rules of Evidence nor the Confrontation Clause apply to federal grand jury proceedings, testimony by deposition is nevertheless not the norm.</p>\n</footnote>\n</opinion>", "html_with_citations": "<opinion type=\"dissent\">\n<author id=\"p-124\">Justice ALITO, dissenting.</author>\n<p id=\"p-125\">This case is almost certain to be portrayed as a case about the current President and the current political situation, but the case has a much deeper significance. While the decision will of course have a direct effect on President Trump, what the Court holds today will also affect all future Presidents-which is to say, it will affect the Presidency, and that is a matter of great and lasting importance to the Nation.</p>\n<p id=\"p-126\">The event that precipitated this case is unprecedented. Respondent Vance, an elected state prosecutor, launched a criminal investigation of a sitting President and obtained a grand jury subpoena for his records. The specific question before us-whether the subpoena may be enforced-cannot be answered adequately without considering the broader question that frames it: whether the Constitution imposes <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2440\" href=\"#p2440\" id=\"p2440\">*2440</a>restrictions on a State's deployment of its criminal law enforcement powers against a sitting President. If the Constitution sets no such limits, then a local prosecutor may prosecute a sitting President. And if that is allowed, it follows <em>a fortiori</em> that the subpoena at issue can be enforced. On the other hand, if the Constitution does not permit a State to prosecute a sitting President, the next logical question is whether the Constitution restrains any other prosecutorial or investigative weapons.</p>\n<p id=\"p-127\">These are important questions that go to the very structure of the Government created by the Constitution. In evaluating these questions, two important structural features must be taken into account.</p>\n<p id=\"p-128\">I</p>\n<p id=\"p-129\">A</p>\n<p id=\"p-130\">The first is the nature and role of the Presidency. The Presidency, like Congress and the Supreme Court, is a permanent institution created by the Constitution. All three of these institutions are distinct from the human beings who serve in them at any point in time. In the case of Congress or the Supreme Court, the distinction is easy to perceive, since they have multiple Members. But because \"[t]he President is the only person who alone composes a branch of government ..., there is not always a clear line between his personal and official affairs.\" <em>Trump v. Mazars USA, LLP</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626376\" index=\"225\" url=\"https://cite.case.law/s-ct/140/2019/#p2034\"><span class=\"citation\" data-id=\"9889202\"><a href=\"/opinion/4766665/trump-v-mazars-usa-llp/\" aria-description=\"Citation for case: Trump v. Mazars USA, LLP\">140 S.Ct. 2019</a></span></extracted-citation>, 2034, --- L.Ed.2d ---- (2020). As a result, the law's treatment of the person who serves as President can have an important effect on the institution, and the institution of the Presidency plays an indispensable role in our constitutional system.</p>\n<p id=\"p-131\">The Constitution entrusts the President with responsibilities that are essential to the country's safety and wellbeing. The President is Commander in Chief of the Armed Forces. Art. II, § 2, cl. 1. He is responsible for the defense of the country from the moment he enters office until the moment he leaves.</p>\n<p id=\"p-132\">The President also has the lead role in foreign relations. He \"make[s]\" treaties with the advice and consent of the Senate, Art. II, § 2, cl. 2, decides whether to recognize foreign governments, <em>Zivotofsky v. Kerry</em> , <extracted-citation index=\"226\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\"><span class=\"citation no-link\">576 U.S. 1</span></extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"227\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">135 S.Ct. 2076</a></span></extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"228\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">192 L.Ed.2d 83</a></span></extracted-citation> (2015), enters into and rescinds executive agreements with other countries,<footnotemark>1</footnotemark> meets with foreign leaders, appoints ambassadors, Art. II, § 2, cl. 2, oversees the work of the State Department and intelligence agencies, and exercises important foreign-relations powers under statutes and treaties that give him broad discretion in matters relating to subjects such as terrorism, trade, and immigration.<footnotemark>2</footnotemark></p>\n<p id=\"p-133\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2441\" href=\"#p2441\" id=\"p2441\">*2441</a>The Constitution vests the President with \"the executive Power\" of the United States, Art. II, § 1, cl. 1, and entrusts him with the responsibility \"to take Care that the Laws be faithfully executed,\" § 3. As the head of the Executive Branch, the President is ultimately responsible for everything done by all the departments and agencies of the Federal Government and a federal civilian work force that includes millions of employees. These weighty responsibilities impose enormous burdens on the time and energy of any occupant of the Presidency.</p>\n<p id=\"p-134\">\"Constitutionally speaking, the President never sleeps. The President must be ready, at a moment's notice, to do whatever it takes to preserve, protect, and defend the Constitution and the American people.\" Amar &amp; Katyal, Executive Privileges and Immunities: The Nixon and Clinton Cases, <extracted-citation index=\"229\" url=\"https://cite.case.law/citations/?q=108%20Harv.%20L.%20Rev.%20701\"><span class=\"citation no-link\">108 Harv. L. Rev. 701</span></extracted-citation>, 713 (1995). Without a President who is able at all times to carry out the responsibilities of the office, our constitutional system could not operate, and the country would be at risk. That is why the Twenty-fifth Amendment created a mechanism for temporarily transferring the responsibilities of the office to the Vice President if the President is incapacitated for even a brief time. The Amendment has been explicitly invoked on only two occasions, each time for a period of about two hours.<footnotemark>3</footnotemark> This mechanism reflects an appreciation that the Nation cannot <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2442\" href=\"#p2442\" id=\"p2442\">*2442</a>be safely left without a functioning President for even a brief time.</p>\n<p id=\"p-135\">B</p>\n<p id=\"p-136\">The second structural feature is the relationship between the Federal Government and the States. Just as our Constitution balances power against power among the branches of the Federal Government, it also divides power between the Federal Government and the States. The Constitution permitted the States to retain many of the sovereign powers that they previously possessed, see, <em>e.g</em> ., <em>Murphy v. National Collegiate Athletic Assn.</em> , 584 U. S. ----, <extracted-citation case-ids=\"12611443\" index=\"230\" url=\"https://cite.case.law/s-ct/138/1461/\"><span class=\"citation\" data-id=\"4274908\"><a href=\"/opinion/4497655/murphy-v-national-collegiate-athletic-assn/\" aria-description=\"Citation for case: Murphy v. National Collegiate Athletic Assn.\">138 S.Ct. 1461</a></span></extracted-citation>, <extracted-citation case-ids=\"12611443\" index=\"231\" url=\"https://cite.case.law/s-ct/138/1461/\"><span class=\"citation\" data-id=\"4274908\"><a href=\"/opinion/4497655/murphy-v-national-collegiate-athletic-assn/\" aria-description=\"Citation for case: Murphy v. National Collegiate Athletic Assn.\">200 L.Ed.2d 854</a></span></extracted-citation> (2018), but it gave the Federal Government powers that were deemed essential for the Nation's well-being and, indeed, its survival. And it provided for the Federal Government to be independent of and, within its allotted sphere, supreme over the States. Art. VI, cl. 2. Accordingly, a State may not block or interfere with the lawful work of the National Government.</p>\n<p id=\"p-137\">This was an enduring lesson of Chief Justice Marshall's landmark opinion for the Court in <em>McCulloch v. Maryland</em> , <extracted-citation case-ids=\"4702\" index=\"232\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 Wheat. 316</a></span></extracted-citation>, <extracted-citation case-ids=\"4702\" index=\"233\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 L.Ed. 579</a></span></extracted-citation> (1819). As is well known, the case concerned the attempt by the State of Maryland to regulate and tax the federally chartered Second Bank of the United States. After holding that Congress had the authority to establish the bank, <em>id</em> ., at 425, Marshall's opinion went on to conclude that the State could not tax it. Marshall recognized that the States retained the \"sovereign\" power to tax persons and entities within their jurisdiction, <em>id</em> ., at 429, but this power, he explained, \"is subordinate to, and may be controlled by the constitution of the United States.\" <em><extracted-citation case-ids=\"4702\" index=\"234\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">Id.</a></span></extracted-citation></em> , at 427. Noting the potency of the taxing power (\"[a] right to tax without limit or control, is essentially a power to destroy,\" <em>id</em> ., at 391 ), he concluded that a State's power to tax had to give way to Congress's authority to charter the bank. In his words, the state power to tax could not be used to \"defeat the legitimate operations,\" <em><extracted-citation case-ids=\"4702\" index=\"235\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">id.</a></span></extracted-citation></em> , at 427, of the Federal Government or \"to retard, impede, burden, or in any manner control\" it, <em>id</em> ., at 436. Marshall thus held, not simply that Maryland was barred from assessing a crushing tax that threatened the bank's ability to operate, but that the State could not tax the bank at all. He wrote:</p>\n<blockquote id=\"p-138\">\"We are not driven to the perplexing inquiry, so unfit for the judicial department, what degree of taxation is the legitimate use, and what degree may amount to the abuse of the power. The attempt to use it on the means employed by the government of the Union, in pursuance of the constitution, is itself an abuse.\" <em>Id</em> ., at 430.</blockquote>\n<p id=\"p-139\">Even a rule allowing a state tax that did not discriminate between the federally chartered bank and state banks was ruled out. Instead, he concluded that preservation of the Constitution's federal structure demanded that any state effort to tax a federal instrumentality be nipped in the bud.</p>\n<p id=\"p-140\">Building on this principle of federalism, two centuries of case law prohibit the States from taxing,<footnotemark>4</footnotemark> regulating, or otherwise <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2443\" href=\"#p2443\" id=\"p2443\">*2443</a>interfering with the lawful work of federal agencies, instrumentalities, and officers.<footnotemark>5</footnotemark> The Court premised these cases on the principle that \"the activities of the Federal Government are free from regulation by any State. No other adjustment of competing enactments or legal principles is possible.\" <em>Mayo v. United States</em> , <extracted-citation case-ids=\"366486\" index=\"236\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">319 U.S. 441</a></span></extracted-citation>, 445, <extracted-citation case-ids=\"366486\" index=\"237\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">63 S.Ct. 1137</a></span></extracted-citation>, <extracted-citation case-ids=\"366486\" index=\"238\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">87 L.Ed. 1504</a></span></extracted-citation> (1943) (footnote omitted). <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2444\" href=\"#p2444\" id=\"p2444\">*2444</a>II</p>\n<p id=\"p-141\">A</p>\n<p id=\"p-142\">In <em><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">McCulloch</a></span></em> , Maryland's sovereign taxing power had to yield, and in a similar way, a State's sovereign power to enforce its criminal laws must accommodate the indispensable role that the Constitution assigns to the Presidency. This must be the rule with respect to a state prosecution of a sitting President. Both the structure of the Government established by the Constitution and the Constitution's provisions on the impeachment and removal of a President make it clear that the prosecution of a sitting President is out of the question. It has been aptly said that the President is the \"sole indispensable man in government,\"<footnotemark>6</footnotemark> and subjecting a sitting President to criminal prosecution would severely hamper his ability to carry out the vital responsibilities that the Constitution puts in his hands.</p>\n<p id=\"p-143\">Justice Joseph Story endorsed this reasoning in his famous treatise. He wrote that a President's responsibilities necessarily entail \"the power to perform [those duties], without any obstruction or impediment whatsoever,\" and that, as a result, a President is not \"liable to arrest, imprisonment, or detention\" while in office. 3 Commentaries on the Constitution of the United States § 1563, pp. 418-419 (1833).</p>\n<p id=\"p-144\">The constitutional provisions on impeachment provide further support for the rule that a President may not be prosecuted while in office. The Framers foresaw the need to provide for the possibility that a President might be implicated in the commission of a serious offense, and they did not want the country to be forced to endure such a President for the remainder of his term in office. But when a President has been elected by the people pursuant to the procedures set out in the Constitution, it is no small thing to overturn that choice. The Framers therefore crafted a special set of procedures to deal with that contingency. They put the charging decision in the hands of a body that represents all the people (the House of Representatives), not a single prosecutor or the members of a local grand jury. And they entrusted the weighty decision whether to remove a President to a supermajority of Senators, who were expected to exercise reasoned judgment and not the political passions of the day or the sentiments of a particular region.</p>\n<p id=\"p-145\">The Constitution not only sets out the procedures for dealing with a President who is suspected of committing a serious offense; it also specifies the consequences of a judgment adverse to the President. After providing that the judgment cannot impose any punishment beyond removal from the Presidency and disqualification from holding any other federal office, the Constitution states that \"the Party convicted shall nevertheless be liable and subject to Indictment, Trial, Judgment, and Punishment, according to Law.\" Art. I, § 3, cl. 7. The plain implication is that criminal prosecution, like removal from the Presidency and disqualification from other offices, is a consequence that can come about only after the Senate's judgment, not during or prior to the Senate trial.</p>\n<p id=\"p-146\">This was how Hamilton explained the impeachment provisions in the Federalist Papers. He wrote that a President may \"be impeached, tried, and, upon conviction ...<em>would afterwards be liable to prosecution and punishment in the ordinary course of law</em> .\" The Federalist No. 69, p. 416 (C. Rossiter ed. 1961) (emphasis added); see also <em>id</em> ., No. 77, at 464 (A. Hamilton) (a President is \"at all times liable to impeachment, trial, [and] dismission from <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2445\" href=\"#p2445\" id=\"p2445\">*2445</a>office,\" but any other punishment must come only \"by <em>subsequent prosecution</em> in the common course of law\" (emphasis added)).</p>\n<p id=\"p-147\">In the proceedings below, neither respondent, nor the District Court, nor the Second Circuit was willing to concede the fundamental point that a sitting President may not be prosecuted by a local district attorney. Respondent has said that he is investigating the President and, until oral argument in this Court, he never foreswore an intention to charge the President while he is still in office.<footnotemark>7</footnotemark> The District Court conceded only that \"perhaps\" a sitting President could not be prosecuted for an offense punishable by \"lengthy imprisonment\" but that an offense requiring only a short trial would be another matter. <extracted-citation index=\"239\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\"><span class=\"citation no-link\">395 F.Supp.3d 283</span></extracted-citation>, 289, 311 (SDNY 2019). And the Second Circuit was silent on the question.</p>\n<p id=\"p-148\">The scenario apparently contemplated by the District Court is striking. If a sitting President were charged in New York County, would he be arrested and fingerprinted? He would presumably be required to appear for arraignment in criminal court, where the judge would set the conditions for his release. Could he be sent to Rikers Island or be required to post bail? Could the judge impose restrictions on his travel? If the President were scheduled to travel abroad-perhaps to attend a G-7 meeting-would he have to get judicial approval? If the President were charged with a complicated offense requiring a long trial, would he have to put his Presidential responsibilities aside for weeks on end while sitting in a Manhattan courtroom? While the trial was in progress, would aides be able to approach him and whisper in his ear about pressing matters? Would he be able to obtain a recess whenever he needed to speak with an aide at greater length or attend to an urgent matter, such as speaking with a foreign leader? Could he effectively carry out all his essential Presidential responsibilities after the trial day ended and at the same time adequately confer with his trial attorneys regarding his defense? Or should he be expected to give up the right to attend his own trial and be tried in absentia? And if he were convicted, could he be imprisoned? Would aides be installed in a nearby cell?</p>\n<p id=\"p-149\">This entire imagined scene is farcical. The \"right of all the People to a functioning government\" would be sacrificed. Amar &amp; Kalt, The Presidential Privilege Against Prosecution, 2 Nexus 11, 14 (1997). \"Does anyone really think, in a country where common crimes are usually brought before state grand juries by state prosecutors, that it is feasible to subject the president-and thus the country-to every district attorney with a reckless mania for self-promotion?\" C. Black &amp; P. Bobbitt, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2446\" href=\"#p2446\" id=\"p2446\">*2446</a>Impeachment: A Handbook 112 (2018). See also R. Moss, Asst. Atty. Gen., A Sitting President's Amenability to Indictment and Criminal Prosecution, 24 Op. Office of Legal Counsel (OLC) 222, 260 (2000) (Moss Memo); Memorandum from R. Dixon, Asst. Atty. Gen., OLC, Re: Amenability of the President, Vice President, and Other Civil Officers to Federal Criminal Prosecution While in Office (Sept. 24, 1973).</p>\n<p id=\"p-150\">B</p>\n<p id=\"p-151\">While the prosecution of a sitting President provides the most dramatic example of a clash between the indispensable work of the Presidency and a State's exercise of its criminal law enforcement powers, other examples are easy to imagine. Suppose state officers obtained and sought to execute a search warrant for a sitting President's private quarters in the White House. Suppose a state court authorized surveillance of a telephone that a sitting President was known to use. Or suppose that a sitting President was subpoenaed to testify before a state grand jury and, as is generally the rule, no Presidential aides, even those carrying the so-called \"nuclear football,\"<footnotemark>8</footnotemark> were permitted to enter the grand jury room. What these examples illustrate is a principle that this Court has recognized: legal proceedings involving a sitting President must take the responsibilities and demands of the office into account. See <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"240\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. 681</a></span></extracted-citation>, 707, <extracted-citation case-ids=\"11652833\" index=\"241\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"242\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997).</p>\n<p id=\"p-152\">It is not enough to recite sayings like \"no man is above the law\" and \"the public has a right to every man's evidence.\" <em>Ante</em> , at 2420. These sayings are true-and important-but they beg the question. The law applies equally to all persons, including a person who happens for a period of time to occupy the Presidency. But there is no question that the nature of the office demands in some instances that the application of laws be adjusted at least until the person's term in office ends.</p>\n<p id=\"p-153\">C</p>\n<p id=\"p-154\">I now come to the specific investigative weapon at issue in the case before us-a subpoena for a sitting President's records. This weapon is less intrusive in an immediate sense than those mentioned above. Since the records are held by, and the subpoena was issued to, a third party, compliance would not require much work on the President's part. And after all, this is just one subpoena.</p>\n<p id=\"p-155\">But we should heed the \"great jurist,\" <em>ante</em> , at 2431, who rejected a similar argument in <em><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">McCulloch</a></span></em> . If we say that a subpoena to a third party is insufficient to undermine a President's performance of his duties, what about a subpoena served on the President himself? Surely in that case, the President could turn over the work of gathering the requested documents to attorneys or others recruited to perform the task. And if one subpoena is permitted, what about two? Or three? Or ten? Drawing a line based on such factors would involve the same sort of \"perplexing inquiry, so unfit for the judicial department\" that Marshall rejected in <em>McCulloch</em> , <extracted-citation case-ids=\"4702\" index=\"243\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 Wheat. at 430</a></span></extracted-citation>.</p>\n<p id=\"p-156\">The Court faced a similar issue when it considered whether a President can be sued for an allegedly unlawful act committed in the performance of official duties. See <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"244\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"245\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"246\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982). We did not ask whether the particular suit before <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2447\" href=\"#p2447\" id=\"p2447\">*2447</a>us would have interfered with the carrying out of Presidential duties. (It could not have had that effect because President Nixon had already left office.)</p>\n<p id=\"p-157\">Instead, we adopted a rule for all such suits, and we should take a similar approach here. The rule should take into account both the effect of subpoenas on the functioning of the Presidency and the risk that they will be used for harassment.</p>\n<p id=\"p-158\">I turn first to the question of the effect of a state grand jury subpoena for a President's records. When the issuance of such a subpoena is part of an investigation that regards the President as a \"target\" or \"subject,\"<footnotemark>9</footnotemark> the subpoena can easily impair a President's \"energetic performance of [his] constitutional duties.\" <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"247\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">542 U.S. 367</a></span></extracted-citation>, 382, <extracted-citation case-ids=\"2527206\" index=\"248\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">124 S.Ct. 2576</a></span></extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"249\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">159 L.Ed.2d 459</a></span></extracted-citation> (2004). Few individuals will simply brush off an indication that they may be within a prosecutor's crosshairs. Few will put the matter out of their minds and go about their work unaffected. For many, the prospect of prosecution will be the first and last thing on their minds every day.</p>\n<p id=\"p-159\">We have come to expect our Presidents to shoulder burdens that very few people could bear, but it is unrealistic to think that the prospect of possible criminal prosecution will not interfere with the performance of the duties of the office. \"[C]riminal litigation uniquely requires [a] President's personal time and energy, and will inevitably entail a considerable if not overwhelming degree of mental preoccupation.\" Moss Memo 254 (emphasis deleted). See also Kavanaugh, Separation of Powers During the Forty-Fourth Presidency and Beyond, <extracted-citation index=\"250\" url=\"https://cite.case.law/citations/?q=93%20Minn.%20L.%20Rev.%201454\"><span class=\"citation no-link\">93 Minn. L. Rev. 1454</span></extracted-citation>, 1461 (2009) (\"[A] President who is concerned about an ongoing criminal investigation is almost inevitably going to do a worse job as President\").</p>\n<p id=\"p-160\">As for the potential use of subpoenas to harass, we need not \" 'exhibit a naiveté from which ordinary citizens are free.' \" <em>Department of Commerce v. New York</em> , 588 U. S. ----, ----, <extracted-citation case-ids=\"12620860\" index=\"251\" url=\"https://cite.case.law/s-ct/139/2551/#p2575\"><span class=\"citation\" data-id=\"9888811\"><a href=\"/opinion/4633471/department-of-commerce-v-new-york/\" aria-description=\"Citation for case: Department of Commerce v. New York\">139 S.Ct. 2551</a></span></extracted-citation>, 2575, <extracted-citation case-ids=\"12620860\" index=\"252\" url=\"https://cite.case.law/s-ct/139/2551/#p2575\"><span class=\"citation\" data-id=\"9888811\"><a href=\"/opinion/4633471/department-of-commerce-v-new-york/\" aria-description=\"Citation for case: Department of Commerce v. New York\">204 L.Ed.2d 978</a></span></extracted-citation> (2019). As we have recognized, a President is \"an easily identifiable target.\" <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"253\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. at 752</a></span>-753</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"254\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>. There are more than 2,300 local prosecutors and district attorneys in the country.<footnotemark>10</footnotemark> Many local prosecutors are elected, and many prosecutors have ambitions for higher elected office. (Respondent's famous predecessor Thomas E. Dewey used the office of District Attorney for New York County as a springboard to the governorship of New York and to the Republican nomination for President in 1944 and 1948.) If a sitting President is intensely unpopular in a particular district-and that is a common condition-targeting the President may be an alluring and effective electoral strategy. But it is a strategy that would undermine our constitutional structure.</p>\n<p id=\"p-161\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2448\" href=\"#p2448\" id=\"p2448\">*2448</a>The Framers understood the importance of protecting the Presidency from interference by the States. At the Constitutional Convention, James Wilson argued that the President should be \"as independent as possible ... of the States.\" 1 Records of the Federal Convention of 1787, p. 69 (M. Farrand ed. 1911). He and James Madison successfully opposed a proposal to vest the impeachment power in state legislatures, contending that this \"would open a door for intrigues agst. [the President] in States where his administration tho' just might be unpopular, and might tempt him to pay court to particular States whose leading partizans he might fear.\" <em>Id</em> ., at 86. And to prevent a State from compromising a President's independence, the Convention adopted a provision barring a President from receiving an \"Emolument\" from any State, U. S. Const., Art. II, § 1, cl. 7. See The Federalist No. 73, at 494 (J. Cooke ed. 1961) (A. Hamilton).</p>\n<p id=\"p-162\">Two centuries later, the Court's decision in <em><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Clinton</a></span></em> reflected a similar concern. The Court held that a sitting President could be sued in federal court, but the Court took pains to reserve judgment on the question whether \"a comparable claim might succeed in a state tribunal.\" <extracted-citation case-ids=\"11652833\" index=\"255\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 691</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"256\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. \"[A]ny direct control by a state court over the President,\" the Court observed, might raise concerns about \"protecting federal officials from possible local prejudice.\" <em>Ibid</em> ., and n. 13.</p>\n<p id=\"p-163\">D</p>\n<p id=\"p-164\">In light of the above, a subpoena like the one now before us should not be enforced unless it meets a test that takes into account the need to prevent interference with a President's discharge of the responsibilities of the office. I agree with the Court that not all such subpoenas should be barred. There may be situations in which there is an urgent and critical need for the subpoenaed information. The situation in the Burr trial, where the documents at issue were sought by a criminal defendant to defend against a charge of treason, is a good example. But in a case like the one at hand, a subpoena should not be allowed unless a heightened standard is met.</p>\n<p id=\"p-165\">Prior cases involving Presidential subpoenas have always applied special, heightened standards. In the Burr trial, Chief Justice Marshall was careful to note that \"in no case of this kind would a court be required to proceed against the president as against an ordinary individual,\" and he held that the subpoena to President Jefferson was permissible only because the prosecutor had shown that the materials sought were \"essential to the justice of the [pending criminal] case.\" <em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"257\" url=\"https://cite.case.law/f-cas/25/187/#p192\"><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. 187</a></span></extracted-citation>, 192, (No. 14694) (CC Va. 1807) (brackets omitted).</p>\n<p id=\"p-166\">In <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"258\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"259\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"260\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974), where the Watergate Special Prosecutor subpoenaed tape recordings and documents under the control of President Nixon, this Court refused to quash the subpoena because there was a \"demonstrated, specific need for [the] evidence in a pending criminal trial.\" <em>Id</em> ., at 713, <extracted-citation case-ids=\"6174416\" index=\"261\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>. In an earlier Watergate-related case where a Senate Committee subpoenaed President Nixon's White House tapes, the D. C. Circuit refused to order their production because the Committee had failed to show that \"the subpoenaed evidence [wa]s demonstrably critical to the responsible fulfillment of the Committee's functions.\" <em>Senate Select Committee on Presidential Campaign Activities v. Nixon</em> , <extracted-citation case-ids=\"3681739,169479\" index=\"262\" url=\"https://cite.case.law/f2d/498/725/\"><span class=\"citation\" data-id=\"7279447\"><a href=\"/opinion/7360703/senate-select-committee-on-presidential-campaign-activities-v-nixon/\" aria-description=\"Citation for case: Senate Select Committee on Presidential Campaign...\">498 F.2d 725</a></span></extracted-citation>, 731 (1974). Later, when an independent counsel investigating a Cabinet officer wanted to enforce a federal grand jury subpoena for privileged materials held <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2449\" href=\"#p2449\" id=\"p2449\">*2449</a>by the White House counsel, the D. C. Circuit explained that enforcement demanded a \" 'demonstrated, specific need' \" for the materials sought. <em>In re Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"263\" url=\"https://cite.case.law/f3d/121/729/\"><span class=\"citation\" data-id=\"6953569\"><a href=\"/opinion/7050191/in-re-sealed-case/\" aria-description=\"Citation for case: In re Sealed Case\">121 F.3d 729</a></span></extracted-citation>, 736 (1997) (<em>per curiam</em> ).</p>\n<p id=\"p-167\">The important point is not that the subpoena in this case should necessarily be governed by the particular tests used in these cases, most of which involved official records that were claimed to be privileged. Rather, the point is that we should not treat this subpoena like an ordinary grand jury subpoena and should not relegate a President to the meager defenses that are available when an ordinary grand jury subpoena is challenged. But that, at bottom, is the effect of the Court's decision.</p>\n<p id=\"p-168\">The Presidency deserves greater protection. Thus, in a case like this one, a prosecutor should be required (1) to provide at least a general description of the possible offenses that are under investigation, (2) to outline how the subpoenaed records relate to those offenses, and (3) to explain why it is important that the records be produced and why it is necessary for production to occur while the President is still in office.</p>\n<p id=\"p-169\">In the present case, the district attorney made a brief proffer, but important questions were left hanging. It would not be unduly burdensome to insist on answers before enforcing the subpoena.</p>\n<p id=\"p-170\">One obvious question concerns the scope of the subpoena. The subpoena issued by the grand jury is largely a copy of the subpoenas issued by Committees of the House of Representatives, and it would be quite a coincidence if the records relevant to an investigation of possible violations of New York criminal law just so happened to be almost identical to the records thought by congressional Committees to be useful in considering federal legislation. It is therefore appropriate to ask the district attorney to explain the need for the various items that the subpoena covers.</p>\n<p id=\"p-171\">The district attorney should also explain why it is important that the information in question be obtained from the President's records rather than another source. See, <em>e.g.</em> , <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"264\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 702</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"265\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> ; <em>Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"266\" url=\"https://cite.case.law/f3d/121/729/\"><span class=\"citation\" data-id=\"6953569\"><a href=\"/opinion/7050191/in-re-sealed-case/\" aria-description=\"Citation for case: In re Sealed Case\">121 F.3d at 755</a></span></extracted-citation>. And the district attorney should set out why he finds it necessary that the records be produced now as opposed to when the President leaves office. At argument, respondent's counsel told us that his office's concern is the expiration of the statute of limitations,<footnotemark>11</footnotemark> but there are potential solutions to that problem. Even if New York law does not automatically suspend the statute of limitations for prosecuting a President until he leaves office,<footnotemark>12</footnotemark> it may be possible to eliminate the problem by waiver.<footnotemark>13</footnotemark> And if the prosecutor's statute-of-limitations concerns relate to parties other than the President, he should be required to spell that out.</p>\n<p id=\"p-172\">There may be other good reasons why immediate enforcement is important, such as the risk that evidence or important leads will be lost, but if a prosecutor believes that immediate enforcement is needed <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2450\" href=\"#p2450\" id=\"p2450\">*2450</a>for such a reason, the prosecutor should be required to provide a reasonably specific explanation why that is so and why alternative means, such as measures to preserve evidence and prevent spoliation, would not suffice.</p>\n<p id=\"p-173\">E</p>\n<p id=\"p-174\">Unlike this rule, which would not undermine any legitimate state interests, the opinion of the Court provides no real protection for the Presidency. The Court discounts the risk of harassment and assumes that state prosecutors will observe constitutional limitations, <em>ante</em> , at 2429, and I also assume that the great majority of state prosecutors will carry out their responsibilities responsibly. But for the reasons noted, there is a very real risk that some will not.</p>\n<p id=\"p-175\">The Court emphasizes the protection afforded by \"longstanding rules of grand jury secrecy,\" <em>ante</em> , at 2427, but that is no answer to the burdens that subpoenas may inflict, and in any event, grand jury secrecy rules are of limited value as safeguards against harassment. State laws on grand jury secrecy vary and often do not set out disclosure restrictions with the same specificity as federal law.<footnotemark>14</footnotemark></p>\n<p id=\"p-176\">Under New York law, the decision whether to disclose grand jury evidence is committed to the discretion of the supervising judge under a test that simply balances the need for secrecy against \"the public interest.\" <em>In re District Attorney of Suffolk Cty.</em> , <extracted-citation case-ids=\"4391357\" index=\"267\" url=\"https://cite.case.law/ny2d/58/436/#p444\"><span class=\"citation\" data-id=\"5535264\"><a href=\"/opinion/5686229/in-re-district-attorney/\" aria-description=\"Citation for case: In re District Attorney\">58 N.Y.2d 436</a></span></extracted-citation>, 444, <extracted-citation index=\"268\" url=\"https://cite.case.law/citations/?q=461%20N.Y.S.2d%20773\"><span class=\"citation\" data-id=\"5535264\"><a href=\"/opinion/5686229/in-re-district-attorney/\" aria-description=\"Citation for case: In re District Attorney\">461 N.Y.S.2d 773</a></span></extracted-citation>, <extracted-citation index=\"269\" url=\"https://cite.case.law/citations/?q=448%20N.E.2d%20440\"><span class=\"citation\" data-id=\"5535264\"><a href=\"/opinion/5686229/in-re-district-attorney/\" aria-description=\"Citation for case: In re District Attorney\">448 N.E.2d 440</a></span></extracted-citation>, 443-444 (1983) ; see also <em>People v. Fetcho</em> , <extracted-citation case-ids=\"525223\" index=\"270\" url=\"https://cite.case.law/ny2d/91/765/#p769\"><span class=\"citation\" data-id=\"2083379\"><a href=\"/opinion/2083379/people-v-fetcho/\" aria-description=\"Citation for case: People v. Fetcho\">91 N.Y.2d 765</a></span></extracted-citation>, 769, <extracted-citation case-ids=\"525223\" index=\"271\" url=\"https://cite.case.law/ny2d/91/765/#p769\"><span class=\"citation\" data-id=\"2083379\"><a href=\"/opinion/2083379/people-v-fetcho/\" aria-description=\"Citation for case: People v. Fetcho\">676 N.Y.S.2d 106</a></span></extracted-citation>, <extracted-citation case-ids=\"525223\" index=\"272\" url=\"https://cite.case.law/ny2d/91/765/#p769\"><span class=\"citation\" data-id=\"2083379\"><a href=\"/opinion/2083379/people-v-fetcho/\" aria-description=\"Citation for case: People v. Fetcho\">698 N.E.2d 935</a></span></extracted-citation>, 938 (1998). That test provides no solid protection for the Presidency. Reported New York decisions do not deal with whether this test restricts disclosure to, among others, a congressional committee, the state legislature, or the state attorney general and her staff for the purpose of civil litigation. Indeed, since New York legislators have attempted to enact laws to force the disclosure of some of the subpoenaed information, it is not impossible to imagine a trial judge's finding that public disclosure is in the \"public interest.\" And even where grand jury information is not lawfully disclosed, confidential law enforcement information is avidly sought by the media in high-profile cases, leaks of such information are not uncommon, and those responsible are seldom called to account.</p>\n<p id=\"p-177\">The Court notes that \"grand juries are prohibited from engaging\" in \" 'fishing expeditions,' \" <em>ante</em> , at 2428, but an objection on that ground is a very long shot under New York law. In New York, a grand jury subpoena need not be supported by probable cause, <em>In re Nassau Cty. Grand Jury Subpoena Duces Tecum Dated June 24, 2003</em> , <extracted-citation case-ids=\"618798\" index=\"273\" url=\"https://cite.case.law/ny3d/4/665/#p677\"><span class=\"citation\" data-id=\"2058941\"><a href=\"/opinion/2058941/in-re-nassau-county-grand-jury-subpoena-duces-tecum-dated-june-24-2003/\" aria-description=\"Citation for case: In Re Nassau County Grand Jury Subpoena Duces Tecum Dated...\">4 N.Y.3d 665</a></span></extracted-citation>, 677-678, <extracted-citation case-ids=\"618798\" index=\"274\" url=\"https://cite.case.law/ny3d/4/665/#p677\"><span class=\"citation\" data-id=\"2058941\"><a href=\"/opinion/2058941/in-re-nassau-county-grand-jury-subpoena-duces-tecum-dated-june-24-2003/\" aria-description=\"Citation for case: In Re Nassau County Grand Jury Subpoena Duces Tecum Dated...\">797 N.Y.S.2d 790</a></span></extracted-citation>, <extracted-citation case-ids=\"618798\" index=\"275\" url=\"https://cite.case.law/ny3d/4/665/#p677\"><span class=\"citation\" data-id=\"2058941\"><a href=\"/opinion/2058941/in-re-nassau-county-grand-jury-subpoena-duces-tecum-dated-june-24-2003/\" aria-description=\"Citation for case: In Re Nassau County Grand Jury Subpoena Duces Tecum Dated...\">830 N.E.2d 1118</a></span></extracted-citation>, 1126 (2005), and a party seeking to quash a subpoena must show that the documents sought \"can have no conceivable relevance to any legitimate object of investigation.\" <em>In re Grand Jury Subpoenas for Locals 17, 135, and 608</em> , <extracted-citation case-ids=\"4408852\" index=\"276\" url=\"https://cite.case.law/ny2d/72/307/#p315\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">72 N.Y.2d 307</a></span></extracted-citation>, 317, <extracted-citation index=\"277\" url=\"https://cite.case.law/citations/?q=532%20N.Y.S.2d%20722\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">532 N.Y.S.2d 722</a></span></extracted-citation>, <extracted-citation index=\"278\" url=\"https://cite.case.law/citations/?q=528%20N.E.2d%201195\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">528 N.E.2d 1195</a></span></extracted-citation>, 1201 (1988) (quoting <em>Virag v. Hynes</em> , <extracted-citation case-ids=\"2341761\" index=\"279\" url=\"https://cite.case.law/ny2d/54/437/#p442\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">54 N.Y.2d 437</a></span></extracted-citation>, 444, <extracted-citation index=\"280\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">446 N.Y.S.2d 196</a></span></extracted-citation>, <extracted-citation index=\"281\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">430 N.E.2d 1249</a></span></extracted-citation>, 1253 (1981) ).</p>\n<p id=\"p-178\">The Court says that a President can \"<em>argue</em> that compliance with a particular subpoena would impede his constitutional duties,\" <em>ante</em> , at 2430 (emphasis added), but under the Court's opinions in this case and <em>Mazars</em> , it is not easy to see how such an argument could prevail. The Court makes clear that any stigma or damage to a President's reputation does not count, <em>ante</em> , at 2427, and in <em>Mazars</em> , the Court states that \"burdens on the President's <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2451\" href=\"#p2451\" id=\"p2451\">*2451</a>time and attention\" are generally not of constitutional concern, <em>post</em> , at 2450. Elsewhere in its opinion in this case, the Court takes the position that when a President's non-official records are subpoenaed, his treatment should be little different from that of any other subpoena recipient. <em>Ante</em> , at 2429. The most that the Court holds out is the possibility that there might be some unspecified extraordinary circumstances under which a President might obtain relief.</p>\n<p id=\"p-179\">Finally, the Court touts the ability of a President to challenge a subpoena by \" 'an affirmative showing of impropriety,' including 'bad faith' \" or retaliation for official acts. <em>Ante</em> , at 2428. But \"such objections are almost universally overruled.\" S. Beale et al., Grand Jury Law and Practice § 6:23, p. 6-243 (2014). Direct evidence of impropriety is rarely obtainable, and it will be a challenge to make a circumstantial case unless the prosecutor is required to provide the sort of showing outlined above.</p>\n<p id=\"p-180\">For all practical purposes, the Court's decision places a sitting President in the same unenviable position as any other person whose records are subpoenaed by a grand jury. See <em>ante</em> , at 2429.</p>\n<p id=\"p-181\">Attempting to justify this approach, the Court relies on Marshall's ruling in the Burr trial, but the Court ignores important differences between the situation in that case and the situation here. First, the subpoena in <em><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> was not issued by a grand jury at the behest of a prosecutor who was investigating the President. Instead, a defendant who was initially on trial for his life sought to obtain exculpatory evidence from the very man who was orchestrating the prosecution. <em>Ante</em> , at 2422. Marshall's ruling took note of the context in which the evidence was sought. He stated: \"If there be a paper in the possession of the executive, which is not of an official nature, he must stand, as respects that paper, in nearly the same situation with any other individual who possesses a paper <em>which might be required for the defense</em> .\" <em>Burr</em> , <span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/#191\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. at 191</a></span> (emphasis added).</p>\n<p id=\"p-182\">Second, it is significant that Burr, unlike the prosecutor in the present case, did not have the option of postponing his request for information until the President's term ended. Burr had not chosen to be charged or tried while Jefferson was in office, and by the time Jefferson's tenure ended, his trial was history. Third, because the case was prosecuted in federal court under federal law, it entirely lacked the federalism concerns that lie at the heart of the present case.</p>\n<p id=\"p-183\">The lesson we should take from Marshall's jurisprudence is the lesson of <em><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">McCulloch</a></span></em> -the importance of preventing a State from undermining the lawful exercise of authority conferred by the Constitution on the Federal Government. There is considerable irony in the Court's invocation of Marshall to defend a decision allowing a State's prosecutorial power to run roughshod over the functioning of a branch of the Federal Government.</p>\n<p id=\"p-184\">The Court's other examples of presidential subpoenas, far from supporting the Court's holding, actually show that usual procedures have been substantially altered in cases involving Presidents. In every one of the examples, a President did not testify in person, as is almost always required when a witness is subpoenaed to testify at a criminal trial or before a grand jury, but instead was deposed. <em>Ante</em> , at 2423 - 2424. The examples involving Presidents Ford and Carter occurred under modern federal rules of procedure, and allowing them to testify by deposition represented a sharp departure from conventional practice.<footnotemark>15</footnotemark></p>\n<p id=\"p-185\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2452\" href=\"#p2452\" id=\"p2452\">*2452</a>The Court turns to <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"282\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"283\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"284\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974), but that case arose under markedly different circumstances. Because the trial was in federal court, there was no issue of federalism, and the Court refused to order that the subpoena be quashed because of \"the demonstrated, specific need for evidence in a pending criminal trial.\" <em>Id</em> ., at 713, <extracted-citation case-ids=\"6174416\" index=\"285\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>. In the case now before us, a \"demonstrated, specific need\" is precisely what is lacking.</p>\n<p id=\"p-186\">This Court's decision in <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"286\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U. S. 681</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"287\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"288\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997), provides no greater support for today's decision. In that case, as noted, the lawsuit was brought in federal, not state, court, and while the subject of that particular civil suit was embarrassing, the Court addressed the broad question whether a President is immune from civil suits \" 'in all but the most exceptional cases.' \" <em>Id</em> ., at 692, <extracted-citation case-ids=\"11652833\" index=\"289\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. There is no question that a criminal prosecution holds far greater potential for distracting a President and diminishing his ability to carry out his responsibilities than does the average civil suit.</p>\n<p id=\"p-187\">* * *</p>\n<p id=\"p-188\">The subpoena at issue here is unprecedented. Never before has a local prosecutor subpoenaed the records of a sitting President. The Court's decision threatens to impair the functioning of the Presidency and provides no real protection against the use of the subpoena power by the Nation's 2,300+ local prosecutors. Respect for the structure of Government created by the Constitution demands greater protection for an institution that is vital to the Nation's safety and well-being.</p>\n<p id=\"p-189\">I therefore respectfully dissent.</p>\n<footnote label=\"1\">\n<p id=\"p-198\">As I see it, the standards identified by the majority opinion should be considered, in this context, Article II requirements, not just statutory or state-law requirements. Cf. <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"290\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">542 U.S. 367</a></span></extracted-citation>, 385-392, <extracted-citation case-ids=\"2527206\" index=\"291\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">124 S.Ct. 2576</a></span></extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"292\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">159 L.Ed.2d 459</a></span></extracted-citation> (2004) ; <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"293\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. 681</a></span></extracted-citation>, 707, <extracted-citation case-ids=\"11652833\" index=\"294\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"295\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997) ; <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"296\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, 749-757, <extracted-citation case-ids=\"6194478\" index=\"297\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"298\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982) ; <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"299\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, 714-716, <extracted-citation case-ids=\"6174416\" index=\"300\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"301\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-199\">The same point-namely, that much may depend on future application-is also true of the four considerations articulated by the Court today in <em>Trump</em> v. <em>Mazars USA, LLP</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626376\" index=\"302\" url=\"https://cite.case.law/s-ct/140/2019/#p2034\"><span class=\"citation\" data-id=\"9889202\"><a href=\"/opinion/4766665/trump-v-mazars-usa-llp/\" aria-description=\"Citation for case: Trump v. Mazars USA, LLP\">140 S.Ct. 2019</a></span></extracted-citation>, 2046-47, --- L.Ed.2d ---- (2020).</p>\n</footnote>\n<footnote label=\"1\">\n<p id=\"p-200\">I do not address the continuing validity of <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"303\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"304\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"305\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982), which no party asks us to revisit.</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-201\">This standard appears to be something that Chief Justice Marshall and President Jefferson, who were often at odds, could agree on. President Jefferson's concern was that the Executive would lose his independence if courts could \"withdraw him entirely from his constitutional duties.\" 10 Works of Thomas Jefferson 404, n. (P. Ford ed. 1905). Relief from enforcement when those duties preclude the President's compliance addresses these concerns.</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-202\">The President and the Solicitor General argue that the grand jury must make a showing of heightened need. I agree with the majority's decision not to adopt this standard, <em>ante</em> , at 2428 - 2430, but for different reasons. The constitutional question in this case is whether the President is able to perform the duties of his office, whereas a heightened need standard addresses a logically independent issue. Under a heightened-need standard, a grand jury with only the usual need for particular information would be refused it when the President is perfectly able to comply, while a grand jury with a heightened need would be entitled to it even if compliance would place undue obligations on the President. This result makes little sense and lacks any basis in the original understanding of the Constitution. I would leave questions of the grand jury's need to state law.</p>\n</footnote>\n<footnote label=\"4\">\n<p id=\"p-206\"><em>Kern-Limerick, Inc. v. Scurlock</em> , <extracted-citation case-ids=\"11299543\" index=\"306\" url=\"https://cite.case.law/us/347/110/#p117\"><span class=\"citation\" data-id=\"9421036\"><a href=\"/opinion/105193/kern-limerick-inc-v-scurlock/\" aria-description=\"Citation for case: Kern-Limerick, Inc. v. Scurlock\">347 U.S. 110</a></span></extracted-citation>, 117, <extracted-citation case-ids=\"11299543\" index=\"307\" url=\"https://cite.case.law/us/347/110/#p117\"><span class=\"citation\" data-id=\"9421036\"><a href=\"/opinion/105193/kern-limerick-inc-v-scurlock/\" aria-description=\"Citation for case: Kern-Limerick, Inc. v. Scurlock\">74 S.Ct. 403</a></span></extracted-citation>, <extracted-citation index=\"308\" url=\"https://cite.case.law/citations/?q=98%20L.%20Ed.%20546\"><span class=\"citation\" data-id=\"9421036\"><a href=\"/opinion/105193/kern-limerick-inc-v-scurlock/\" aria-description=\"Citation for case: Kern-Limerick, Inc. v. Scurlock\">98 L.Ed. 546</a></span></extracted-citation> (1954) (noting that \"recognition of the constitutional immunity of the Federal Government from state exactions rests, of course, upon unquestioned authority\"); <em>Mayo v. United States</em> , <extracted-citation case-ids=\"366486\" index=\"309\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">319 U.S. 441</a></span></extracted-citation>, 447, <extracted-citation case-ids=\"366486\" index=\"310\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">63 S.Ct. 1137</a></span></extracted-citation>, <extracted-citation case-ids=\"366486\" index=\"311\" url=\"https://cite.case.law/us/319/441/#p445\"><span class=\"citation\" data-id=\"103853\"><a href=\"/opinion/103853/mayo-v-united-states/\" aria-description=\"Citation for case: Mayo v. United States\">87 L.Ed. 1504</a></span></extracted-citation> (1943) (\"These inspection fees are laid directly upon the United States. They are money exactions the payment of which, if they are enforceable, would be required before executing a function of government. Such a requirement is prohibited by the supremacy clause\"); <em>Clallam County v. United States</em> , <extracted-citation case-ids=\"6141709\" index=\"312\" url=\"https://cite.case.law/us/263/341/#p344\"><span class=\"citation\" data-id=\"100299\"><a href=\"/opinion/100299/clallam-county-v-united-states/\" aria-description=\"Citation for case: Clallam County v. United States\">263 U.S. 341</a></span></extracted-citation>, 344, <extracted-citation case-ids=\"6141709\" index=\"313\" url=\"https://cite.case.law/us/263/341/#p344\"><span class=\"citation\" data-id=\"100299\"><a href=\"/opinion/100299/clallam-county-v-united-states/\" aria-description=\"Citation for case: Clallam County v. United States\">44 S.Ct. 121</a></span></extracted-citation>, <extracted-citation case-ids=\"6141709\" index=\"314\" url=\"https://cite.case.law/us/263/341/#p344\"><span class=\"citation\" data-id=\"100299\"><a href=\"/opinion/100299/clallam-county-v-united-states/\" aria-description=\"Citation for case: Clallam County v. United States\">68 L.Ed. 328</a></span></extracted-citation> (1923) (holding that property owned by the United States is immune from state taxation); see also <em>Weston v. City Council of Charleston</em> , <extracted-citation case-ids=\"11338440\" index=\"315\" url=\"https://cite.case.law/us/27/449/#p469\"><span class=\"citation\" data-id=\"9416307\"><a href=\"/opinion/85642/weston-and-others-v-the-city-council-of-charleston/\" aria-description=\"Citation for case: Weston and Others v. the City Council of Charleston\">2 Pet. 449</a></span></extracted-citation>, 469, <extracted-citation case-ids=\"11338440\" index=\"316\" url=\"https://cite.case.law/us/27/449/#p469\"><span class=\"citation\" data-id=\"9416307\"><a href=\"/opinion/85642/weston-and-others-v-the-city-council-of-charleston/\" aria-description=\"Citation for case: Weston and Others v. the City Council of Charleston\">7 L.Ed. 481</a></span></extracted-citation> (1829) (\"The tax on government stock is thought by this Court to be a tax on the contract, a tax on the power to borrow money on the credit of the United States, and consequently to be repugnant to the constitution\"); <em>Osborn v. Bank of United States</em> , <extracted-citation case-ids=\"1421282\" index=\"317\" url=\"https://cite.case.law/us/22/738/#p867\"><span class=\"citation\" data-id=\"85451\"><a href=\"/opinion/85451/osborn-v-bank-of-united-states/\" aria-description=\"Citation for case: Osborn v. Bank of United States\">9 Wheat. 738</a></span></extracted-citation>, 867, <extracted-citation case-ids=\"1421282\" index=\"318\" url=\"https://cite.case.law/us/22/738/#p867\"><span class=\"citation\" data-id=\"85451\"><a href=\"/opinion/85451/osborn-v-bank-of-united-states/\" aria-description=\"Citation for case: Osborn v. Bank of United States\">22 U.S. 738</a></span></extracted-citation>, <extracted-citation case-ids=\"1421282\" index=\"319\" url=\"https://cite.case.law/us/22/738/#p867\"><span class=\"citation\" data-id=\"85451\"><a href=\"/opinion/85451/osborn-v-bank-of-united-states/\" aria-description=\"Citation for case: Osborn v. Bank of United States\">6 L.Ed. 204</a></span></extracted-citation> (1824) (\"If the trade of the Bank be essential to its character, as a machine for the fiscal operations of the government, that trade must be as exempt from State control as the actual conveyance of the public money. Indeed, a tax bears upon the whole machine; as well upon the faculty of collecting and transmitting the money of the nation, as on that of discounting the notes of individuals. No distinction is taken between them\"); <em>Dawson</em> v. <em>Steager</em> , 586 U. S. ----, ----, <extracted-citation case-ids=\"12623909\" index=\"320\" url=\"https://cite.case.law/s-ct/139/698/#p702\"><span class=\"citation\" data-id=\"4369170\"><a href=\"/opinion/4591917/dawson-v-steager/\" aria-description=\"Citation for case: Dawson v. Steager\">139 S.Ct. 698</a></span></extracted-citation>, 702-703, <extracted-citation case-ids=\"12623909\" index=\"321\" url=\"https://cite.case.law/s-ct/139/698/#p702\"><span class=\"citation\" data-id=\"4369170\"><a href=\"/opinion/4591917/dawson-v-steager/\" aria-description=\"Citation for case: Dawson v. Steager\">203 L.Ed.2d 29</a></span></extracted-citation> (2019) (surveying Court precedent on intergovernmental tax immunity).</p>\n</footnote>\n<footnote label=\"5\">\n<p id=\"p-207\"><em>Goodyear Atomic Corp. v. Miller</em> , <extracted-citation case-ids=\"6212667\" index=\"322\" url=\"https://cite.case.law/us/486/174/#p180\"><span class=\"citation\" data-id=\"9431313\"><a href=\"/opinion/112075/goodyear-atomic-corp-v-miller/\" aria-description=\"Citation for case: Goodyear Atomic Corp. v. Miller\">486 U.S. 174</a></span></extracted-citation>, 180, <extracted-citation case-ids=\"6212667\" index=\"323\" url=\"https://cite.case.law/us/486/174/#p180\"><span class=\"citation\" data-id=\"9431313\"><a href=\"/opinion/112075/goodyear-atomic-corp-v-miller/\" aria-description=\"Citation for case: Goodyear Atomic Corp. v. Miller\">108 S.Ct. 1704</a></span></extracted-citation>, <extracted-citation case-ids=\"6212667\" index=\"324\" url=\"https://cite.case.law/us/486/174/#p180\"><span class=\"citation\" data-id=\"9431313\"><a href=\"/opinion/112075/goodyear-atomic-corp-v-miller/\" aria-description=\"Citation for case: Goodyear Atomic Corp. v. Miller\">100 L.Ed.2d 158</a></span></extracted-citation> (1988) (\"It is well settled that the activities of federal installations are shielded by the Supremacy Clause from direct state regulation unless Congress provides 'clear and unambiguous' authorization for such regulation\"); <em><extracted-citation case-ids=\"6212667\" index=\"325\" url=\"https://cite.case.law/us/486/174/#p180\"><span class=\"citation\" data-id=\"9431313\"><a href=\"/opinion/112075/goodyear-atomic-corp-v-miller/\" aria-description=\"Citation for case: Goodyear Atomic Corp. v. Miller\">id.</a></span></extracted-citation></em> , at 181, <extracted-citation case-ids=\"6212667\" index=\"326\" url=\"https://cite.case.law/us/486/174/#p180\"><span class=\"citation\" data-id=\"9431313\"><a href=\"/opinion/112075/goodyear-atomic-corp-v-miller/\" aria-description=\"Citation for case: Goodyear Atomic Corp. v. Miller\">108 S.Ct. 1704</a></span></extracted-citation> (concluding that \"a federally owned facility performing a federal function is shielded from direct state regulation, even though the federal function is carried out by a private contractor, unless Congress clearly authorizes such regulation\"); <em>Hancock v. Train</em> , <extracted-citation case-ids=\"6175345\" index=\"327\" url=\"https://cite.case.law/us/426/167/#p178\"><span class=\"citation\" data-id=\"109467\"><a href=\"/opinion/109467/hancock-v-train/\" aria-description=\"Citation for case: Hancock v. Train\">426 U.S. 167</a></span></extracted-citation>, 178-179, <extracted-citation case-ids=\"6175345\" index=\"328\" url=\"https://cite.case.law/us/426/167/#p178\"><span class=\"citation\" data-id=\"109467\"><a href=\"/opinion/109467/hancock-v-train/\" aria-description=\"Citation for case: Hancock v. Train\">96 S.Ct. 2006</a></span></extracted-citation>, <extracted-citation case-ids=\"6175345\" index=\"329\" url=\"https://cite.case.law/us/426/167/#p178\"><span class=\"citation\" data-id=\"109467\"><a href=\"/opinion/109467/hancock-v-train/\" aria-description=\"Citation for case: Hancock v. Train\">48 L.Ed.2d 555</a></span></extracted-citation> (1976) (rejecting state agency's bid to regulate a federal installation and surveying doctrines that establish that \" 'the federal function must be left free' of [state] regulation\"); see also <em>Leslie Miller, Inc. v. Arkansas</em> , <extracted-citation case-ids=\"6160029\" index=\"330\" url=\"https://cite.case.law/us/352/187/#p189\"><span class=\"citation\" data-id=\"105435\"><a href=\"/opinion/105435/leslie-miller-inc-v-arkansas/\" aria-description=\"Citation for case: Leslie Miller, Inc. v. Arkansas\">352 U.S. 187</a></span></extracted-citation>, 189-190, <extracted-citation case-ids=\"6160029\" index=\"331\" url=\"https://cite.case.law/us/352/187/#p189\"><span class=\"citation\" data-id=\"105435\"><a href=\"/opinion/105435/leslie-miller-inc-v-arkansas/\" aria-description=\"Citation for case: Leslie Miller, Inc. v. Arkansas\">77 S.Ct. 257</a></span></extracted-citation>, <extracted-citation case-ids=\"6160029\" index=\"332\" url=\"https://cite.case.law/us/352/187/#p189\"><span class=\"citation\" data-id=\"105435\"><a href=\"/opinion/105435/leslie-miller-inc-v-arkansas/\" aria-description=\"Citation for case: Leslie Miller, Inc. v. Arkansas\">1 L.Ed.2d 231</a></span></extracted-citation> (1956) (<em>per curiam</em> ) (concluding that federal contractors cannot be forced to submit to state licensing procedures that would add to the qualifications required to receive the federal contract); <em>Johnson v. Maryland</em> , <extracted-citation case-ids=\"1160688\" index=\"333\" url=\"https://cite.case.law/us/254/51/#p57\"><span class=\"citation\" data-id=\"99638\"><a href=\"/opinion/99638/johnson-v-maryland/\" aria-description=\"Citation for case: Johnson v. Maryland\">254 U.S. 51</a></span></extracted-citation>, 57, <extracted-citation case-ids=\"1160688\" index=\"334\" url=\"https://cite.case.law/us/254/51/#p57\"><span class=\"citation\" data-id=\"99638\"><a href=\"/opinion/99638/johnson-v-maryland/\" aria-description=\"Citation for case: Johnson v. Maryland\">41 S.Ct. 16</a></span></extracted-citation>, <extracted-citation case-ids=\"1160688\" index=\"335\" url=\"https://cite.case.law/us/254/51/#p57\"><span class=\"citation\" data-id=\"99638\"><a href=\"/opinion/99638/johnson-v-maryland/\" aria-description=\"Citation for case: Johnson v. Maryland\">65 L.Ed. 126</a></span></extracted-citation> (1920) (concluding that federal postal officials may not be required to get a state driver's license to perform their duties and explaining that \"the immunity of the instruments of the United States from state control in the performance of their duties extends to ... requirement[s] that they desist from performance until they satisfy a state officer upon examination that they are competent for a necessary part of them\"); <em>In re Neagle</em> , <extracted-citation case-ids=\"3543151\" index=\"336\" url=\"https://cite.case.law/us/135/1/#p75\"><span class=\"citation\" data-id=\"9417530\"><a href=\"/opinion/92766/in-re-neagle/\" aria-description=\"Citation for case: In Re Neagle\">135 U.S. 1</a></span></extracted-citation>, 75, <extracted-citation case-ids=\"3543151\" index=\"337\" url=\"https://cite.case.law/us/135/1/#p75\"><span class=\"citation\" data-id=\"9417530\"><a href=\"/opinion/92766/in-re-neagle/\" aria-description=\"Citation for case: In Re Neagle\">10 S.Ct. 658</a></span></extracted-citation>, <extracted-citation case-ids=\"3543151\" index=\"338\" url=\"https://cite.case.law/us/135/1/#p75\"><span class=\"citation\" data-id=\"9417530\"><a href=\"/opinion/92766/in-re-neagle/\" aria-description=\"Citation for case: In Re Neagle\">34 L.Ed. 55</a></span></extracted-citation> (1890) (concluding that a federal official may not be \"held in the state court to answer for an act which he [or she] was authorized to do by the law of the United States\"); <em><extracted-citation case-ids=\"3543151\" index=\"339\" url=\"https://cite.case.law/us/135/1/#p75\"><span class=\"citation\" data-id=\"9417530\"><a href=\"/opinion/92766/in-re-neagle/\" aria-description=\"Citation for case: In Re Neagle\">id.</a></span></extracted-citation></em> , at 62, <extracted-citation case-ids=\"3543151\" index=\"340\" url=\"https://cite.case.law/us/135/1/#p75\"><span class=\"citation\" data-id=\"9417530\"><a href=\"/opinion/92766/in-re-neagle/\" aria-description=\"Citation for case: In Re Neagle\">10 S.Ct. 658</a></span></extracted-citation> (\"To cite all the cases in which this principle of the supremacy of the government of the United States, in the exercise of all the powers conferred upon it by the Constitution, is maintained, would be an endless task\"); <em>Tarble's Case</em> , <extracted-citation case-ids=\"1134192\" index=\"341\" url=\"https://cite.case.law/us/80/397/#p404\"><span class=\"citation\" data-id=\"9416841\"><a href=\"/opinion/88476/tarbles-case/\" aria-description=\"Citation for case: Tarble&#x27;s Case\">13 Wall. 397</a></span></extracted-citation>, 404, <extracted-citation case-ids=\"1134192\" index=\"342\" url=\"https://cite.case.law/us/80/397/#p404\"><span class=\"citation\" data-id=\"9416841\"><a href=\"/opinion/88476/tarbles-case/\" aria-description=\"Citation for case: Tarble&#x27;s Case\">20 L.Ed. 597</a></span></extracted-citation> (1872) (explaining that States have no authority to \"interfere with the authority of the United States, whether that authority be exercised by a Federal officer or be exercised by a Federal tribunal\"); <em>Crosby v. National Foreign Trade Council</em> , <extracted-citation case-ids=\"9413796\" index=\"343\" url=\"https://cite.case.law/us/530/363/#p376\"><span class=\"citation\" data-id=\"9433982\"><a href=\"/opinion/118379/crosby-v-national-foreign-trade-council/\" aria-description=\"Citation for case: Crosby v. National Foreign Trade Council\">530 U.S. 363</a></span></extracted-citation>, 376-382, <extracted-citation case-ids=\"9413796\" index=\"344\" url=\"https://cite.case.law/us/530/363/#p376\"><span class=\"citation\" data-id=\"9433982\"><a href=\"/opinion/118379/crosby-v-national-foreign-trade-council/\" aria-description=\"Citation for case: Crosby v. National Foreign Trade Council\">120 S.Ct. 2288</a></span></extracted-citation>, <extracted-citation case-ids=\"9413796\" index=\"345\" url=\"https://cite.case.law/us/530/363/#p376\"><span class=\"citation\" data-id=\"9433982\"><a href=\"/opinion/118379/crosby-v-national-foreign-trade-council/\" aria-description=\"Citation for case: Crosby v. National Foreign Trade Council\">147 L.Ed.2d 352</a></span></extracted-citation> (2000) (explaining harm caused by state statutes that would \"compromise the very capacity of the President to speak for the Nation with one voice in dealing with other governments\"); <em>EPA v. California ex rel. State Water Resources Control Bd.</em> , <extracted-citation case-ids=\"6175499\" index=\"346\" url=\"https://cite.case.law/us/426/200/#p211\"><span class=\"citation\" data-id=\"109468\"><a href=\"/opinion/109468/environmental-protection-agency-v-california-ex-rel-state-water-resources/\" aria-description=\"Citation for case: Environmental Protection Agency v. California Ex Rel....\">426 U.S. 200</a></span></extracted-citation>, 211, <extracted-citation case-ids=\"6175499\" index=\"347\" url=\"https://cite.case.law/us/426/200/#p211\"><span class=\"citation\" data-id=\"109468\"><a href=\"/opinion/109468/environmental-protection-agency-v-california-ex-rel-state-water-resources/\" aria-description=\"Citation for case: Environmental Protection Agency v. California Ex Rel....\">96 S.Ct. 2022</a></span></extracted-citation>, <extracted-citation case-ids=\"6175499\" index=\"348\" url=\"https://cite.case.law/us/426/200/#p211\"><span class=\"citation\" data-id=\"109468\"><a href=\"/opinion/109468/environmental-protection-agency-v-california-ex-rel-state-water-resources/\" aria-description=\"Citation for case: Environmental Protection Agency v. California Ex Rel....\">48 L.Ed.2d 578</a></span></extracted-citation> (1976) (\"Federal installations are subject to state regulation only when and to the extent that congressional authorization is clear and unambiguous\"); <em>Arizona v. California</em> , <extracted-citation case-ids=\"434287\" index=\"349\" url=\"https://cite.case.law/us/283/423/#p451\"><span class=\"citation\" data-id=\"101749\"><a href=\"/opinion/101749/arizona-v-california/\" aria-description=\"Citation for case: Arizona v. California\">283 U.S. 423</a></span></extracted-citation>, 451, <extracted-citation case-ids=\"434287\" index=\"350\" url=\"https://cite.case.law/us/283/423/#p451\"><span class=\"citation\" data-id=\"101749\"><a href=\"/opinion/101749/arizona-v-california/\" aria-description=\"Citation for case: Arizona v. California\">51 S.Ct. 522</a></span></extracted-citation>, <extracted-citation case-ids=\"434287\" index=\"351\" url=\"https://cite.case.law/us/283/423/#p451\"><span class=\"citation\" data-id=\"101749\"><a href=\"/opinion/101749/arizona-v-california/\" aria-description=\"Citation for case: Arizona v. California\">75 L.Ed. 1154</a></span></extracted-citation> (1931) (\"The United States may perform its functions without conforming to the police regulations of a State\"); <em>Hunt v. United States</em> , <extracted-citation case-ids=\"3905681\" index=\"352\" url=\"https://cite.case.law/us/278/96/#p100\"><span class=\"citation\" data-id=\"101338\"><a href=\"/opinion/101338/hunt-v-united-states/\" aria-description=\"Citation for case: Hunt v. United States\">278 U.S. 96</a></span></extracted-citation>, 100-101, <extracted-citation case-ids=\"3905681\" index=\"353\" url=\"https://cite.case.law/us/278/96/#p100\"><span class=\"citation\" data-id=\"101338\"><a href=\"/opinion/101338/hunt-v-united-states/\" aria-description=\"Citation for case: Hunt v. United States\">49 S.Ct. 38</a></span></extracted-citation>, <extracted-citation case-ids=\"3905681\" index=\"354\" url=\"https://cite.case.law/us/278/96/#p100\"><span class=\"citation\" data-id=\"101338\"><a href=\"/opinion/101338/hunt-v-united-states/\" aria-description=\"Citation for case: Hunt v. United States\">73 L.Ed. 200</a></span></extracted-citation> (1928) (recognizing that the United States was entitled to an injunction against state officers interfering with private citizens killing deer in national forest under authority of the United States).</p>\n</footnote>\n<footnote label=\"6\">\n<p id=\"p-208\">P. Kurland, Watergate and the Constitution 135 (1978).</p>\n</footnote>\n<footnote label=\"7\">\n<p id=\"p-209\">During oral argument in the Second Circuit, respondent's attorney said the following:</p>\n<p id=\"p-210\">\"It's hard for me to say that there could be no circumstance under which a President could ever imaginably be criminally charged or perhaps tried .... You can invent scenarios where you can imagine that it would be necessary or at least perhaps a good idea for a sitting President to be subject to a criminal charge even by a state while in office.\" Recording of Oral Arg. in No. 19-3204 (CA2, Oct. 23, 2019), at 28:20- 28:40; 36:35-36:45, https://www.ca2.uscourts.gov/decisions/oral_arguments.html.</p>\n<p id=\"p-211\">Respondent's brief in this case says only that \"[f]or the purpose of this case, the Court may assume ... that a sitting President is not amenable to criminal prosecution.\" Brief for Respondent Vance 24-25. During oral argument in this Court, however, counsel for respondent stated: \"We're mindful that as a state actor our office cannot investigate a president for any official acts and that we cannot prosecute a president while in office.\" Tr. of Oral Arg. 54.</p>\n</footnote>\n<footnote label=\"8\">\n<p id=\"p-212\">Atomic Heritage Foundation, Nuclear Briefcases (June 12, 2018), www.atomicheritage.org/history/nuclear-briefcases.</p>\n</footnote>\n<footnote label=\"9\">\n<p id=\"p-213\">Respondent asserts that his office has never characterized President Trump as a \"target\" of the investigation, Brief for Respondent Vance 29, n. 10, but by the same token, respondent has never said that the President is not a \"target.\" Moreover, the terms \"target\" and \"subject\" have no consistent legal meaning. The United States Attorney's Manual defines a \"target\" as \"a person as to whom the prosecutor or the grand jury has substantial evidence linking him or her to the commission of a crime and who, in the judgment of the prosecutor, is a putative defendant.\" Dept. of Justice, Justice Manual, Section 9-11.151 (Jan. 2020), https://www.justice.gov/jm/jm-9-11000-grand-jury#9-11.151/. \"A 'subject' of an investigation\" is defined as \"a person whose conduct is within the scope of the grand jury's investigation.\" <em><extracted-citation case-ids=\"3905681\" index=\"355\" url=\"https://cite.case.law/us/278/96/#p100\"><span class=\"citation\" data-id=\"101338\"><a href=\"/opinion/101338/hunt-v-united-states/\" aria-description=\"Citation for case: Hunt v. United States\">Ibid.</a></span></extracted-citation></em> Of course, these definitions are not binding on the State of New York, but under them, it is apparent that the President is at least a \"subject.\"</p>\n</footnote>\n<footnote label=\"10\">\n<p id=\"p-214\">Dept. of Justice, Bureau of Justice Statistics, Prosecutors in State Courts, 2007-Statistical Tables 1 (Dec. 2011).</p>\n</footnote>\n<footnote label=\"11\">\n<p id=\"p-215\">Tr. of Oral Arg. 77, 102.</p>\n</footnote>\n<footnote label=\"12\">\n<p id=\"p-216\">See N. Y. Crim. Proc. Law Ann. § 30.10(4)(a) (West 2010) (statute tolled when defendant outside the jurisdiction); see also <em>People v. Knobel</em> , <extracted-citation case-ids=\"109968\" index=\"356\" url=\"https://cite.case.law/ny2d/94/226/#p230\"><span class=\"citation\" data-id=\"2197118\"><a href=\"/opinion/2197118/people-v-knobel/\" aria-description=\"Citation for case: People v. Knobel\">94 N.Y.2d 226</a></span></extracted-citation>, 230, <extracted-citation case-ids=\"109968\" index=\"357\" url=\"https://cite.case.law/ny2d/94/226/#p230\"><span class=\"citation\" data-id=\"2197118\"><a href=\"/opinion/2197118/people-v-knobel/\" aria-description=\"Citation for case: People v. Knobel\">701 N.Y.S.2d 695</a></span></extracted-citation>, <extracted-citation case-ids=\"109968\" index=\"358\" url=\"https://cite.case.law/ny2d/94/226/#p230\"><span class=\"citation\" data-id=\"2197118\"><a href=\"/opinion/2197118/people-v-knobel/\" aria-description=\"Citation for case: People v. Knobel\">723 N.E.2d 550</a></span></extracted-citation>, 552 (1999) (explaining New York rule for tolling the limitations period when a defendant is \"continuously outside\" the State and concluding that \"all periods of a day or more that a nonresident defendant is out-of-State should be totaled and toll the Statute of Limitations\").</p>\n</footnote>\n<footnote label=\"13\">\n<p id=\"p-217\">See <em>People v. Parilla</em> , <extracted-citation case-ids=\"5697523\" index=\"359\" url=\"https://cite.case.law/ny3d/8/654/#p659\"><span class=\"citation\" data-id=\"2206322\"><a href=\"/opinion/2206322/people-v-parilla/\" aria-description=\"Citation for case: People v. Parilla\">8 N.Y.3d 654</a></span></extracted-citation>, 659, <extracted-citation case-ids=\"5697523\" index=\"360\" url=\"https://cite.case.law/ny3d/8/654/#p659\"><span class=\"citation\" data-id=\"2206322\"><a href=\"/opinion/2206322/people-v-parilla/\" aria-description=\"Citation for case: People v. Parilla\">838 N.Y.S.2d 824</a></span></extracted-citation>, <extracted-citation case-ids=\"5697523\" index=\"361\" url=\"https://cite.case.law/ny3d/8/654/#p659\"><span class=\"citation\" data-id=\"2206322\"><a href=\"/opinion/2206322/people-v-parilla/\" aria-description=\"Citation for case: People v. Parilla\">870 N.E.2d 142</a></span></extracted-citation>, 145 (2007) ; R. Davis &amp; T. Muskus, New York Practice with Forms, 33A Carmody-Wait 2d § 186:34 (June 2020).</p>\n</footnote>\n<footnote label=\"14\">\n<p id=\"p-218\">S. Beale et al., Grand Jury Law and Practice §§ 5:3-5:4 (2018).</p>\n</footnote>\n<footnote label=\"15\">\n<p id=\"p-219\">When President Ford was subpoenaed as a defense witness in the trial of a woman who had attempted to assassinate him, the District Court ruled that Federal Rule of Criminal Procedure 15 allowed him to be deposed at a place of his choosing, instead of testifying in person, and provided for defense counsel but not the defendant herself to be present. Then, as now, Rule 15 permits a witness to be deposed under \"exceptional circumstances\" in order \"to preserve testimony for trial.\" This Rule is generally used when a witness may not be available to testify at trial, not simply when it would be burdensome or inconvenient for the witness to appear. The judge's application of the Rule in this case was innovative. In addition, the defendant was not present when President Ford was deposed. Repeating such a practice today might run into other obstacles. See <em>Coy v. Iowa</em> , <extracted-citation case-ids=\"1774862\" index=\"362\" url=\"https://cite.case.law/us/487/1012/#p1020\"><span class=\"citation\" data-id=\"9431464\"><a href=\"/opinion/112146/coy-v-iowa/\" aria-description=\"Citation for case: Coy v. Iowa\">487 U.S. 1012</a></span></extracted-citation>, 1020-1021, <extracted-citation case-ids=\"1774862\" index=\"363\" url=\"https://cite.case.law/us/487/1012/#p1020\"><span class=\"citation\" data-id=\"9431464\"><a href=\"/opinion/112146/coy-v-iowa/\" aria-description=\"Citation for case: Coy v. Iowa\">108 S.Ct. 2798</a></span></extracted-citation>, <extracted-citation case-ids=\"1774862\" index=\"364\" url=\"https://cite.case.law/us/487/1012/#p1020\"><span class=\"citation\" data-id=\"9431464\"><a href=\"/opinion/112146/coy-v-iowa/\" aria-description=\"Citation for case: Coy v. Iowa\">101 L.Ed.2d 857</a></span></extracted-citation> (1988) ; see also Rule 15(c) (providing for the defendant's presence during the deposition).</p>\n<p id=\"p-220\">A similar procedure appears to have been followed when President Carter testified as a prosecution witness in a criminal trial. No reported case explains the legal authority cited as justification for excusing live testimony, but Rule 15 may have been invoked. As for President Carter's testimony by deposition before a grand jury, although neither the Federal Rules of Evidence nor the Confrontation Clause apply to federal grand jury proceedings, testimony by deposition is nevertheless not the norm.</p>\n</footnote>\n</opinion>", "extracted_by_ocr": false, "ordering_key": 3, "main_version": null, "opinions_cited": ["https://www.courtlistener.com/api/rest/v4/opinions/85272/", "https://www.courtlistener.com/api/rest/v4/opinions/85451/", "https://www.courtlistener.com/api/rest/v4/opinions/99638/", "https://www.courtlistener.com/api/rest/v4/opinions/100299/", "https://www.courtlistener.com/api/rest/v4/opinions/101338/", "https://www.courtlistener.com/api/rest/v4/opinions/101749/", "https://www.courtlistener.com/api/rest/v4/opinions/103853/", "https://www.courtlistener.com/api/rest/v4/opinions/105435/", "https://www.courtlistener.com/api/rest/v4/opinions/109101/", "https://www.courtlistener.com/api/rest/v4/opinions/109467/", "https://www.courtlistener.com/api/rest/v4/opinions/109468/", "https://www.courtlistener.com/api/rest/v4/opinions/2058941/", "https://www.courtlistener.com/api/rest/v4/opinions/2083379/", "https://www.courtlistener.com/api/rest/v4/opinions/2197118/", "https://www.courtlistener.com/api/rest/v4/opinions/2206322/", "https://www.courtlistener.com/api/rest/v4/opinions/4274908/", "https://www.courtlistener.com/api/rest/v4/opinions/4369170/", "https://www.courtlistener.com/api/rest/v4/opinions/5534109/", "https://www.courtlistener.com/api/rest/v4/opinions/5535264/", "https://www.courtlistener.com/api/rest/v4/opinions/5538517/", "https://www.courtlistener.com/api/rest/v4/opinions/6953569/", "https://www.courtlistener.com/api/rest/v4/opinions/7279447/", "https://www.courtlistener.com/api/rest/v4/opinions/8638368/", "https://www.courtlistener.com/api/rest/v4/opinions/9416307/", "https://www.courtlistener.com/api/rest/v4/opinions/9416841/", "https://www.courtlistener.com/api/rest/v4/opinions/9417530/", "https://www.courtlistener.com/api/rest/v4/opinions/9421036/", "https://www.courtlistener.com/api/rest/v4/opinions/9428860/", "https://www.courtlistener.com/api/rest/v4/opinions/9431313/", "https://www.courtlistener.com/api/rest/v4/opinions/9431464/", "https://www.courtlistener.com/api/rest/v4/opinions/9433464/", "https://www.courtlistener.com/api/rest/v4/opinions/9433982/", "https://www.courtlistener.com/api/rest/v4/opinions/9434668/", "https://www.courtlistener.com/api/rest/v4/opinions/9808243/", "https://www.courtlistener.com/api/rest/v4/opinions/9888811/", "https://www.courtlistener.com/api/rest/v4/opinions/9889202/"]}