{"resource_uri": "https://www.courtlistener.com/api/rest/v4/opinions/10840383/", "id": 10840383, "absolute_url": "/opinion/10373795/trump-v-j-g-g/", "cluster_id": 10373795, "cluster": "https://www.courtlistener.com/api/rest/v4/clusters/10373795/", "author_id": null, "author": null, "joined_by": [], "date_created": "2025-04-07T16:01:51.414195-07:00", "date_modified": "2025-07-26T16:47:06.107065-07:00", "author_str": "", "per_curiam": false, "joined_by_str": "", "type": "010combined", "sha1": "80d15a08933dc98bcd98b4e47173a6bfd3602be4", "page_count": 25, "download_url": "https://www.supremecourt.gov/opinions/24pdf/24a931_2c83.pdf", "local_path": "pdf/2025/04/07/trump_v._j._g._g..pdf", "plain_text": "                  Cite as: 604 U. S. ____ (2025)            1\n\n                           Per Curiam\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  PER CURIAM.\n  This matter concerns the detention and removal of Vene-\nzuelan nationals believed to be members of Tren de Aragua\n(TdA), an entity that the State Department has designated\nas a foreign terrorist organization. See 90 Fed. Reg. 10030\n(2025). The President issued Proclamation No. 10903, in-\nvoking the Alien Enemies Act (AEA), Rev. Stat. §4067, 50\nU. S. C. §21, to detain and remove Venezuelan nationals\n“who are members of TdA.” Invocation of the Alien Ene-\nmies Act Regarding the Invasion of the United States by\nTren de Aragua, 90 Fed. Reg. 13034. Five detainees and a\nputative class sought injunctive and declaratory relief\nagainst the implementation of, and their removal under,\nthe Proclamation. Initially, the detainees sought relief in\nhabeas among other causes of action, but they dismissed\ntheir habeas claims. On March 15, 2025, the District Court\nfor the District of Columbia issued two temporary restrain-\ning orders (TROs) preventing any removal of the named\nplaintiffs and preventing removal under the AEA of a pro-\nvisionally certified class consisting of “[a]ll noncitizens in\nU.S. custody who are subject to” the Proclamation. Minute\nOrder on Motion To Certify Class in No. 25−cv−00766. On\nMarch 28, the District Court extended the TROs for up to\nan additional 14 days. See Fed. Rule Civ. Proc. 65(b)(2).\n\f2                      TRUMP v. J. G. G.\n\n                          Per Curiam\n\nThe D. C. Circuit denied the Government’s emergency mo-\ntion to stay the orders. The Government then applied to\nthis Court, seeking vacatur of the orders. We construe\nthese TROs as appealable injunctions. See Carson v. Amer-\nican Brands, Inc., 450 U. S. 79, 84 (1981).\n   We grant the application and vacate the TROs. The de-\ntainees seek equitable relief against the implementation of\nthe Proclamation and against their removal under the AEA.\nThey challenge the Government’s interpretation of the Act\nand assert that they do not fall within the category of re-\nmovable alien enemies. But we do not reach those argu-\nments. Challenges to removal under the AEA, a statute\nwhich largely “ ‘preclude[s] judicial review,’ ” Ludecke v.\nWatkins, 335 U. S. 160, 163−164, (1948), must be brought\nin habeas. Cf. Heikkila v. Barber, 345 U. S. 229, 234−235\n(1953) (holding that habeas was the only cause of action\navailable to challenge deportation under immigration stat-\nutes that “preclud[ed] judicial intervention” beyond what\nwas necessary to vindicate due process rights). Regardless\nof whether the detainees formally request release from con-\nfinement, because their claims for relief “ ‘necessarily imply\nthe invalidity’ ” of their confinement and removal under the\nAEA, their claims fall within the “core” of the writ of habeas\ncorpus and thus must be brought in habeas. Cf. Nance v.\nWard, 597 U. S. 159, 167 (2022) (quoting Heck v. Humph-\nrey, 512 U. S. 477, 487 (1994)). And “immediate physical\nrelease [is not] the only remedy under the federal writ of\nhabeas corpus.” Peyton v. Rowe, 391 U. S. 54, 67 (1968); see,\ne.g., Nance, 597 U. S., at 167 (explaining that a capital pris-\noner may seek “to overturn his death sentence” in habeas\nby “analog[y]” to seeking release); In re Bonner, 151 U. S.\n242, 254, 259 (1894). For “core habeas petitions,” “jurisdic-\ntion lies in only one district: the district of confinement.”\nRumsfeld v. Padilla, 542 U. S. 426, 443 (2004). The detain-\nees are confined in Texas, so venue is improper in the Dis-\ntrict of Columbia. As a result, the Government is likely to\n\f                  Cite as: 604 U. S. ____ (2025)            3\n\n                           Per Curiam\n\nsucceed on the merits of this action.\n   The detainees also sought equitable relief against sum-\nmary removal. Although judicial review under the AEA is\nlimited, we have held that an individual subject to deten-\ntion and removal under that statute is entitled to “ ‘judicial\nreview’ ” as to “questions of interpretation and constitution-\nality” of the Act as well as whether he or she “is in fact an\nalien enemy fourteen years of age or older.” Ludecke, 335\nU. S., at 163−164, 172, n. 17. (Under the Proclamation, the\nterm “alien enemy” is defined to include “all Venezuelan cit-\nizens 14 years of age or older who are members of TdA, are\nwithin the United States, and are not actually naturalized\nor lawful permanent residents of the United States.” 90\nFed. Reg. 13034.) The detainees’ rights against summary\nremoval, however, are not currently in dispute. The Gov-\nernment expressly agrees that “TdA members subject to re-\nmoval under the Alien Enemies Act get judicial review.”\nReply in Support of Application To Vacate 1. “It is well es-\ntablished that the Fifth Amendment entitles aliens to due\nprocess of law” in the context of removal proceedings. Reno\nv. Flores, 507 U. S. 292, 306 (1993). So, the detainees are\nentitled to notice and opportunity to be heard “appropriate\nto the nature of the case.” Mullane v. Central Hanover\nBank & Trust Co., 339 U. S. 306, 313 (1950). More specifi-\ncally, in this context, AEA detainees must receive notice af-\nter the date of this order that they are subject to removal\nunder the Act. The notice must be afforded within a rea-\nsonable time and in such a manner as will allow them to\nactually seek habeas relief in the proper venue before such\nremoval occurs.\n   For all the rhetoric of the dissents, today’s order and per\ncuriam confirm that the detainees subject to removal orders\nunder the AEA are entitled to notice and an opportunity to\nchallenge their removal. The only question is which court\nwill resolve that challenge. For the reasons set forth, we\n\f4                     TRUMP v. J. G. G.\n\n                         Per Curiam\n\nhold that venue lies in the district of confinement. The dis-\nsents would have the Court delay resolving that issue, re-\nquiring—given our decision today—that the process begin\nanew down the road. We see no benefit in such wasteful\ndelay.\n  The application to vacate the orders of the United States\nDistrict Court for the District of Columbia presented to THE\nCHIEF JUSTICE and by him referred to the Court is\ngranted. The March 15, 2025 minute orders granting a\ntemporary restraining order and March 28, 2025 extension\nof the United States District Court for the District of Co-\nlumbia, case No. 1:25-cv-766, are vacated.\n\n                                             It is so ordered.\n\f                  Cite as: 604 U. S. ____ (2025)            1\n\n                   KAVANAUGH, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  JUSTICE KAVANAUGH, concurring.\n  I agree with the Court’s per curiam opinion. Importantly,\nas the Court stresses, the Court’s disagreement with the\ndissenters is not over whether the detainees receive judicial\nreview of their transfers—all nine Members of the Court\nagree that judicial review is available. The only question is\nwhere that judicial review should occur. That venue\nquestion turns on whether these transfer claims belong in\nhabeas corpus proceedings or instead may be brought under\nthe Administrative Procedure Act. I agree with the Court’s\nanalysis that the claims must be brought in habeas.\n  I add only that the use of habeas for transfer claims is not\nnovel. In the extradition context and with respect to\ntransfers of Guantanamo and other wartime detainees,\nhabeas corpus proceedings have long been the appropriate\nvehicle. See LoBue v. Christopher, 82 F. 3d 1081, 1082\n(CADC 1996); Kiyemba v. Obama, 561 F. 3d 509, 512–513\n(CADC 2009). That general rule holds true for claims under\nthe Alien Enemies Act, the statute under which the\nGovernment is seeking to remove these detainees. See\nLudecke v. Watkins, 335 U. S. 160, 163, 171, and n. 17\n(1948). And going back to the English Habeas Corpus Act\nof 1679, if not earlier, habeas corpus has been the proper\nvehicle for detainees to bring claims seeking to bar their\n\f2                    TRUMP v. J. G. G.\n\n                  KAVANAUGH, J., concurring\n\ntransfers. See Habeas Corpus Act of 1679, 31 Car. 2, c. 2,\n§§11–12.\n  Especially given the history and precedent of using\nhabeas corpus to review transfer claims, and given 5\nU. S. C. §704, which states that claims under the APA are\nnot available when there is another “adequate remedy in a\ncourt,” I agree with the Court that habeas corpus, not the\nAPA, is the proper vehicle here.\n\f                  Cite as: 604 U. S. ____ (2025)             1\n\n                    SOTOMAYOR, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n   JUSTICE SOTOMAYOR, with whom JUSTICE KAGAN and\nJUSTICE JACKSON join, and with whom JUSTICE BARRETT\njoins as to Parts II and III–B, dissenting.\n   Three weeks ago, the Federal Government started send-\ning scores of Venezuelan immigrants detained in the\nUnited States to a foreign prison in El Salvador. It did so\nwithout any due process of law, under the auspices of the\nAlien Enemies Act, a 1798 law designed for times of war.\nBetween the start of these removals and now, a District\nCourt has been expeditiously considering the legal claims\nof a group of detainees (hereafter plaintiffs), who allege that\ntheir summary removal violates the Constitution and mul-\ntiple statutes. The District Court ordered a pause on plain-\ntiffs’ removals until it could consider their motion for a pre-\nliminary injunction at a hearing tomorrow, on April 8. Still,\na majority of the Court sees fit to speak to this issue today.\n   Critically, even the majority today agrees, and the Fed-\neral Government now admits, that individuals subject to re-\nmoval under the Alien Enemies Act are entitled to adequate\nnotice and judicial review before they can be removed. That\nshould have been the end of the matter. Yet, with “bare-\nbones briefing, no argument, and scarce time for reflection,”\nDepartment of Education v. California, 604 U. S. ___, ___\n\f2                         TRUMP v. J. G. G.\n\n                      SOTOMAYOR, J., dissenting\n\n(2025) (KAGAN, J., dissenting) (slip op., at 2), the Court an-\nnounces that legal challenges to an individual’s removal un-\nder the Alien Enemies Act must be brought in habeas peti-\ntions in the district where they are detained.\n   The Court’s legal conclusion is suspect. The Court inter-\nvenes anyway, granting the Government extraordinary re-\nlief and vacating the District Court’s order on that basis\nalone. It does so without mention of the grave harm Plain-\ntiffs will face if they are erroneously removed to El Salvador\nor regard for the Government’s attempts to subvert the ju-\ndicial process throughout this litigation. Because the Court\nshould not reward the Government’s efforts to erode the\nrule of law with discretionary equitable relief, I respectfully\ndissent.\n                               I\n                              A\n   This case arises out of the President’s unprecedented\npeacetime invocation of a wartime law known as the Alien\nEnemies Act. See Act of July 6, 1798, ch. 66, 1 Stat. 577.\nEnacted in 1798 by a Congress consumed with fear of war\nwith France, the Alien Enemies Act provided a wartime\ncounterpart to the widely denounced Alien Friends Act,\nwhich granted the President sweeping power to detain and\nexpel any noncitizen he deemed “dangerous to the peace\nand safety of the United States.” Act of June 25, 1798, 1\nStat. 571. Unlike the Alien Friends Act, which lapsed in\ndisrepute as James Madison deemed it “a monster that\nmust for ever disgrace its parents,” the Founders saw the\nAlien Enemies Act as a constitutional exercise of Congress’s\npowers to “declare War,” to “raise and support Armies,” and\nto “provide for calling forth the Militia to . . . suppress In-\nsurrections and repel Invasions.” U. S. Const., Art. I, §8,\ncls. 11–15.1\n——————\n   1 Letter from J. Madison to T. Jefferson (May 20, 1798), in 30 Papers\n\nof Thomas Jefferson 358 (B. Oberg ed. 2003); see also Madison’s Report\n\f                    Cite as: 604 U. S. ____ (2025)                   3\n\n                      SOTOMAYOR, J., dissenting\n\n  To that end, the Act grants the President power to detain\nand remove foreign citizens of a “hostile nation or govern-\nment” when “there is a declared war” with such nation or\nwhen a “foreign nation” threatens “invasion or predatory\nincursion” against the territory of the United States. Rev.\nStat. §4067, 50 U. S. C. §21. Before today, U. S. Presidents\nhave invoked the Alien Enemies Act only three times, each\nin the context of an ongoing war: the War of 1812, World\nWar I, and World War II.2\n  That changed on March 14, 2025, when President Trump\ninvoked the Alien Enemies Act to address an alleged “Inva-\nsion of the United States by Tren De Aragua,” a criminal\norganization based in Venezuela. See Invocation of the Al-\nien Enemies Act Regarding the Invasion of the United\nStates by Tren de Aragua, Proclamation No. 10903, 90 Fed.\nReg. 13033. There is, of course, no ongoing war between the\nUnited States and Venezuela. Nor is Tren de Aragua itself\na “foreign nation.” §21. The President’s Proclamation\nnonetheless asserts that Tren de Aragua is “undertaking\nhostile actions and conducting irregular warfare against\nthe territory of the United States both directly and at the\ndirection . . . of the Maduro regime in Venezuela.” 90 Fed.\nReg. 13034. Based on these findings, the Proclamation de-\nclares that “all Venezuelan citizens 14 years of age or older\nwho are members of [Tren de Aragua]” and are not “natu-\nralized [citizens] or lawful permanent residents” are liable\nto “immediate apprehension, detention, and removal” as al-\nien enemies. Ibid.\n\n——————\non the Virginia Resolution, in The Book of the Constitution 52 (E. Wil-\nliams ed. 1833).\n   2 Lockington v. Smith, 15 F. Cas. 758, 758–759 (No. 8,448) (CC Pa.\n\n1817) (discussing the War of 1812 proclamation); Declaring the Exist-\nence of a State of War With the German Empire and Setting Forth Reg-\nulations Prescribing Conduct Toward Alien Enemies, Proclamation No.\n1364, 40 Stat. 1650 (World War I); Alien Enemies—Japanese, Proclama-\ntion No. 2525, 55 Stat. 1700 (World War II).\n\f4                     TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\n   Congress requires the President to “mak[e] public procla-\nmation” of his intention to invoke the Alien Enemies Act.\n§21. President Trump did just the opposite. In what can\nbe understood only as covert preparation to skirt both the\nrequirements of the Act and the Constitution’s guarantee of\ndue process, the Department of Homeland Security (DHS)\nbegan moving Venezuelan migrants from Immigration and\nCustoms Enforcement detention centers across the country\nto the El Valle Detention Facility in South Texas before the\nPresident had even signed the Proclamation. ___ F. Supp.\n3d ___, ___ 2025 WL 890401, *3 (D DC, Mar. 24, 2025). The\ntransferred detainees, most of whom denied past or present\naffiliation with any gang, did not know the reason for their\ntransfer until the evening of Friday, March 14, when they\nwere apparently “pulled from their cells and told that they\nwould be deported the next day to an unknown destina-\ntion.” Ibid.\n                               B\n  Suspecting that the President had covertly signed a Proc-\nlamation invoking the Alien Enemies Act, several lawyers\nanticipated their clients’ imminent deportation and filed a\nputative class action in the District of Columbia. App. to\nBrief in Opposition To Application To Vacate 9a (App. to\nBIO). They contested that Tren de Aragua had committed\nor attempted the kind of “ ‘invasion’ ” or “ ‘predatory incur-\nsion’ ” required to invoke the Alien Enemies Act. Ibid. They\nalso asserted that it would violate the Due Process Clause\nto deport their clients before they had any chance to chal-\nlenge the Government’s allegations of gang membership.\nId., at 26a. The plaintiffs did not seek release from custody,\nbut asked the court only to restrain the Government’s\nplanned deportations under the Proclamation. Id., at 9a,\n29a.\n  In the early morning of March 15, the District Court in-\nformed the Government of the lawsuit and scheduled an\n\f                  Cite as: 604 U. S. ____ (2025)             5\n\n                    SOTOMAYOR, J., dissenting\n\nemergency hearing. Despite knowing of plaintiffs’ claim\nthat it would be unlawful to remove them under the Proc-\nlamation, the Government ushered the named plaintiffs\nonto planes along with dozens of other detainees, all with-\nout any opportunity to contact their lawyers, much less no-\ntice or opportunity to be heard. See 2025 WL 890401, *5;\nsee also, e.g., Decl. of G. Carney in No. 25–cv–00766 (D DC,\nMar. 19, 2025), ECF Doc. 44–11, at 2.\n   The Government’s plan, it appeared, was to rush plain-\ntiffs out of the country before a court could decide whether\nthe President’s invocation of the Alien Enemies Act was\nlawful or whether these individuals were, in fact, members\nof Tren de Aragua. Plaintiff J. G. G., for example, had no\nchance to tell a court that the tattoos causing DHS to sus-\npect him of gang membership were unrelated to a gang.\nDecl. of J. G. G., ECF Doc. 3–3, at 1. He avers that he is a\ntattoo artist who “got [an] eye tattoo because [he] saw it on\nGoogle” and “thought it looked cool.” Ibid. Plaintiff G. F. F.,\ntoo, was denied the chance to inform a court that the Gov-\nernment accused him of being an “associate/affiliate of Tren\nd[e] Aragua” based solely on his presence at a party of\nstrangers, which he attended at the “insistence of a friend.”\nDecl. of G. Carney, ECF Doc. 3–4, at 1.\n                               C\n  Recognizing the emergency the Government had created\nby deporting plaintiffs without due process, the District\nCourt issued a temporary restraining order that same\nmorning. The order prohibited the Government from re-\nmoving the five named plaintiffs, including J. G. G. and\nG. F. F., pending ongoing litigation. G. F. F., who had been\n“on a plane for about forty minutes to an hour” as “crying\nand frightened” individuals were forced on board, was sub-\nsequently retrieved from the plane by a guard who told him\nhe “ ‘just won the lottery.’ ” Decl. of G. Carney, ECF Doc.\n44–11, at 3.\n\f6                      TRUMP v. J. G. G.\n\n                    SOTOMAYOR, J., dissenting\n\n   The court then set an emergency hearing for 5 p.m. that\nsame day, at which it planned to consider plaintiffs’ claim\nthat temporary relief should be extended to a class of all\nnoncitizens subject to the anticipated Proclamation. See\n2025 WL 890401, *4. Despite notice to the Government of\nthe Court’s scheduled hearing, DHS continued to load up\nthe two planes with detainees and scheduled their immedi-\nate departure. See Tr. 12 (Mar. 15, 2025) (Two flights “were\nscheduled for this afternoon that may have already taken\noff or [will] during this hearing”); Tr. 9 (Apr. 3, 2025) (Gov-\nernment counsel agreeing that DHS was “acting in prepa-\nration of the proclamation before it was posted”). Not until\nan hour before the District Court’s scheduled hearing, and\nonly moments before the Government planned to send its\nplanes off to El Salvador, did the White House finally pub-\nlish the Proclamation on its website.\n   At its 5 p.m. hearing, the District Court provisionally cer-\ntified a class of Venezuelan noncitizens subject to the Proc-\nlamation. See Tr. 23, 25 (Mar. 15, 2025). It then issued an\noral temporary restraining order prohibiting the Govern-\nment from removing all members of the class pursuant to\nthe Proclamation for 14 days. Id., at 42. The order did not\ndisturb the Government’s ability to apprehend or detain in-\ndividuals pursuant to the Proclamation or its authority to\ndeport any individual under the Immigration and Natural-\nization Act. See ibid.; see 2025 WL 890401, *1. All it re-\nquired of the Government was a pause in deportations pur-\nsuant to the Proclamation until the court had a chance to\nreview their legality. See Tr. 4 (Apr. 3, 2025) (“All th[e]\n[TROs] did was order that the government could not sum-\nmarily deport in-custody noncitizens who were subject to\nthe proclamation without a hearing”). The court further di-\nrected that “any plane containing” individuals subject to the\nProclamation “that is going to take off or is in the air needs\nto be returned to the United States.” Tr. 43 (Mar. 15, 2025).\n\f                     Cite as: 604 U. S. ____ (2025)                     7\n\n                       SOTOMAYOR, J., dissenting\n\n                              D\n  Concerns about the Government’s compliance with the\norder quickly followed. Even now, the District Court con-\ntinues to investigate what happened via show-cause pro-\nceedings. In those proceedings, the Government took the\nposition that it had no legal obligation to obey the District\nCourt’s orders directing the return of planes in flight be-\ncause they were issued from the bench. See Tr. 17 (Mar.\n17, 2025) (“[O]ral statements are not injunctions”). Of\ncourse, as the Government well knows, courts routinely is-\nsue rulings from the bench, and those rulings can be ap-\npealed, including to this Court, in appropriate circum-\nstances.3\n  The District Court, for its part, has surmised that “the\nGovernment knew as of 10 a.m. on March 15 that the Court\nwould hold a hearing later that day,” yet it “hustled people\nonto those planes in hopes of evading an injunction or per-\nhaps preventing [individuals] from requesting the habeas\nhearing to which the Government now acknowledges they\nare entitled.” 2025 WL 890401, *5. Rather than turn\naround the planes that were in the air when the Court is-\nsued its order, moreover, the Federal Government landed\nthe planes full of alleged Venezuelan nationals in El Salva-\ndor and transferred them directly into El Salvador’s Center\nfor Terrorism Confinement (CECOT). Ibid.\n  Deportation directly into CECOT presented a risk of ex-\ntraordinary harm to these Plaintiffs. The record reflects\n\n——————\n  3 See, e.g., United States v. Fruehauf, 365 U. S. 146, 154 (1961) (hear-\n\ning Government’s direct appeal from oral ruling); Evans v. Michigan, 568\nU. S. 313, 320 (2013) (relying on lower court’s oral ruling); see also\nWright v. Continental Airlines Corp., 103 F. 3d 146 (CA10 1996) (Table)\n(oral ruling was binding on parties); In re Justice, 172 F. 3d 876 (CA9\n1999) (Table) (oral order was binding and effective even when written\norder was never entered); Ueckert v. Guerra, 38 F. 4th 446, 451–452 (CA5\n2022) (oral ruling final and appealable even where district court never\nissued written judgment).\n\f8                     TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nthat inmates in Salvadoran prisons are “ ‘highly likely to\nface immediate and intentional life-threatening harm at\nthe hands of state actors.’ ” Id., at *16 (quoting App. to BIO\n258a). CECOT detainees are frequently “denied communi-\ncation with their relatives and lawyers, and only appear be-\nfore courts in online hearings, often in groups of several\nhundred detainees at the same time.” App. to BIO 260a. El\nSalvador has boasted that inmates in CECOT “ ‘will never\nleave,’ ” ibid., and plaintiffs present evidence that “inmates\nare rarely allowed to leave their cells, have no regular ac-\ncess to drinking water or adequate food, sleep standing up\nbecause of overcrowding, and are held in cells where they\ndo not see sunlight for days,” 2025 WL 890401, *16. One\nscholar attests that an estimated 375 detainees have died\nin Salvadoran prisons since March 2022. Ibid.\n  What if the Government later determines that it sent one\nof these detainees to CECOT in error? Or a court eventu-\nally decides that the President lacked authority under the\nAlien Enemies Act to declare that Tren de Aragua is perpe-\ntrating or attempting an “invasion” against the territory of\nthe United States? The Government takes the position\nthat, even when it makes a mistake, it cannot retrieve indi-\nviduals from the Salvadoran prisons to which it has sent\nthem. See Defendant’s Memorandum of Law in Opposition\nin Abrego Garcia v. Noem, No. 25–cv–951 (D Md., Mar. 31,\n2025), ECF Doc. 11, at 7–9. The implication of the Govern-\nment’s position is that not only noncitizens but also United\nStates citizens could be taken off the streets, forced onto\nplanes, and confined to foreign prisons with no opportunity\nfor redress if judicial review is denied unlawfully before re-\nmoval. History is no stranger to such lawless regimes, but\nthis Nation’s system of laws is designed to prevent, not en-\nable, their rise.\n                         E\n    Even as the Government has continued to litigate\n\f                 Cite as: 604 U. S. ____ (2025)            9\n\n                   SOTOMAYOR, J., dissenting\n\nwhether its March 15 deportations complied with the Dis-\ntrict Court’s orders, it simultaneously sought permission to\nresume summary deportations under the Proclamation.\nThe District Court, first, denied the Government’s motion\nto vacate its temporary restraining order, rejecting the as-\nsertion that “the President’s authority and discretion under\nthe [Alien Enemies Act] is not a proper subject for judicial\nscrutiny.” App. to BIO 71a. At the very least, the District\nCourt concluded, the plaintiffs were “likely to succeed” on\ntheir claim that, “before they may be deported, they are en-\ntitled to individualized hearings to determine whether the\nAct applies to them at all.” 2025 WL 890401, *2. The D. C.\nCircuit, too, denied the Government a requested stay and\nkept in place the District Court’s pause on deportations un-\nder the Alien Enemies Act pending further proceedings.\n2025 WL 914682, *1 (per curiam) (Mar. 26, 2025).\n   It is only this Court that sees reason to vacate, for the\nsecond time this week, a temporary restraining order\nstanding “on its last legs.” Department of Education, 604\nU. S., at ___ (JACKSON, J., dissenting) (slip op., at 1). Not\ncontent to wait until tomorrow, when the District Court will\nhave a chance to consider full preliminary injunction brief-\ning at a scheduled hearing, this Court intervenes to relieve\nthe Government of its obligation under the order.\n                              II\n  Begin with that upon which all nine Members of this\nCourt agree. The Court’s order today dictates, in no uncer-\ntain terms, that “individual[s] subject to detention and re-\nmoval under the [Alien Enemies Act are] entitled to ‘judicial\nreview’ as to ‘questions of interpretation and constitution-\nality’ of the Act as well as whether he or she ‘is in fact an\nalien enemy fourteen years of age or older.’ ” Ante, at 2\n(quoting Ludecke v. Watkins, 335 U. S. 160, 163–164, 172,\nn. 17 (1948)). Therefore, under today’s order, courts below\n\f10                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nwill probe, among other things, the meaning of an “inva-\nsion” or “predatory incursion,” 50 U. S. C. §21, and ask, for\nexample, whether any given individual is in fact a member\nof Tren de Aragua. Even the Government has now largely\nconceded that point. Application 19.\n   So too do we all agree with the per curiam’s command\nthat the Fifth Amendment requires the Government to af-\nford plaintiffs “notice after the date of this order that they\nare subject to removal under the Act, . . . within reasonable\ntime and in such a manner as will allow them to actually\nseek habeas relief in the proper venue before such removal\noccurs.” Ante, at 3. That means, of course, that the Gov-\nernment cannot usher any detainees, including plaintiffs,\nonto planes in a shroud of secrecy, as it did on March 15,\n2025. Nor can the Government “immediately resume” re-\nmoving individuals without notice upon vacatur of the TRO,\nas it promised the D. C. Circuit it would do. See 2025 WL\n914682, *13 (Millett, J., concurring) (referencing oral argu-\nment before that court). To the extent the Government re-\nmoves even one individual without affording him notice and\na meaningful opportunity to file and pursue habeas relief,\nit does so in direct contravention of an edict by the United\nStates Supreme Court.\n                               III\n  In light of this agreement, the Court’s decision to inter-\nvene in this litigation is as inexplicable as it is dangerous.\nRecall that, when the District Court issued its temporary\nrestraining order on March 15, 2025, the Government was\nengaged in a covert operation to deport dozens of immi-\ngrants without notice or an opportunity for hearings. The\nCourt’s ruling today means that those deportations violated\nthe Due Process Clause’s most fundamental protections.\nSee ante, at 3 (reiterating that notice and an opportunity\nfor a hearing are required before a deportation under the\nAlien Enemies Act). The District Court rightly intervened\n\f                  Cite as: 604 U. S. ____ (2025)           11\n\n                   SOTOMAYOR, J., dissenting\n\nto prohibit temporarily the Government from deporting\nmore individuals in this manner, based on its correct as-\nsessment that the plaintiffs were likely entitled to more\nprocess. 2025 WL 890401, *2.\n   Against the backdrop of the U. S. Government’s unprece-\ndented deportation of dozens of immigrants to a foreign\nprison without due process, a majority of this Court sees fit\nto vacate the District Court’s order. The reason, appar-\nently, is that the majority thinks plaintiffs’ claims should\nhave been styled as habeas actions and filed in the districts\nof their detention. In reaching that result, the majority\nflouts well-established limits on its jurisdiction, creates\nnew law on the emergency docket, and elides the serious\nthreat our intervention poses to the lives of individual de-\ntainees.\n                                A\n   As an initial matter, the Court lacks jurisdiction to re-\nview the District Court’s time-limited, interlocutory order.\nIt is well established that, generally, “temporary restrain-\ning orders are not appealable.” 16 C. Wright, A. Miller, &\nE. Cooper, Federal Practice and Procedure §3922.1, p. 90\n(3d ed. 2012). That rule is a general one because it gives\nway where a temporary restraining order risks imposing\nsuch an “ ‘irreparable . . . consequence’ ” that an immediate\nappeal is necessary if the order is to be “ ‘effectually chal-\nlenged’ ” at all. Carson v. American Brands, Inc., 450 U. S.\n79, 84 (1981).\n   Here, the District Court ordered a 14-day halt on depor-\ntations pursuant to the Proclamation (extended once for 14\nadditional days) because it thought the plaintiffs were\nlikely entitled to “individualized hearings to determine\nwhether the Act applies to them at all.” 2025 WL 890401,\n*2. The Government now admits that it must provide de-\ntainees with adequate notice, and it says they can then file\nhabeas petitions in the Southern District of Texas to contest\n\f12                     TRUMP v. J. G. G.\n\n                    SOTOMAYOR, J., dissenting\n\nand stay their removal under the Alien Enemies Act. Such\nproceedings, if adequately provided, necessarily mean that\nthe Government cannot imminently deport the Plaintiffs\nunder the Proclamation. So it is hard to see why the Dis-\ntrict Court’s temporary restraining order (of which only five\ndays now remain) presented the Government with an emer-\ngency of any kind, much less one that required an immedi-\nate appeal.\n                                 B\n    Also troubling is this Court’s decision to vacate summar-\nily the District Court’s order on the novel ground that an\nindividual’s challenge to his removal under the Alien Ene-\nmies Act “fall[s] within the ‘core’ of the writ of habeas cor-\npus” and must therefore be filed where the plaintiffs are de-\ntained. Ante, at 2. The Court reaches that conclusion\nwithout oral argument or the benefit of percolation in the\nlower courts, and with just a few days of deliberation based\non barebones briefing.\n    This conclusion is dubious. As an initial matter, the ma-\njority’s assertion that plaintiffs’ claims “sound” in habeas is\nin tension with this Court’s understanding of habeas corpus\nas, at its core, an avenue for a person in custody to “attack\n. . . the legality of that custody” and “to secure release from\nillegal custody.” Preiser v. Rodriguez, 411 U. S. 475, 484\n(1973). The plaintiffs in this case sued not to challenge\ntheir detention, but to protect themselves from summary\ndeportation pursuant to the Proclamation. Indeed, because\nall of the plaintiffs were already in immigration detention\nunder other statutes when the Government subjected them\nto the Proclamation, they “have repeatedly emphasized\nthroughout this litigation that they ‘do not seek release\nfrom custody’ ” and are not “contesting the validity of their\nconfinement or seeking to shorten its duration.” 2025 WL\n890401, *8.\n    Nevertheless, the majority insists that plaintiffs’ claims\n\f                  Cite as: 604 U. S. ____ (2025)            13\n\n                    SOTOMAYOR, J., dissenting\n\n“ ‘necessarily imply the invalidity’ ” of their confinement and\nremoval under the Act, and so essentially amount to a chal-\nlenge to their present physical confinement. Ante, at 2. It\ntherefore analogizes this case to the line of cases beginning\nwith Heck v. Humphrey, 512 U. S. 477 (1994), where the\nCourt held that individuals serving state criminal sen-\ntences cannot bring 42 U. S. C. §1983 suits to complain of\n“unconstitutional treatment at the hands of state officials”\nif a judgment in their favor would “necessarily imply the\ninvalidity of his conviction or sentence.” 512 U. S., at 480,\n487. In such cases, habeas is the exclusive avenue for relief.\nIbid. Plaintiffs’ claims, however, do not “imply the invalid-\nity of ” their detention, because their detention predated the\nProclamation and was unrelated to the Alien Enemies Act.\nThus, if they succeeded in showing that they could not be\nremoved under the Proclamation, that would not result in\ntheir release from detention. Even in the context of §1983\nchallenges by criminal defendants, this Court has never\n“recognized habeas as the sole remedy, or even an available\none, where the relief sought would ‘neither terminate cus-\ntody, accelerate the future date of release from custody, nor\nreduce the level of custody.’ ” Skinner v. Switzer, 562 U. S.\n521, 534 (2011) (brackets omitted).\n   There is also good reason to doubt that Heck’s holding\nabout the availability of relief under §1983 extends to Ad-\nministrative Procedure Act (APA) claims challenging exec-\nutive action under the Alien Enemies Act. The Heck bar\narose from the Court reading an “ ‘implicit exception’ ” into\n§1983 to avoid “swamping the habeas statute’s coverage of\nclaims that the prisoner is ‘in custody in violation of the\nConstitution.’ ” Nance v. Ward, 597 U. S. 159, 167 (2022)\n(quoting 28 U. S. C. §2254(a)). This Court has never limited\nthe availability of APA relief so narrowly. To the contrary,\nthe APA has long been available to plaintiffs absent specific\npreclusion by Congress. Abbott Laboratories v. Gardner,\n387 U. S. 136, 141 (1967).\n\f14                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\n   Although the APA allows courts to review only agency ac-\ntion “for which there is no other adequate remedy in a\ncourt,” 5 U. S. C. §704, this Court has long read that limi-\ntation narrowly, emphasizing that it “should not be con-\nstrued to defeat the central purpose of providing a broad\nspectrum of judicial review of agency action.” Bowen v.\nMassachusetts, 487 U. S. 879, 903 (1988); see also Darby v.\nCisneros, 509 U. S. 137, 146 (1993) (“Congress intended by\nthat provision simply to avoid duplicating previously estab-\nlished special statutory procedures for review of agency ac-\ntions”). Indeed, in the mid-20th century, this Court repeat-\nedly said that habeas and APA actions were both available\nto noncitizens challenging their deportation orders. See\nBrownell v. Tom We Shung, 352 U. S. 180, 181 (1956)\n(“[E]ither remedy is available in seeking review of [depor-\ntation] orders”); see also Shaughnessy v. Pedreiro, 349 U. S.\n48, 50–51 (1955) (allowing for judicial review of a deporta-\ntion order under the APA).\n   Against that backdrop, there is every reason to question\nthe majority’s hurried conclusion that habeas relief sup-\nplies the exclusive means to challenge removal under the\nAlien Enemies Act. At the very least, the question is a\nthorny one, and this emergency application was not the\nplace to resolve it. Nor was it the Court’s last chance to\nweigh in. The debate about habeas exclusivity remains on-\ngoing in the District Court, in the context of pending pre-\nliminary injunction proceedings. If the District Court were\nto resolve the question in plaintiffs’ favor, the Government\ncould have appealed to this Court in the ordinary course,\nand we could have decided it after thorough briefing and\noral argument. In its rush to decide the issue now, the\nCourt halts the lower court’s work and forces us to decide\nthe matter after mere days of deliberation and without ad-\nequate time to weigh the parties’ arguments or the full rec-\nord of the District Court’s proceedings.\n\f                  Cite as: 604 U. S. ____ (2025)            15\n\n                    SOTOMAYOR, J., dissenting\n\n                              C\n   The majority’s rush to resolve the question is all the more\ntroubling because this is not one of those rare cases in which\nthe Court must immediately intervene “despite the risk” of\nerror attendant in deciding novel legal questions on the\nemergency docket. Department of Education, 604 U. S., at\n___, (KAGAN, J., dissenting) (slip op., at 2). Recall that the\ndispute has now narrowed into a debate about “which pro-\ncedural vehicle is best situated for the Plaintiffs’ injunctive\nand declaratory claims”: individual habeas petitions filed in\ndistrict courts across the country or a class action filed in\nthe District of Columbia. 2025 WL 914682, *29 (Millett, J.,\nconcurring). The Government may well prefer to defend\nagainst “300 or more individual habeas petitions” than face\nthis class APA case in Washington, D. C. Ibid. That is es-\npecially so because the Government can transfer detainees\nto particular locations in an attempt to secure a more hos-\npitable judicial forum. But such a preference for defending\nagainst one form of litigation over the other is far from the\nkind of concrete and irreparable harm that requires this\nCourt to take the “ ‘extraordinary’ ” step of intervening at\nthis moment, while litigation in the lower courts remains\nongoing. Williams v. Zbaraz, 442 U. S. 1309, 1311 (1979)\n(Stevens, J., in chambers); see Department of Education,\n604 U. S., at ___ (JACKSON, J., dissenting) (slip op., at 8).\n   Meanwhile, funneling plaintiffs’ claims into individual\nhabeas actions across the Nation risks exposing them to se-\nvere and irreparable harm. Rather than seeking to enjoin\nimplementation of the President’s Proclamation against all\nVenezuelan nationals in immigration detention, detainees\nscattered across the country must each obtain counsel and\nfile habeas petitions on their own accord, all without know-\ning whether they will remain in detention where they were\narrested or be secretly transferred to an alternative loca-\ntion. Cf. Ortiz v. Fibreboard Corp., 527 U. S. 815, 860\n(1999) (“One great advantage of class action treatment . . .\n\f16                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nis the opportunity to save the enormous transaction costs of\npiecemeal litigation”).\n   That requirement may have life or death consequences.\nIndividuals who are unable to secure counsel, or who cannot\ntimely appeal an adverse judgment rendered by a habeas\ncourt, face the prospect of removal directly into the perilous\nconditions of El Salvador’s CECOT, where detainees suffer\negregious human rights abuses. See supra, at 7–8. Anyone\nthe Government mistakenly deports in its piecemeal and\nrushed implementation of the challenged Proclamation will\nface the same grave risks. Cf. Defendant’s Memorandum of\nLaw in Opposition in Abrego Garcia v. Noem, No. 25–cv–\n951 (D Md., Mar. 31, 2025), ECF Doc. 11, at 3.\n   The stakes are all the more obvious in light of the Gov-\nernment’s insistence that, once it sends someone to CECOT,\nit cannot be made to retrieve them. Ibid. The Government\nis at this very moment seeking emergency relief from an\norder requiring it to facilitate the return of an individual\nthe Government concededly removed to CECOT “because of\nan administrative error.” Id., at 5; see Emergency Motion\nfor Stay Pending Appeal and Immediate Administrative\nStay in Abrego Garcia v. Noem, No. 25–1345 (CA4, Apr. 5,\n2025), ECF Doc. 3–1, at 2 (“No federal court has the power\nto command the Executive to engage in a certain act of for-\neign relations . . .”). The Government’s resistance to facili-\ntating the return of individuals erroneously removed to\nCECOT only amplifies the specter that, even if this Court\nsomeday declares the President’s Proclamation unlawful,\nscores of individual lives may be irretrievably lost.\n   More fundamentally, this Court exercises its equitable\ndiscretion to intervene without accounting for the Govern-\nment noncompliance that has permeated this litigation to\ndate. The maxim that “ ‘he who comes into equity must\ncome with clean hands’ ” has long guided this Court’s exer-\ncise of equitable discretion. Precision Instrument Mfg. Co.\nv. Automotive Maintenance Machinery Co., 324 U. S. 806,\n\f                  Cite as: 604 U. S. ____ (2025)            17\n\n                    SOTOMAYOR, J., dissenting\n\n814 (1945). While “ ‘equity does not demand that its suitors\nshall have led blameless lives’ ” as to other matters, “it does\nrequire that they shall have acted fairly and without fraud\nor deceit as to the controversy in issue.” Id., at 814–815\n(citing Keystone Driller Co. v. General Excavator Co., 290\nU. S. 240, 245 (1933)).\n   Far from acting “fairly” as to the controversy in District\nCourt, the Government has largely ignored its obligations\nto the rule of law. From the start, the Government sought\nto avoid judicial review, “hustl[ing] people onto those\nplanes” without notice or public Proclamation apparently\n“in the hopes of evading an injunction or perhaps prevent-\ning them from requesting the habeas hearing to which the\nGovernment now acknowledges they are entitled.” 2025\nWL 890401, *5. That the District Court is engaged in a sin-\ncere inquiry into whether the Government willfully violated\nits March 15, 2025, order to turn around the planes should\nbe reason enough to doubt that the Government appears\nbefore this Court with clean hands. That is all the more\ntrue because the Government has persistently stonewalled\nthe District Court’s efforts to find out whether the Govern-\nment in fact flouted its express order. See Tr. 4–5 (Mar. 15,\n2025); Tr. 6–9 (Mar. 17, 2025).\n                        *     *     *\n   The Government’s conduct in this litigation poses an ex-\ntraordinary threat to the rule of law. That a majority of this\nCourt now rewards the Government for its behavior with\ndiscretionary equitable relief is indefensible. We, as a Na-\ntion and a court of law, should be better than this. I re-\nspectfully dissent.\n\f                  Cite as: 604 U. S. ____ (2025)            1\n\n                     JACKSON, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  JUSTICE JACKSON, dissenting.\n  I join JUSTICE SOTOMAYOR’s dissent in full and would\ndeny the application for all the reasons she explains. I write\nseparately to question the majority’s choice to intervene on\nthe eve of the District Court’s preliminary-injunction hear-\ning without scheduling argument or receiving merits brief-\ning. This fly-by-night approach to the work of the Supreme\nCourt is not only misguided. It is also dangerous.\n  The President of the United States has invoked a centu-\nries-old wartime statute to whisk people away to a notori-\nously brutal, foreign-run prison. For lovers of liberty, this\nshould be quite concerning. Surely, the question whether\nsuch Government action is consistent with our Constitution\nand laws warrants considerable thought and attention from\nthe Judiciary. That was why the District Court issued a\ntemporary restraining order to prevent immediate harm to\nthe targeted individuals while the court considered the law-\nfulness of the Government’s conduct. But this Court now\nsees fit to intervene, hastily dashing off a four-paragraph\nper curiam opinion discarding the District Court’s order\nbased solely on a new legal pronouncement that, one might\nhave thought, would require significant deliberation.\n  When this Court decides complex and monumental is-\nsues, it typically allows the lower courts to address those\n\f2                      TRUMP v. J. G. G.\n\n                     JACKSON, J., dissenting\n\nmatters first; it then receives full briefing, hears oral argu-\nment, deliberates internally, and, finally, issues a reasoned\nopinion. Those standard processes may not always yield\ncorrect results. But when we deviate from them, the risk of\nerror always substantially increases. Today’s rushed con-\nclusion—that those challenging the Government’s action\ncan only pursue their claims through habeas—is Exhibit A.\n   I lament that the Court appears to have embarked on a\nnew era of procedural variability, and that it has done so in\nsuch a casual, inequitable, and, in my view, inappropriate\nmanner. See Department of Education v. California, 604\nU. S. ___ , ___ (2025) (JACKSON, J., dissenting) (slip op., at\n1–2). At least when the Court went off base in the past, it\nleft a record so posterity could see how it went wrong. See,\ne.g., Korematsu v. United States, 323 U. S. 214 (1944). With\nmore and more of our most significant rulings taking place\nin the shadows of our emergency docket, today’s Court\nleaves less and less of a trace. But make no mistake: We\nare just as wrong now as we have been in the past, with\nsimilarly devastating consequences. It just seems we are\nnow less willing to face it.\n\f", "html": "", "html_lawbox": "", "html_columbia": "", "html_anon_2020": "", "xml_harvard": "", "html_with_citations": "<pre class=\"inline\">                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            1\n\n                           Per Curiam\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  PER CURIAM.\n  This matter concerns the detention and removal of Vene-\nzuelan nationals believed to be members of Tren de Aragua\n(TdA), an entity that the State Department has designated\nas a foreign terrorist organization. See </pre><span class=\"citation no-link\">90 Fed. Reg. 10030</span><pre class=\"inline\">\n(2025). The President issued Proclamation No. 10903, in-\nvoking the Alien Enemies Act (AEA), Rev. Stat. §4067, </pre><span class=\"citation no-link\">50\nU. S. C. §21</span><pre class=\"inline\">, to detain and remove Venezuelan nationals\n“who are members of TdA.” Invocation of the Alien Ene-\nmies Act Regarding the Invasion of the United States by\nTren de Aragua, </pre><span class=\"citation no-link\">90 Fed. Reg. 13034</span><pre class=\"inline\">. Five detainees and a\nputative class sought injunctive and declaratory relief\nagainst the implementation of, and their removal under,\nthe Proclamation. Initially, the detainees sought relief in\nhabeas among other causes of action, but they dismissed\ntheir habeas claims. On March 15, 2025, the District Court\nfor the District of Columbia issued two temporary restrain-\ning orders (TROs) preventing any removal of the named\nplaintiffs and preventing removal under the AEA of a pro-\nvisionally certified class consisting of “[a]ll noncitizens in\nU.S. custody who are subject to” the Proclamation. Minute\nOrder on Motion To Certify Class in No. 25−cv−00766. On\nMarch 28, the District Court extended the TROs for up to\nan additional 14 days. See Fed. Rule Civ. Proc. 65(b)(2).\n\f2                      TRUMP v. J. G. G.\n\n                          Per Curiam\n\nThe D. C. Circuit denied the Government’s emergency mo-\ntion to stay the orders. The Government then applied to\nthis Court, seeking vacatur of the orders. We construe\nthese TROs as appealable injunctions. See Carson v. Amer-\nican Brands, Inc., </pre><span class=\"citation\" data-id=\"110416\"><a href=\"/opinion/110416/carson-v-american-brands-inc/#84\" aria-description=\"Citation for case: Carson v. American Brands, Inc.\">450 U. S. 79, 84</a></span><pre class=\"inline\"> (1981).\n   We grant the application and vacate the TROs. The de-\ntainees seek equitable relief against the implementation of\nthe Proclamation and against their removal under the AEA.\nThey challenge the Government’s interpretation of the Act\nand assert that they do not fall within the category of re-\nmovable alien enemies. But we do not reach those argu-\nments. Challenges to removal under the AEA, a statute\nwhich largely “ ‘preclude[s] judicial review,’ ” Ludecke v.\nWatkins, </pre><span class=\"citation\" data-id=\"9420220\"><a href=\"/opinion/104589/ludecke-v-watkins/\" aria-description=\"Citation for case: Ludecke v. Watkins\">335 U. S. 160</a></span><pre class=\"inline\">, 163−164, (1948), must be brought\nin habeas. Cf. Heikkila v. Barber, </pre><span class=\"citation\" data-id=\"9420912\"><a href=\"/opinion/105104/heikkila-v-barber/\" aria-description=\"Citation for case: Heikkila v. Barber\">345 U. S. 229</a></span><pre class=\"inline\">, 234−235\n(1953) (holding that habeas was the only cause of action\navailable to challenge deportation under immigration stat-\nutes that “preclud[ed] judicial intervention” beyond what\nwas necessary to vindicate due process rights). Regardless\nof whether the detainees formally request release from con-\nfinement, because their claims for relief “ ‘necessarily imply\nthe invalidity’ ” of their confinement and removal under the\nAEA, their claims fall within the “core” of the writ of habeas\ncorpus and thus must be brought in habeas. Cf. Nance v.\nWard, </pre><span class=\"citation no-link\">597 U. S. 159</span><pre class=\"inline\">, 167 (2022) (quoting Heck v. Humph-\nrey, </pre><span class=\"citation\" data-id=\"9433019\"><a href=\"/opinion/117864/heck-v-humphrey/#487\" aria-description=\"Citation for case: Heck v. Humphrey\">512 U. S. 477, 487</a></span><pre class=\"inline\"> (1994)). And “immediate physical\nrelease [is not] the only remedy under the federal writ of\nhabeas corpus.” Peyton v. Rowe, </pre><span class=\"citation\" data-id=\"107679\"><a href=\"/opinion/107679/peyton-v-rowe/#67\" aria-description=\"Citation for case: Peyton v. Rowe\">391 U. S. 54, 67</a></span><pre class=\"inline\"> (1968); see,\ne.g., Nance, 597 U. S., at 167 (explaining that a capital pris-\noner may seek “to overturn his death sentence” in habeas\nby “analog[y]” to seeking release); In re Bonner, </pre><span class=\"citation\" data-id=\"93765\"><a href=\"/opinion/93765/in-re-bonner/#254\" aria-description=\"Citation for case: In Re Bonner\">151 U. S.\n242, 254, 259</a></span><pre class=\"inline\"> (1894). For “core habeas petitions,” “jurisdic-\ntion lies in only one district: the district of confinement.”\nRumsfeld v. Padilla, </pre><span class=\"citation\" data-id=\"9434672\"><a href=\"/opinion/136999/rumsfeld-v-padilla/#443\" aria-description=\"Citation for case: Rumsfeld v. Padilla\">542 U. S. 426, 443</a></span><pre class=\"inline\"> (2004). The detain-\nees are confined in Texas, so venue is improper in the Dis-\ntrict of Columbia. As a result, the Government is likely to\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            3\n\n                           Per Curiam\n\nsucceed on the merits of this action.\n   The detainees also sought equitable relief against sum-\nmary removal. Although judicial review under the AEA is\nlimited, we have held that an individual subject to deten-\ntion and removal under that statute is entitled to “ ‘judicial\nreview’ ” as to “questions of interpretation and constitution-\nality” of the Act as well as whether he or she “is in fact an\nalien enemy fourteen years of age or older.” Ludecke, 335\nU. S., at 163−164, 172, n. 17. (Under the Proclamation, the\nterm “alien enemy” is defined to include “all Venezuelan cit-\nizens 14 years of age or older who are members of TdA, are\nwithin the United States, and are not actually naturalized\nor lawful permanent residents of the United States.” </pre><span class=\"citation no-link\">90\nFed. Reg. 13034</span><pre class=\"inline\">.) The detainees’ rights against summary\nremoval, however, are not currently in dispute. The Gov-\nernment expressly agrees that “TdA members subject to re-\nmoval under the Alien Enemies Act get judicial review.”\nReply in Support of Application To Vacate 1. “It is well es-\ntablished that the Fifth Amendment entitles aliens to due\nprocess of law” in the context of removal proceedings. Reno\nv. Flores, </pre><span class=\"citation\" data-id=\"9432751\"><a href=\"/opinion/112833/reno-v-flores/#306\" aria-description=\"Citation for case: Reno v. Flores\">507 U. S. 292, 306</a></span><pre class=\"inline\"> (1993). So, the detainees are\nentitled to notice and opportunity to be heard “appropriate\nto the nature of the case.” Mullane v. Central Hanover\nBank &amp; Trust Co., </pre><span class=\"citation\" data-id=\"9420472\"><a href=\"/opinion/104786/mullane-v-central-hanover-bank-trust-co/#313\" aria-description=\"Citation for case: Mullane v. Central Hanover Bank &amp; Trust Co.\">339 U. S. 306, 313</a></span><pre class=\"inline\"> (1950). More specifi-\ncally, in this context, AEA detainees must receive notice af-\nter the date of this order that they are subject to removal\nunder the Act. The notice must be afforded within a rea-\nsonable time and in such a manner as will allow them to\nactually seek habeas relief in the proper venue before such\nremoval occurs.\n   For all the rhetoric of the dissents, today’s order and per\ncuriam confirm that the detainees subject to removal orders\nunder the AEA are entitled to notice and an opportunity to\nchallenge their removal. The only question is which court\nwill resolve that challenge. For the reasons set forth, we\n\f4                     TRUMP v. J. G. G.\n\n                         Per Curiam\n\nhold that venue lies in the district of confinement. The dis-\nsents would have the Court delay resolving that issue, re-\nquiring—given our decision today—that the process begin\nanew down the road. We see no benefit in such wasteful\ndelay.\n  The application to vacate the orders of the United States\nDistrict Court for the District of Columbia presented to THE\nCHIEF JUSTICE and by him referred to the Court is\ngranted. The March 15, 2025 minute orders granting a\ntemporary restraining order and March 28, 2025 extension\nof the United States District Court for the District of Co-\nlumbia, case No. 1:25-cv-766, are vacated.\n\n                                             It is so ordered.\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            1\n\n                   KAVANAUGH, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  JUSTICE KAVANAUGH, concurring.\n  I agree with the Court’s per curiam opinion. Importantly,\nas the Court stresses, the Court’s disagreement with the\ndissenters is not over whether the detainees receive judicial\nreview of their transfers—all nine Members of the Court\nagree that judicial review is available. The only question is\nwhere that judicial review should occur. That venue\nquestion turns on whether these transfer claims belong in\nhabeas corpus proceedings or instead may be brought under\nthe Administrative Procedure Act. I agree with the Court’s\nanalysis that the claims must be brought in habeas.\n  I add only that the use of habeas for transfer claims is not\nnovel. In the extradition context and with respect to\ntransfers of Guantanamo and other wartime detainees,\nhabeas corpus proceedings have long been the appropriate\nvehicle. See LoBue v. Christopher, </pre><span class=\"citation\" data-id=\"717538\"><a href=\"/opinion/717538/anthony-j-lobue-v-warren-christopher-secretary-us-department-of-state/#1082\" aria-description=\"Citation for case: Anthony J. Lobue v. Warren Christopher, Secretary, U.S....\">82 F. 3d 1081, 1082</a></span><pre class=\"inline\">\n(CADC 1996); Kiyemba v. Obama, </pre><span class=\"citation\" data-id=\"9439777\"><a href=\"/opinion/187350/kiyemba-v-obama/\" aria-description=\"Citation for case: Kiyemba v. Obama\">561 F. 3d 509</a></span><pre class=\"inline\">, 512–513\n(CADC 2009). That general rule holds true for claims under\nthe Alien Enemies Act, the statute under which the\nGovernment is seeking to remove these detainees. See\nLudecke v. Watkins, </pre><span class=\"citation\" data-id=\"9420220\"><a href=\"/opinion/104589/ludecke-v-watkins/#163\" aria-description=\"Citation for case: Ludecke v. Watkins\">335 U. S. 160, 163, 171</a></span><pre class=\"inline\">, and n. 17\n(1948). And going back to the English Habeas Corpus Act\nof 1679, if not earlier, habeas corpus has been the proper\nvehicle for detainees to bring claims seeking to bar their\n\f2                    TRUMP v. J. G. G.\n\n                  KAVANAUGH, J., concurring\n\ntransfers. See Habeas Corpus Act of 1679, 31 Car. 2, c. 2,\n§§11–12.\n  Especially given the history and precedent of using\nhabeas corpus to review transfer claims, and given </pre><span class=\"citation no-link\">5\nU. S. C. §704</span><pre class=\"inline\">, which states that claims under the APA are\nnot available when there is another “adequate remedy in a\ncourt,” I agree with the Court that habeas corpus, not the\nAPA, is the proper vehicle here.\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)             1\n\n                    SOTOMAYOR, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n   JUSTICE SOTOMAYOR, with whom JUSTICE KAGAN and\nJUSTICE JACKSON join, and with whom JUSTICE BARRETT\njoins as to Parts II and III–B, dissenting.\n   Three weeks ago, the Federal Government started send-\ning scores of Venezuelan immigrants detained in the\nUnited States to a foreign prison in El Salvador. It did so\nwithout any due process of law, under the auspices of the\nAlien Enemies Act, a 1798 law designed for times of war.\nBetween the start of these removals and now, a District\nCourt has been expeditiously considering the legal claims\nof a group of detainees (hereafter plaintiffs), who allege that\ntheir summary removal violates the Constitution and mul-\ntiple statutes. The District Court ordered a pause on plain-\ntiffs’ removals until it could consider their motion for a pre-\nliminary injunction at a hearing tomorrow, on April 8. Still,\na majority of the Court sees fit to speak to this issue today.\n   Critically, even the majority today agrees, and the Fed-\neral Government now admits, that individuals subject to re-\nmoval under the Alien Enemies Act are entitled to adequate\nnotice and judicial review before they can be removed. That\nshould have been the end of the matter. Yet, with “bare-\nbones briefing, no argument, and scarce time for reflection,”\nDepartment of Education v. California, </pre><span class=\"citation no-link\">604 U. S. ___</span><pre class=\"inline\">, ___\n\f2                         TRUMP v. J. G. G.\n\n                      SOTOMAYOR, J., dissenting\n\n(2025) (KAGAN, J., dissenting) (slip op., at 2), the Court an-\nnounces that legal challenges to an individual’s removal un-\nder the Alien Enemies Act must be brought in habeas peti-\ntions in the district where they are detained.\n   The Court’s legal conclusion is suspect. The Court inter-\nvenes anyway, granting the Government extraordinary re-\nlief and vacating the District Court’s order on that basis\nalone. It does so without mention of the grave harm Plain-\ntiffs will face if they are erroneously removed to El Salvador\nor regard for the Government’s attempts to subvert the ju-\ndicial process throughout this litigation. Because the Court\nshould not reward the Government’s efforts to erode the\nrule of law with discretionary equitable relief, I respectfully\ndissent.\n                               I\n                              A\n   This case arises out of the President’s unprecedented\npeacetime invocation of a wartime law known as the Alien\nEnemies Act. See Act of July 6, 1798, ch. 66, </pre><span class=\"citation no-link\">1 Stat. 577</span><pre class=\"inline\">.\nEnacted in 1798 by a Congress consumed with fear of war\nwith France, the Alien Enemies Act provided a wartime\ncounterpart to the widely denounced Alien Friends Act,\nwhich granted the President sweeping power to detain and\nexpel any noncitizen he deemed “dangerous to the peace\nand safety of the United States.” Act of June 25, 1798, </pre><span class=\"citation no-link\">1\nStat. 571</span><pre class=\"inline\">. Unlike the Alien Friends Act, which lapsed in\ndisrepute as James Madison deemed it “a monster that\nmust for ever disgrace its parents,” the Founders saw the\nAlien Enemies Act as a constitutional exercise of Congress’s\npowers to “declare War,” to “raise and support Armies,” and\nto “provide for calling forth the Militia to . . . suppress In-\nsurrections and repel Invasions.” U. S. Const., Art. I, §8,\ncls. 11–15.1\n——————\n   1 Letter from J. Madison to T. Jefferson (May 20, 1798), in 30 Papers\n\nof Thomas Jefferson 358 (B. Oberg ed. 2003); see also Madison’s Report\n\f                    Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)                   3\n\n                      SOTOMAYOR, J., dissenting\n\n  To that end, the Act grants the President power to detain\nand remove foreign citizens of a “hostile nation or govern-\nment” when “there is a declared war” with such nation or\nwhen a “foreign nation” threatens “invasion or predatory\nincursion” against the territory of the United States. Rev.\nStat. §4067, </pre><span class=\"citation no-link\">50 U. S. C. §21</span><pre class=\"inline\">. Before today, U. S. Presidents\nhave invoked the Alien Enemies Act only three times, each\nin the context of an ongoing war: the War of 1812, World\nWar I, and World War II.2\n  That changed on March 14, 2025, when President Trump\ninvoked the Alien Enemies Act to address an alleged “Inva-\nsion of the United States by Tren De Aragua,” a criminal\norganization based in Venezuela. See Invocation of the Al-\nien Enemies Act Regarding the Invasion of the United\nStates by Tren de Aragua, Proclamation No. 10903, </pre><span class=\"citation no-link\">90 Fed.\nReg. 13033</span><pre class=\"inline\">. There is, of course, no ongoing war between the\nUnited States and Venezuela. Nor is Tren de Aragua itself\na “foreign nation.” §21. The President’s Proclamation\nnonetheless asserts that Tren de Aragua is “undertaking\nhostile actions and conducting irregular warfare against\nthe territory of the United States both directly and at the\ndirection . . . of the Maduro regime in Venezuela.” </pre><span class=\"citation no-link\">90 Fed.\nReg. 13034</span><pre class=\"inline\">. Based on these findings, the Proclamation de-\nclares that “all Venezuelan citizens 14 years of age or older\nwho are members of [Tren de Aragua]” and are not “natu-\nralized [citizens] or lawful permanent residents” are liable\nto “immediate apprehension, detention, and removal” as al-\nien enemies. Ibid.\n\n——————\non the Virginia Resolution, in The Book of the Constitution 52 (E. Wil-\nliams ed. 1833).\n   2 Lockington v. Smith, </pre><span class=\"citation\" data-id=\"9299270\"><a href=\"/opinion/9304179/lockington-v-smith/\" aria-description=\"Citation for case: Lockington v. Smith\">15 F. Cas. 758</a></span><pre class=\"inline\">, 758–759 (No. 8,448) (CC Pa.\n\n1817) (discussing the War of 1812 proclamation); Declaring the Exist-\nence of a State of War With the German Empire and Setting Forth Reg-\nulations Prescribing Conduct Toward Alien Enemies, Proclamation No.\n1364, </pre><span class=\"citation no-link\">40 Stat. 1650</span><pre class=\"inline\"> (World War I); Alien Enemies—Japanese, Proclama-\ntion No. 2525, </pre><span class=\"citation no-link\">55 Stat. 1700</span><pre class=\"inline\"> (World War II).\n\f4                     TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\n   Congress requires the President to “mak[e] public procla-\nmation” of his intention to invoke the Alien Enemies Act.\n§21. President Trump did just the opposite. In what can\nbe understood only as covert preparation to skirt both the\nrequirements of the Act and the Constitution’s guarantee of\ndue process, the Department of Homeland Security (DHS)\nbegan moving Venezuelan migrants from Immigration and\nCustoms Enforcement detention centers across the country\nto the El Valle Detention Facility in South Texas before the\nPresident had even signed the Proclamation. ___ F. Supp.\n3d ___, ___ </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *3 (D DC, Mar. 24, 2025). The\ntransferred detainees, most of whom denied past or present\naffiliation with any gang, did not know the reason for their\ntransfer until the evening of Friday, March 14, when they\nwere apparently “pulled from their cells and told that they\nwould be deported the next day to an unknown destina-\ntion.” Ibid.\n                               B\n  Suspecting that the President had covertly signed a Proc-\nlamation invoking the Alien Enemies Act, several lawyers\nanticipated their clients’ imminent deportation and filed a\nputative class action in the District of Columbia. App. to\nBrief in Opposition To Application To Vacate 9a (App. to\nBIO). They contested that Tren de Aragua had committed\nor attempted the kind of “ ‘invasion’ ” or “ ‘predatory incur-\nsion’ ” required to invoke the Alien Enemies Act. Ibid. They\nalso asserted that it would violate the Due Process Clause\nto deport their clients before they had any chance to chal-\nlenge the Government’s allegations of gang membership.\nId., at 26a. The plaintiffs did not seek release from custody,\nbut asked the court only to restrain the Government’s\nplanned deportations under the Proclamation. Id., at 9a,\n29a.\n  In the early morning of March 15, the District Court in-\nformed the Government of the lawsuit and scheduled an\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)             5\n\n                    SOTOMAYOR, J., dissenting\n\nemergency hearing. Despite knowing of plaintiffs’ claim\nthat it would be unlawful to remove them under the Proc-\nlamation, the Government ushered the named plaintiffs\nonto planes along with dozens of other detainees, all with-\nout any opportunity to contact their lawyers, much less no-\ntice or opportunity to be heard. See </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *5;\nsee also, e.g., Decl. of G. Carney in No. 25–cv–00766 (D DC,\nMar. 19, 2025), ECF Doc. 44–11, at 2.\n   The Government’s plan, it appeared, was to rush plain-\ntiffs out of the country before a court could decide whether\nthe President’s invocation of the Alien Enemies Act was\nlawful or whether these individuals were, in fact, members\nof Tren de Aragua. Plaintiff J. G. G., for example, had no\nchance to tell a court that the tattoos causing DHS to sus-\npect him of gang membership were unrelated to a gang.\nDecl. of J. G. G., ECF Doc. 3–3, at 1. He avers that he is a\ntattoo artist who “got [an] eye tattoo because [he] saw it on\nGoogle” and “thought it looked cool.” Ibid. Plaintiff G. F. F.,\ntoo, was denied the chance to inform a court that the Gov-\nernment accused him of being an “associate/affiliate of Tren\nd[e] Aragua” based solely on his presence at a party of\nstrangers, which he attended at the “insistence of a friend.”\nDecl. of G. Carney, ECF Doc. 3–4, at 1.\n                               C\n  Recognizing the emergency the Government had created\nby deporting plaintiffs without due process, the District\nCourt issued a temporary restraining order that same\nmorning. The order prohibited the Government from re-\nmoving the five named plaintiffs, including J. G. G. and\nG. F. F., pending ongoing litigation. G. F. F., who had been\n“on a plane for about forty minutes to an hour” as “crying\nand frightened” individuals were forced on board, was sub-\nsequently retrieved from the plane by a guard who told him\nhe “ ‘just won the lottery.’ ” Decl. of G. Carney, ECF Doc.\n44–11, at 3.\n\f6                      TRUMP v. J. G. G.\n\n                    SOTOMAYOR, J., dissenting\n\n   The court then set an emergency hearing for 5 p.m. that\nsame day, at which it planned to consider plaintiffs’ claim\nthat temporary relief should be extended to a class of all\nnoncitizens subject to the anticipated Proclamation. See\n</pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *4. Despite notice to the Government of\nthe Court’s scheduled hearing, DHS continued to load up\nthe two planes with detainees and scheduled their immedi-\nate departure. See Tr. 12 (Mar. 15, 2025) (Two flights “were\nscheduled for this afternoon that may have already taken\noff or [will] during this hearing”); Tr. 9 (Apr. 3, 2025) (Gov-\nernment counsel agreeing that DHS was “acting in prepa-\nration of the proclamation before it was posted”). Not until\nan hour before the District Court’s scheduled hearing, and\nonly moments before the Government planned to send its\nplanes off to El Salvador, did the White House finally pub-\nlish the Proclamation on its website.\n   At its 5 p.m. hearing, the District Court provisionally cer-\ntified a class of Venezuelan noncitizens subject to the Proc-\nlamation. See Tr. 23, 25 (Mar. 15, 2025). It then issued an\noral temporary restraining order prohibiting the Govern-\nment from removing all members of the class pursuant to\nthe Proclamation for 14 days. Id., at 42. The order did not\ndisturb the Government’s ability to apprehend or detain in-\ndividuals pursuant to the Proclamation or its authority to\ndeport any individual under the Immigration and Natural-\nization Act. See ibid.; see </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *1. All it re-\nquired of the Government was a pause in deportations pur-\nsuant to the Proclamation until the court had a chance to\nreview their legality. See Tr. 4 (Apr. 3, 2025) (“All th[e]\n[TROs] did was order that the government could not sum-\nmarily deport in-custody noncitizens who were subject to\nthe proclamation without a hearing”). The court further di-\nrected that “any plane containing” individuals subject to the\nProclamation “that is going to take off or is in the air needs\nto be returned to the United States.” Tr. 43 (Mar. 15, 2025).\n\f                     Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)                     7\n\n                       SOTOMAYOR, J., dissenting\n\n                              D\n  Concerns about the Government’s compliance with the\norder quickly followed. Even now, the District Court con-\ntinues to investigate what happened via show-cause pro-\nceedings. In those proceedings, the Government took the\nposition that it had no legal obligation to obey the District\nCourt’s orders directing the return of planes in flight be-\ncause they were issued from the bench. See Tr. 17 (Mar.\n17, 2025) (“[O]ral statements are not injunctions”). Of\ncourse, as the Government well knows, courts routinely is-\nsue rulings from the bench, and those rulings can be ap-\npealed, including to this Court, in appropriate circum-\nstances.3\n  The District Court, for its part, has surmised that “the\nGovernment knew as of 10 a.m. on March 15 that the Court\nwould hold a hearing later that day,” yet it “hustled people\nonto those planes in hopes of evading an injunction or per-\nhaps preventing [individuals] from requesting the habeas\nhearing to which the Government now acknowledges they\nare entitled.” </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *5. Rather than turn\naround the planes that were in the air when the Court is-\nsued its order, moreover, the Federal Government landed\nthe planes full of alleged Venezuelan nationals in El Salva-\ndor and transferred them directly into El Salvador’s Center\nfor Terrorism Confinement (CECOT). Ibid.\n  Deportation directly into CECOT presented a risk of ex-\ntraordinary harm to these Plaintiffs. The record reflects\n\n——————\n  3 See, e.g., United States v. Fruehauf, </pre><span class=\"citation\" data-id=\"9422113\"><a href=\"/opinion/106168/united-states-v-fruehauf/#154\" aria-description=\"Citation for case: United States v. Fruehauf\">365 U. S. 146, 154</a></span><pre class=\"inline\"> (1961) (hear-\n\ning Government’s direct appeal from oral ruling); Evans v. Michigan, </pre><span class=\"citation\" data-id=\"9502784\"><a href=\"/opinion/820896/evans-v-michigan/#320\" aria-description=\"Citation for case: Evans v. Michigan\">568\nU. S. 313, 320</a></span><pre class=\"inline\"> (2013) (relying on lower court’s oral ruling); see also\nWright v. Continental Airlines Corp., </pre><span class=\"citation multiple-matches\"><a href=\"/c/F.%203d/103/146/\">103 F. 3d 146</a></span><pre class=\"inline\"> (CA10 1996) (Table)\n(oral ruling was binding on parties); In re Justice, </pre><span class=\"citation no-link\">172 F. 3d 876</span><pre class=\"inline\"> (CA9\n1999) (Table) (oral order was binding and effective even when written\norder was never entered); Ueckert v. Guerra, </pre><span class=\"citation no-link\">38 F. 4th 446</span><pre class=\"inline\">, 451–452 (CA5\n2022) (oral ruling final and appealable even where district court never\nissued written judgment).\n\f8                     TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nthat inmates in Salvadoran prisons are “ ‘highly likely to\nface immediate and intentional life-threatening harm at\nthe hands of state actors.’ ” Id., at *16 (quoting App. to BIO\n258a). CECOT detainees are frequently “denied communi-\ncation with their relatives and lawyers, and only appear be-\nfore courts in online hearings, often in groups of several\nhundred detainees at the same time.” App. to BIO 260a. El\nSalvador has boasted that inmates in CECOT “ ‘will never\nleave,’ ” ibid., and plaintiffs present evidence that “inmates\nare rarely allowed to leave their cells, have no regular ac-\ncess to drinking water or adequate food, sleep standing up\nbecause of overcrowding, and are held in cells where they\ndo not see sunlight for days,” </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *16. One\nscholar attests that an estimated 375 detainees have died\nin Salvadoran prisons since March 2022. Ibid.\n  What if the Government later determines that it sent one\nof these detainees to CECOT in error? Or a court eventu-\nally decides that the President lacked authority under the\nAlien Enemies Act to declare that Tren de Aragua is perpe-\ntrating or attempting an “invasion” against the territory of\nthe United States? The Government takes the position\nthat, even when it makes a mistake, it cannot retrieve indi-\nviduals from the Salvadoran prisons to which it has sent\nthem. See Defendant’s Memorandum of Law in Opposition\nin Abrego Garcia v. Noem, No. 25–cv–951 (D Md., Mar. 31,\n2025), ECF Doc. 11, at 7–9. The implication of the Govern-\nment’s position is that not only noncitizens but also United\nStates citizens could be taken off the streets, forced onto\nplanes, and confined to foreign prisons with no opportunity\nfor redress if judicial review is denied unlawfully before re-\nmoval. History is no stranger to such lawless regimes, but\nthis Nation’s system of laws is designed to prevent, not en-\nable, their rise.\n                         E\n    Even as the Government has continued to litigate\n\f                 Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            9\n\n                   SOTOMAYOR, J., dissenting\n\nwhether its March 15 deportations complied with the Dis-\ntrict Court’s orders, it simultaneously sought permission to\nresume summary deportations under the Proclamation.\nThe District Court, first, denied the Government’s motion\nto vacate its temporary restraining order, rejecting the as-\nsertion that “the President’s authority and discretion under\nthe [Alien Enemies Act] is not a proper subject for judicial\nscrutiny.” App. to BIO 71a. At the very least, the District\nCourt concluded, the plaintiffs were “likely to succeed” on\ntheir claim that, “before they may be deported, they are en-\ntitled to individualized hearings to determine whether the\nAct applies to them at all.” </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *2. The D. C.\nCircuit, too, denied the Government a requested stay and\nkept in place the District Court’s pause on deportations un-\nder the Alien Enemies Act pending further proceedings.\n</pre><span class=\"citation no-link\">2025 WL 914682</span><pre class=\"inline\">, *1 (per curiam) (Mar. 26, 2025).\n   It is only this Court that sees reason to vacate, for the\nsecond time this week, a temporary restraining order\nstanding “on its last legs.” Department of Education, 604\nU. S., at ___ (JACKSON, J., dissenting) (slip op., at 1). Not\ncontent to wait until tomorrow, when the District Court will\nhave a chance to consider full preliminary injunction brief-\ning at a scheduled hearing, this Court intervenes to relieve\nthe Government of its obligation under the order.\n                              II\n  Begin with that upon which all nine Members of this\nCourt agree. The Court’s order today dictates, in no uncer-\ntain terms, that “individual[s] subject to detention and re-\nmoval under the [Alien Enemies Act are] entitled to ‘judicial\nreview’ as to ‘questions of interpretation and constitution-\nality’ of the Act as well as whether he or she ‘is in fact an\nalien enemy fourteen years of age or older.’ ” Ante, at 2\n(quoting Ludecke v. Watkins, </pre><span class=\"citation\" data-id=\"9420220\"><a href=\"/opinion/104589/ludecke-v-watkins/\" aria-description=\"Citation for case: Ludecke v. Watkins\">335 U. S. 160</a></span><pre class=\"inline\">, 163–164, 172,\nn. 17 (1948)). Therefore, under today’s order, courts below\n\f10                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nwill probe, among other things, the meaning of an “inva-\nsion” or “predatory incursion,” </pre><span class=\"citation no-link\">50 U. S. C. §21</span><pre class=\"inline\">, and ask, for\nexample, whether any given individual is in fact a member\nof Tren de Aragua. Even the Government has now largely\nconceded that point. Application 19.\n   So too do we all agree with the per curiam’s command\nthat the Fifth Amendment requires the Government to af-\nford plaintiffs “notice after the date of this order that they\nare subject to removal under the Act, . . . within reasonable\ntime and in such a manner as will allow them to actually\nseek habeas relief in the proper venue before such removal\noccurs.” Ante, at 3. That means, of course, that the Gov-\nernment cannot usher any detainees, including plaintiffs,\nonto planes in a shroud of secrecy, as it did on March 15,\n2025. Nor can the Government “immediately resume” re-\nmoving individuals without notice upon vacatur of the TRO,\nas it promised the D. C. Circuit it would do. See </pre><span class=\"citation no-link\">2025 WL\n914682</span><pre class=\"inline\">, *13 (Millett, J., concurring) (referencing oral argu-\nment before that court). To the extent the Government re-\nmoves even one individual without affording him notice and\na meaningful opportunity to file and pursue habeas relief,\nit does so in direct contravention of an edict by the United\nStates Supreme Court.\n                               III\n  In light of this agreement, the Court’s decision to inter-\nvene in this litigation is as inexplicable as it is dangerous.\nRecall that, when the District Court issued its temporary\nrestraining order on March 15, 2025, the Government was\nengaged in a covert operation to deport dozens of immi-\ngrants without notice or an opportunity for hearings. The\nCourt’s ruling today means that those deportations violated\nthe Due Process Clause’s most fundamental protections.\nSee ante, at 3 (reiterating that notice and an opportunity\nfor a hearing are required before a deportation under the\nAlien Enemies Act). The District Court rightly intervened\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)           11\n\n                   SOTOMAYOR, J., dissenting\n\nto prohibit temporarily the Government from deporting\nmore individuals in this manner, based on its correct as-\nsessment that the plaintiffs were likely entitled to more\nprocess. </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">, *2.\n   Against the backdrop of the U. S. Government’s unprece-\ndented deportation of dozens of immigrants to a foreign\nprison without due process, a majority of this Court sees fit\nto vacate the District Court’s order. The reason, appar-\nently, is that the majority thinks plaintiffs’ claims should\nhave been styled as habeas actions and filed in the districts\nof their detention. In reaching that result, the majority\nflouts well-established limits on its jurisdiction, creates\nnew law on the emergency docket, and elides the serious\nthreat our intervention poses to the lives of individual de-\ntainees.\n                                A\n   As an initial matter, the Court lacks jurisdiction to re-\nview the District Court’s time-limited, interlocutory order.\nIt is well established that, generally, “temporary restrain-\ning orders are not appealable.” 16 C. Wright, A. Miller, &amp;\nE. Cooper, Federal Practice and Procedure §3922.1, p. 90\n(3d ed. 2012). That rule is a general one because it gives\nway where a temporary restraining order risks imposing\nsuch an “ ‘irreparable . . . consequence’ ” that an immediate\nappeal is necessary if the order is to be “ ‘effectually chal-\nlenged’ ” at all. Carson v. American Brands, Inc., </pre><span class=\"citation\" data-id=\"110416\"><a href=\"/opinion/110416/carson-v-american-brands-inc/#84\" aria-description=\"Citation for case: Carson v. American Brands, Inc.\">450 U. S.\n79, 84</a></span><pre class=\"inline\"> (1981).\n   Here, the District Court ordered a 14-day halt on depor-\ntations pursuant to the Proclamation (extended once for 14\nadditional days) because it thought the plaintiffs were\nlikely entitled to “individualized hearings to determine\nwhether the Act applies to them at all.” </pre><span class=\"citation no-link\">2025 WL 890401</span><pre class=\"inline\">,\n*2. The Government now admits that it must provide de-\ntainees with adequate notice, and it says they can then file\nhabeas petitions in the Southern District of Texas to contest\n\f12                     TRUMP v. J. G. G.\n\n                    SOTOMAYOR, J., dissenting\n\nand stay their removal under the Alien Enemies Act. Such\nproceedings, if adequately provided, necessarily mean that\nthe Government cannot imminently deport the Plaintiffs\nunder the Proclamation. So it is hard to see why the Dis-\ntrict Court’s temporary restraining order (of which only five\ndays now remain) presented the Government with an emer-\ngency of any kind, much less one that required an immedi-\nate appeal.\n                                 B\n    Also troubling is this Court’s decision to vacate summar-\nily the District Court’s order on the novel ground that an\nindividual’s challenge to his removal under the Alien Ene-\nmies Act “fall[s] within the ‘core’ of the writ of habeas cor-\npus” and must therefore be filed where the plaintiffs are de-\ntained. Ante, at 2. The Court reaches that conclusion\nwithout oral argument or the benefit of percolation in the\nlower courts, and with just a few days of deliberation based\non barebones briefing.\n    This conclusion is dubious. As an initial matter, the ma-\njority’s assertion that plaintiffs’ claims “sound” in habeas is\nin tension with this Court’s understanding of habeas corpus\nas, at its core, an avenue for a person in custody to “attack\n. . . the legality of that custody” and “to secure release from\nillegal custody.” Preiser v. Rodriguez, </pre><span class=\"citation\" data-id=\"9425260\"><a href=\"/opinion/108772/preiser-v-rodriguez/#484\" aria-description=\"Citation for case: Preiser v. Rodriguez\">411 U. S. 475, 484</a></span><pre class=\"inline\">\n(1973). The plaintiffs in this case sued not to challenge\ntheir detention, but to protect themselves from summary\ndeportation pursuant to the Proclamation. Indeed, because\nall of the plaintiffs were already in immigration detention\nunder other statutes when the Government subjected them\nto the Proclamation, they “have repeatedly emphasized\nthroughout this litigation that they ‘do not seek release\nfrom custody’ ” and are not “contesting the validity of their\nconfinement or seeking to shorten its duration.” </pre><span class=\"citation no-link\">2025 WL\n890401</span><pre class=\"inline\">, *8.\n    Nevertheless, the majority insists that plaintiffs’ claims\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            13\n\n                    SOTOMAYOR, J., dissenting\n\n“ ‘necessarily imply the invalidity’ ” of their confinement and\nremoval under the Act, and so essentially amount to a chal-\nlenge to their present physical confinement. Ante, at 2. It\ntherefore analogizes this case to the line of cases beginning\nwith Heck v. Humphrey, </pre><span class=\"citation\" data-id=\"9433019\"><a href=\"/opinion/117864/heck-v-humphrey/\" aria-description=\"Citation for case: Heck v. Humphrey\">512 U. S. 477</a></span><pre class=\"inline\"> (1994), where the\nCourt held that individuals serving state criminal sen-\ntences cannot bring </pre><span class=\"citation no-link\">42 U. S. C. §1983</span><pre class=\"inline\"> suits to complain of\n“unconstitutional treatment at the hands of state officials”\nif a judgment in their favor would “necessarily imply the\ninvalidity of his conviction or sentence.” </pre><span class=\"citation\" data-id=\"9433019\"><a href=\"/opinion/117864/heck-v-humphrey/#480\" aria-description=\"Citation for case: Heck v. Humphrey\">512 U. S., at 480,\n487</a></span><pre class=\"inline\">. In such cases, habeas is the exclusive avenue for relief.\n</pre><span class=\"citation\" data-id=\"9433019\"><a href=\"/opinion/117864/heck-v-humphrey/\" aria-description=\"Citation for case: Heck v. Humphrey\">Ibid.</a></span><pre class=\"inline\"> Plaintiffs’ claims, however, do not “imply the invalid-\nity of ” their detention, because their detention predated the\nProclamation and was unrelated to the Alien Enemies Act.\nThus, if they succeeded in showing that they could not be\nremoved under the Proclamation, that would not result in\ntheir release from detention. Even in the context of §1983\nchallenges by criminal defendants, this Court has never\n“recognized habeas as the sole remedy, or even an available\none, where the relief sought would ‘neither terminate cus-\ntody, accelerate the future date of release from custody, nor\nreduce the level of custody.’ ” Skinner v. Switzer, </pre><span class=\"citation\" data-id=\"7260400\"><a href=\"/opinion/7342462/skinner-v-switzer/#534\" aria-description=\"Citation for case: Skinner v. Switzer\">562 U. S.\n521, 534</a></span><pre class=\"inline\"> (2011) (brackets omitted).\n   There is also good reason to doubt that Heck’s holding\nabout the availability of relief under §1983 extends to Ad-\nministrative Procedure Act (APA) claims challenging exec-\nutive action under the Alien Enemies Act. The Heck bar\narose from the Court reading an “ ‘implicit exception’ ” into\n§1983 to avoid “swamping the habeas statute’s coverage of\nclaims that the prisoner is ‘in custody in violation of the\nConstitution.’ ” Nance v. Ward, </pre><span class=\"citation no-link\">597 U. S. 159</span><pre class=\"inline\">, 167 (2022)\n(quoting </pre><span class=\"citation no-link\">28 U. S. C. §2254</span><pre class=\"inline\">(a)). This Court has never limited\nthe availability of APA relief so narrowly. To the contrary,\nthe APA has long been available to plaintiffs absent specific\npreclusion by Congress. Abbott Laboratories v. Gardner,\n</pre><span class=\"citation\" data-id=\"107451\"><a href=\"/opinion/107451/abbott-laboratories-v-gardner/#141\" aria-description=\"Citation for case: Abbott Laboratories v. Gardner\">387 U. S. 136, 141</a></span><pre class=\"inline\"> (1967).\n\f14                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\n   Although the APA allows courts to review only agency ac-\ntion “for which there is no other adequate remedy in a\ncourt,” </pre><span class=\"citation no-link\">5 U. S. C. §704</span><pre class=\"inline\">, this Court has long read that limi-\ntation narrowly, emphasizing that it “should not be con-\nstrued to defeat the central purpose of providing a broad\nspectrum of judicial review of agency action.” Bowen v.\nMassachusetts, </pre><span class=\"citation\" data-id=\"9431455\"><a href=\"/opinion/112143/bowen-v-massachusetts/#903\" aria-description=\"Citation for case: Bowen v. Massachusetts\">487 U. S. 879, 903</a></span><pre class=\"inline\"> (1988); see also Darby v.\nCisneros, </pre><span class=\"citation\" data-id=\"112891\"><a href=\"/opinion/112891/darby-v-cisneros/#146\" aria-description=\"Citation for case: Darby v. Cisneros\">509 U. S. 137, 146</a></span><pre class=\"inline\"> (1993) (“Congress intended by\nthat provision simply to avoid duplicating previously estab-\nlished special statutory procedures for review of agency ac-\ntions”). Indeed, in the mid-20th century, this Court repeat-\nedly said that habeas and APA actions were both available\nto noncitizens challenging their deportation orders. See\nBrownell v. Tom We Shung, </pre><span class=\"citation\" data-id=\"105434\"><a href=\"/opinion/105434/brownell-v-tom-we-shung/#181\" aria-description=\"Citation for case: Brownell v. Tom We Shung\">352 U. S. 180, 181</a></span><pre class=\"inline\"> (1956)\n(“[E]ither remedy is available in seeking review of [depor-\ntation] orders”); see also Shaughnessy v. Pedreiro, </pre><span class=\"citation\" data-id=\"9421160\"><a href=\"/opinion/105296/shaughnessy-v-pedreiro/\" aria-description=\"Citation for case: Shaughnessy v. Pedreiro\">349 U. S.\n48</a></span><pre class=\"inline\">, 50–51 (1955) (allowing for judicial review of a deporta-\ntion order under the APA).\n   Against that backdrop, there is every reason to question\nthe majority’s hurried conclusion that habeas relief sup-\nplies the exclusive means to challenge removal under the\nAlien Enemies Act. At the very least, the question is a\nthorny one, and this emergency application was not the\nplace to resolve it. Nor was it the Court’s last chance to\nweigh in. The debate about habeas exclusivity remains on-\ngoing in the District Court, in the context of pending pre-\nliminary injunction proceedings. If the District Court were\nto resolve the question in plaintiffs’ favor, the Government\ncould have appealed to this Court in the ordinary course,\nand we could have decided it after thorough briefing and\noral argument. In its rush to decide the issue now, the\nCourt halts the lower court’s work and forces us to decide\nthe matter after mere days of deliberation and without ad-\nequate time to weigh the parties’ arguments or the full rec-\nord of the District Court’s proceedings.\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            15\n\n                    SOTOMAYOR, J., dissenting\n\n                              C\n   The majority’s rush to resolve the question is all the more\ntroubling because this is not one of those rare cases in which\nthe Court must immediately intervene “despite the risk” of\nerror attendant in deciding novel legal questions on the\nemergency docket. Department of Education, 604 U. S., at\n___, (KAGAN, J., dissenting) (slip op., at 2). Recall that the\ndispute has now narrowed into a debate about “which pro-\ncedural vehicle is best situated for the Plaintiffs’ injunctive\nand declaratory claims”: individual habeas petitions filed in\ndistrict courts across the country or a class action filed in\nthe District of Columbia. </pre><span class=\"citation no-link\">2025 WL 914682</span><pre class=\"inline\">, *29 (Millett, J.,\nconcurring). The Government may well prefer to defend\nagainst “300 or more individual habeas petitions” than face\nthis class APA case in Washington, D. C. Ibid. That is es-\npecially so because the Government can transfer detainees\nto particular locations in an attempt to secure a more hos-\npitable judicial forum. But such a preference for defending\nagainst one form of litigation over the other is far from the\nkind of concrete and irreparable harm that requires this\nCourt to take the “ ‘extraordinary’ ” step of intervening at\nthis moment, while litigation in the lower courts remains\nongoing. Williams v. Zbaraz, </pre><span class=\"citation\" data-id=\"110125\"><a href=\"/opinion/110125/williams-v-zbaraz/#1311\" aria-description=\"Citation for case: Williams v. Zbaraz\">442 U. S. 1309, 1311</a></span><pre class=\"inline\"> (1979)\n(Stevens, J., in chambers); see Department of Education,\n604 U. S., at ___ (JACKSON, J., dissenting) (slip op., at 8).\n   Meanwhile, funneling plaintiffs’ claims into individual\nhabeas actions across the Nation risks exposing them to se-\nvere and irreparable harm. Rather than seeking to enjoin\nimplementation of the President’s Proclamation against all\nVenezuelan nationals in immigration detention, detainees\nscattered across the country must each obtain counsel and\nfile habeas petitions on their own accord, all without know-\ning whether they will remain in detention where they were\narrested or be secretly transferred to an alternative loca-\ntion. Cf. Ortiz v. Fibreboard Corp., </pre><span class=\"citation\" data-id=\"9433871\"><a href=\"/opinion/118319/ortiz-v-fibreboard-corp/#860\" aria-description=\"Citation for case: Ortiz v. Fibreboard Corp.\">527 U. S. 815, 860</a></span><pre class=\"inline\">\n(1999) (“One great advantage of class action treatment . . .\n\f16                    TRUMP v. J. G. G.\n\n                   SOTOMAYOR, J., dissenting\n\nis the opportunity to save the enormous transaction costs of\npiecemeal litigation”).\n   That requirement may have life or death consequences.\nIndividuals who are unable to secure counsel, or who cannot\ntimely appeal an adverse judgment rendered by a habeas\ncourt, face the prospect of removal directly into the perilous\nconditions of El Salvador’s CECOT, where detainees suffer\negregious human rights abuses. See supra, at 7–8. Anyone\nthe Government mistakenly deports in its piecemeal and\nrushed implementation of the challenged Proclamation will\nface the same grave risks. Cf. Defendant’s Memorandum of\nLaw in Opposition in Abrego Garcia v. Noem, No. 25–cv–\n951 (D Md., Mar. 31, 2025), ECF Doc. 11, at 3.\n   The stakes are all the more obvious in light of the Gov-\nernment’s insistence that, once it sends someone to CECOT,\nit cannot be made to retrieve them. Ibid. The Government\nis at this very moment seeking emergency relief from an\norder requiring it to facilitate the return of an individual\nthe Government concededly removed to CECOT “because of\nan administrative error.” Id., at 5; see Emergency Motion\nfor Stay Pending Appeal and Immediate Administrative\nStay in Abrego Garcia v. Noem, No. 25–1345 (CA4, Apr. 5,\n2025), ECF Doc. 3–1, at 2 (“No federal court has the power\nto command the Executive to engage in a certain act of for-\neign relations . . .”). The Government’s resistance to facili-\ntating the return of individuals erroneously removed to\nCECOT only amplifies the specter that, even if this Court\nsomeday declares the President’s Proclamation unlawful,\nscores of individual lives may be irretrievably lost.\n   More fundamentally, this Court exercises its equitable\ndiscretion to intervene without accounting for the Govern-\nment noncompliance that has permeated this litigation to\ndate. The maxim that “ ‘he who comes into equity must\ncome with clean hands’ ” has long guided this Court’s exer-\ncise of equitable discretion. Precision Instrument Mfg. Co.\nv. Automotive Maintenance Machinery Co., </pre><span class=\"citation\" data-id=\"104131\"><a href=\"/opinion/104131/precision-instrument-manufacturing-co-v-automotive-maintenance-machinery/\" aria-description=\"Citation for case: Precision Instrument Manufacturing Co. v. Automotive...\">324 U. S. 806</a></span><pre class=\"inline\">,\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            17\n\n                    SOTOMAYOR, J., dissenting\n\n814 (1945). While “ ‘equity does not demand that its suitors\nshall have led blameless lives’ ” as to other matters, “it does\nrequire that they shall have acted fairly and without fraud\nor deceit as to the controversy in issue.” Id., at 814–815\n(citing Keystone Driller Co. v. General Excavator Co., </pre><span class=\"citation\" data-id=\"102153\"><a href=\"/opinion/102153/keystone-driller-co-v-general-excavator-co/#245\" aria-description=\"Citation for case: Keystone Driller Co. v. General Excavator Co.\">290\nU. S. 240, 245</a></span><pre class=\"inline\"> (1933)).\n   Far from acting “fairly” as to the controversy in District\nCourt, the Government has largely ignored its obligations\nto the rule of law. From the start, the Government sought\nto avoid judicial review, “hustl[ing] people onto those\nplanes” without notice or public Proclamation apparently\n“in the hopes of evading an injunction or perhaps prevent-\ning them from requesting the habeas hearing to which the\nGovernment now acknowledges they are entitled.” </pre><span class=\"citation no-link\">2025\nWL 890401</span><pre class=\"inline\">, *5. That the District Court is engaged in a sin-\ncere inquiry into whether the Government willfully violated\nits March 15, 2025, order to turn around the planes should\nbe reason enough to doubt that the Government appears\nbefore this Court with clean hands. That is all the more\ntrue because the Government has persistently stonewalled\nthe District Court’s efforts to find out whether the Govern-\nment in fact flouted its express order. See Tr. 4–5 (Mar. 15,\n2025); Tr. 6–9 (Mar. 17, 2025).\n                        *     *     *\n   The Government’s conduct in this litigation poses an ex-\ntraordinary threat to the rule of law. That a majority of this\nCourt now rewards the Government for its behavior with\ndiscretionary equitable relief is indefensible. We, as a Na-\ntion and a court of law, should be better than this. I re-\nspectfully dissent.\n\f                  Cite as: </pre><span class=\"citation no-link\">604 U. S. ____</span><pre class=\"inline\"> (2025)            1\n\n                     JACKSON, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n                          _________________\n\n                           No. 24A931\n                          _________________\n\n\n  DONALD J. TRUMP, PRESIDENT OF THE UNITED\n         STATES, ET AL. v. J. G. G., ET AL.\n    ON APPLICATION TO VACATE THE ORDERS ISSUED BY\n      THE UNITED STATES DISTRICT COURT FOR THE\n                DISTRICT OF COLUMBIA\n                         [April 7, 2025]\n\n  JUSTICE JACKSON, dissenting.\n  I join JUSTICE SOTOMAYOR’s dissent in full and would\ndeny the application for all the reasons she explains. I write\nseparately to question the majority’s choice to intervene on\nthe eve of the District Court’s preliminary-injunction hear-\ning without scheduling argument or receiving merits brief-\ning. This fly-by-night approach to the work of the Supreme\nCourt is not only misguided. It is also dangerous.\n  The President of the United States has invoked a centu-\nries-old wartime statute to whisk people away to a notori-\nously brutal, foreign-run prison. For lovers of liberty, this\nshould be quite concerning. Surely, the question whether\nsuch Government action is consistent with our Constitution\nand laws warrants considerable thought and attention from\nthe Judiciary. That was why the District Court issued a\ntemporary restraining order to prevent immediate harm to\nthe targeted individuals while the court considered the law-\nfulness of the Government’s conduct. But this Court now\nsees fit to intervene, hastily dashing off a four-paragraph\nper curiam opinion discarding the District Court’s order\nbased solely on a new legal pronouncement that, one might\nhave thought, would require significant deliberation.\n  When this Court decides complex and monumental is-\nsues, it typically allows the lower courts to address those\n\f2                      TRUMP v. J. G. G.\n\n                     JACKSON, J., dissenting\n\nmatters first; it then receives full briefing, hears oral argu-\nment, deliberates internally, and, finally, issues a reasoned\nopinion. Those standard processes may not always yield\ncorrect results. But when we deviate from them, the risk of\nerror always substantially increases. Today’s rushed con-\nclusion—that those challenging the Government’s action\ncan only pursue their claims through habeas—is Exhibit A.\n   I lament that the Court appears to have embarked on a\nnew era of procedural variability, and that it has done so in\nsuch a casual, inequitable, and, in my view, inappropriate\nmanner. See Department of Education v. California, </pre><span class=\"citation no-link\">604\nU. S. ___</span><pre class=\"inline\"> , ___ (2025) (JACKSON, J., dissenting) (slip op., at\n1–2). At least when the Court went off base in the past, it\nleft a record so posterity could see how it went wrong. See,\ne.g., Korematsu v. United States, </pre><span class=\"citation\" data-id=\"9419548\"><a href=\"/opinion/104040/korematsu-v-united-states/\" aria-description=\"Citation for case: Korematsu v. United States\">323 U. S. 214</a></span><pre class=\"inline\"> (1944). With\nmore and more of our most significant rulings taking place\nin the shadows of our emergency docket, today’s Court\nleaves less and less of a trace. But make no mistake: We\nare just as wrong now as we have been in the past, with\nsimilarly devastating consequences. It just seems we are\nnow less willing to face it.\n\f</pre>", "extracted_by_ocr": false, "ordering_key": null, "main_version": null, "opinions_cited": ["https://www.courtlistener.com/api/rest/v4/opinions/93765/", "https://www.courtlistener.com/api/rest/v4/opinions/102153/", "https://www.courtlistener.com/api/rest/v4/opinions/104131/", "https://www.courtlistener.com/api/rest/v4/opinions/105434/", "https://www.courtlistener.com/api/rest/v4/opinions/107451/", "https://www.courtlistener.com/api/rest/v4/opinions/107679/", "https://www.courtlistener.com/api/rest/v4/opinions/110125/", "https://www.courtlistener.com/api/rest/v4/opinions/110416/", "https://www.courtlistener.com/api/rest/v4/opinions/112891/", "https://www.courtlistener.com/api/rest/v4/opinions/717538/", "https://www.courtlistener.com/api/rest/v4/opinions/7260400/", "https://www.courtlistener.com/api/rest/v4/opinions/9299270/", "https://www.courtlistener.com/api/rest/v4/opinions/9419548/", "https://www.courtlistener.com/api/rest/v4/opinions/9420220/", "https://www.courtlistener.com/api/rest/v4/opinions/9420472/", "https://www.courtlistener.com/api/rest/v4/opinions/9420912/", "https://www.courtlistener.com/api/rest/v4/opinions/9421160/", "https://www.courtlistener.com/api/rest/v4/opinions/9422113/", "https://www.courtlistener.com/api/rest/v4/opinions/9425260/", "https://www.courtlistener.com/api/rest/v4/opinions/9431455/", "https://www.courtlistener.com/api/rest/v4/opinions/9432751/", "https://www.courtlistener.com/api/rest/v4/opinions/9433019/", "https://www.courtlistener.com/api/rest/v4/opinions/9433871/", "https://www.courtlistener.com/api/rest/v4/opinions/9434672/", "https://www.courtlistener.com/api/rest/v4/opinions/9439777/", "https://www.courtlistener.com/api/rest/v4/opinions/9502784/"]}