{"resource_uri": "https://www.courtlistener.com/api/rest/v4/opinions/11084232/", "id": 11084232, "absolute_url": "/opinion/10617644/hewitt-v-united-states/", "cluster_id": 10617644, "cluster": "https://www.courtlistener.com/api/rest/v4/clusters/10617644/", "author_id": 1609, "author": "https://www.courtlistener.com/api/rest/v4/people/1609/", "joined_by": [], "date_created": "2025-06-26T08:01:19.929445-07:00", "date_modified": "2025-06-26T08:27:47.158466-07:00", "author_str": "", "per_curiam": false, "joined_by_str": "", "type": "010combined", "sha1": "1fe76de0b82ce82e2efd245c13178fde74bd5e03", "page_count": 43, "download_url": "https://www.supremecourt.gov/opinions/24pdf/23-1002_1p24.pdf", "local_path": "pdf/2025/06/26/hewitt_v._united_states.pdf", "plain_text": "(Slip Opinion)              OCTOBER TERM, 2024                                       1\n\n                                       Syllabus\n\n         NOTE: Where it is feasible, a syllabus (headnote) will be released, as is\n       being done in connection with this case, at the time the opinion is issued.\n       The syllabus constitutes no part of the opinion of the Court but has been\n       prepared by the Reporter of Decisions for the convenience of the reader.\n       See United States v. Detroit Timber & Lumber Co., 200 U. S. 321, 337.\n\n\nSUPREME COURT OF THE UNITED STATES\n\n                                       Syllabus\n\n                     HEWITT v. UNITED STATES\n\nCERTIORARI TO THE UNITED STATES COURT OF APPEALS FOR\n                  THE FIFTH CIRCUIT\n\n   No. 23–1002. Argued January 13, 2025—Decided June 26, 2025*\n\n\nBefore the First Step Act was enacted in 2018, federal judges were re-\n  quired to sentence first-time offenders convicted of violating 18\n  U. S. C. §924(c)—a law that criminalizes possessing a firearm while\n  committing other crimes—to “stacked” 25-year periods of incarcera-\n  tion. The First Step Act eliminated this harsh mandatory minimum\n  penalty. Section 403(b) of the Act also made its more lenient penalties\n  partially retroactive. Specifically, if a sentence “has not been imposed”\n  upon an eligible §924(c) offender as of the date of the First Step Act’s\n  enactment, the Act applies. The question presented here concerns an\n  edge case: What penalties apply when a §924(c) offender had been sen-\n  tenced as of the Act’s enactment, but that sentence was subsequently\n  vacated, such that the offender must face a post-Act resentencing?\n     In 2009, petitioners Tony Hewitt, Corey Duffey, and Jarvis Ross\n  were convicted of multiple counts of bank robbery and conspiracy to\n  commit bank robbery, along with corresponding §924(c) offenses for\n  use of a firearm during a crime of violence. Each petitioner received a\n  mandatory 5-year sentence for his first §924(c) count of conviction and,\n  despite being first-time offenders, each received 25-year mandatory\n  sentences on every §924(c) count beyond his first. Thus, each peti-\n  tioner’s sentence exceeded 325 years. Petitioners successfully chal-\n  lenged some of their convictions on direct appeal, and the Fifth Circuit\n  vacated petitioners’ sentences. In 2012, the District Court resentenced\n  each petitioner to between 285 and 305 years on the counts that re-\n  mained.\n——————\n   *Together with No. 23–1150, Duffey et al. v. United States, also on cer-\ntiorari to the same court.\n\f2                      HEWITT v. UNITED STATES\n\n                                  Syllabus\n\n       In 2019, the Court held that the “crime of violence” definition the\n    Government routinely used to support some §924(c) convictions was\n    unconstitutionally vague. See United States v. Davis, 588 U. S. 445,\n    470. Because that holding potentially affected some of petitioners’ re-\n    maining convictions, the Fifth Circuit granted petitioners authoriza-\n    tion to file a second or successive postconviction motion. The District\n    Court then vacated the impacted §924(c) convictions, as well as peti-\n    tioners’ sentences. When the District Court held resentencings for the\n    remaining convictions, petitioners argued that the First Step Act’s 5-\n    year—not 25-year—mandatory minimum penalties applied. Petition-\n    ers argued they were entitled to retroactive application of the Act’s\n    more lenient penalties because a vacated prior sentence is not a sen-\n    tence that “has . . . been imposed” for purposes of §403(b). The District\n    Court disagreed and resentenced petitioners under the pre-Act sen-\n    tencing scheme, giving them stacked 25-year mandatory minimums\n    for each §924(c) count of conviction beyond their first. Petitioners thus\n    each received sentences of 130 years or more.\n       On appeal, petitioners and the Government agreed that the First\n    Step Act should have applied at petitioners’ resentencings. The Fifth\n    Circuit denied their joint request for vacatur. In that court’s view,\n    §403(b) applies only “to defendants for whom ‘a sentence . . . ha[d] not\n    been imposed’ as of the enactment date.” 92 F. 4th 304, 310. Because\n    each petitioner had been sentenced (twice) prior to the Act’s enact-\n    ment, the panel concluded that petitioners were not eligible for the\n    First Step Act’s more lenient mandatory minimums.\nHeld: The judgment is reversed, and the case is remanded. Pp. 6–12.\n92 F. 4th 304, reversed and remanded.\n     JUSTICE JACKSON delivered the opinion of the Court with respect to\n  Parts I, II, and III, concluding that under §403(b) of the First Step Act,\n  a sentence “has . . . been imposed” for purposes of that provision if, and\n  only if, the sentence is extant—i.e., has not been vacated. Thus, the\n  Act’s more lenient penalties apply to defendants whose previous\n  §924(c) sentences have been vacated and who need to be resentenced\n  following the Act’s enactment. Pp. 6–12.\n     (a) The text of §403(b) and the nature of vacatur support this con-\n  clusion. Congress employed the present-perfect tense, requiring eval-\n  uation of whether “a sentence . . . has . . . been imposed” upon the de-\n  fendant, rather than the past-perfect tense that would exclude anyone\n  upon whom a sentence “had” been imposed. The present-perfect tense\n  can refer to “an act, state, or condition that is now completed” or “a\n  past action that comes up to and touches the present” and thus conveys\n  that the event in question continues to be true or valid. The Chicago\n  Manual of Style §5.132, p. 268. When used in either sense, the pre-\n\f                      Cite as: 606 U. S. ____ (2025)                     3\n\n                                Syllabus\n\n  sent-perfect tense addresses whether something has continuing rele-\n  vance to the present, not merely whether it occurred as a historical\n  fact. If an event is merely a relic of history because it was voided by a\n  subsequent action, the past-perfect (not the present-perfect) tense is\n  usually the more appropriate verb choice. The fact that adjacent pro-\n  visions of §403 contain past-tense verbs only strengthens the conclu-\n  sion that §403(b)’s use of the present-perfect tense is meaningful.\n  Pp. 6–10.\n      (b) Background principles regarding the legal effect of vacatur con-\n  firm that a sentence has been imposed for §403(b) purposes only so\n  long as it remains valid. When interpreting statutes, the Court recog-\n  nizes that Congress legislates against the backdrop of certain unex-\n  pressed presumptions. One such presumption is that vacated court\n  orders are void ab initio and thus lack any prospective legal effect. A\n  criminal defendant whose conviction has been vacated, for example, is\n  to be treated going forward as though he were never convicted. By\n  operation of legal fiction, the law acts as though the previous convic-\n  tion never occurred. Section 403(b) reflects this commonsense under-\n  standing of background vacatur principles. Just as defendants with\n  vacated prior felony convictions are not precluded from possessing\n  weapons under the federal felon-in-possession ban, §403(b) retroactiv-\n  ity does not exclude from its scope those whose prior sentences were\n  vacated. By authorizing retroactive application of the First Step Act’s\n  more lenient penalties on any eligible offender upon whom “a sentence\n  . . . has not been imposed,” the text of §403(b) indicates that only past\n  sentences with continued validity preclude application of the Act’s new\n  penalties. Pp. 10–12.\n\n   JACKSON, J., delivered the opinion of the Court with respect to Parts I,\nII, and III, in which ROBERTS, C. J., and SOTOMAYOR, KAGAN, and GOR-\nSUCH, JJ., joined, and an opinion with respect to Parts IV and V, in which\nSOTOMAYOR and KAGAN, JJ., joined. ALITO, J., filed a dissenting opinion,\nin which THOMAS, KAVANAUGH, and BARRETT, JJ., joined.\n\f                        Cite as: 606 U. S. ____ (2025)                              1\n\n                             Opinion of the Court\n\n     NOTICE: This opinion is subject to formal revision before publication in the\n     United States Reports. Readers are requested to notify the Reporter of\n     Decisions, Supreme Court of the United States, Washington, D. C. 20543,\n     pio@supremecourt.gov, of any typographical or other formal errors.\n\n\nSUPREME COURT OF THE UNITED STATES\n                TONY R. HEWITT, PETITIONER\n23–1002                     v.\n                      UNITED STATES\n\n   COREY DEYON DUFFEY, ET AL., PETITIONERS\n23–1150             v.\n              UNITED STATES\n  ON PETITIONS FOR WRITS OF CERTIORARI TO THE UNITED\n    STATES COURT OF APPEALS FOR THE FIFTH CIRCUIT\n         Nos. 23–1002 and 23–1150. Decided June 26, 2025\n\n  JUSTICE JACKSON delivered the opinion of the Court, ex-\ncept as to Parts IV and V.*\n  Before the First Step Act was enacted in 2018, federal\njudges were required to sentence certain first-time offend-\ners convicted of violating 18 U. S. C. §924(c)—a law that\ncriminalizes the possession of a firearm while committing\nother crimes—to “stacked” 25-year periods of incarceration.\nThe First Step Act, 132 Stat. 5194, eliminated this harsh\nmandatory minimum penalty. Congress also made the\nAct’s more lenient penalties partially retroactive. Section\n403(b) specifies that the Act applies if a sentence “has not\nbeen imposed” upon an eligible §924(c) offender as of the\ndate of the First Step Act’s enactment. Id., at 5222.\n  The question presented here concerns an edge case: What\npenalties apply when a §924(c) offender had been sentenced\nas of the Act’s enactment, but that sentence was subse-\nquently vacated, such that the offender must face a post-\n——————\n   *THE CHIEF JUSTICE and JUSTICE GORSUCH join all but Parts IV and V\nof this opinion.\n\f2                   HEWITT v. UNITED STATES\n\n                        Opinion of the Court\n\nAct resentencing? We hold that, under that circumstance,\na sentence “has not been imposed” for purposes of §403(b).\nThus, the First Step Act’s more lenient penalties apply.\n                               I\n   Title 18 U. S. C. §924(c) criminalizes the use or posses-\nsion of a firearm during and in relation to a crime of vio-\nlence or drug-trafficking offense. The statute prescribes a\n5-year mandatory minimum penalty for any first-time of-\nfense, which must run consecutively to any other term of\nimprisonment. §§924(c)(1)(A)(i), (c)(1)(D)(ii). Before the\nFirst Step Act, §924(c) also contained a recidivism enhance-\nment that required imposition of an additional 25 years of\nimprisonment (on top of the 5-year mandatory minimum)\nfor any “second or subsequent conviction under this subsec-\ntion.” §924(c)(1)(C)(i) (2006 ed.).\n   In Deal v. United States, 508 U. S. 129 (1993), this Court\ninterpreted that recidivism-related language to require an\nenhanced penalty for each and every §924(c) count of con-\nviction beyond a defendant’s first—even if those convictions\nwere part of the same criminal prosecution. Id., at 132–\n137. As a result, a first-time offender convicted of two\n§924(c) counts would receive a mandatory 25-year sentence\non the second count, “stacked” upon (i.e., running consecu-\ntively to) the first count’s mandatory 5-year sentence, for a\ntotal of 30 years of imprisonment.1 And each additional\n§924(c) count would add another 25 years to that defend-\nant’s total term of incarceration. See id., at 131–132. Un-\nder this “stacking” interpretation of §924(c)’s recidivism en-\nhancement, sentences for §924(c) offenses ballooned rapidly\nto span decades or even centuries.\n\n——————\n  1 When this Court decided Deal in 1993, the enhanced mandatory min-\n\nimum penalty under §924(c) was 20 years. See 18 U. S. C. §924(c) (1988\ned.). Congress increased the mandatory minimum to 25 years in 1998.\nSee §924(c) (1994 ed., Supp. IV); 112 Stat. 3469.\n\f                  Cite as: 606 U. S. ____ (2025)             3\n\n                      Opinion of the Court\n\n  On December 21, 2018, a supermajority of Congress en-\nacted the First Step Act, a landmark piece of legislation\nthat changed the federal criminal-sentencing system in nu-\nmerous respects. See 132 Stat. 5194. Among other things,\n§403(a) of the First Step Act “clarif[ied]” that district court\njudges are not required to impose stacked 25-year sentences\nwhen sentencing first-time §924(c) offenders. Id., at 5221–\n5222 (capitalization deleted). Abrogating this Court’s deci-\nsion in Deal, the statute established instead that, for first-\ntime offenders, 5-year mandatory minimums apply to each\ncount of conviction.\n  The First Step Act also addressed the potential for retro-\nactive application of this penalty reduction, by specifically\nidentifying the §924(c) offenders to whom the Act applied.\nOrdinarily, because judges impose sentences based on the\nstatutory penalties that exist at the time defendants com-\nmit their offenses, 1 U. S. C. §109, statutory changes to fed-\neral penalties only benefit future offenders. But Congress\naltered this default no-retroactivity rule in the Act itself.\nSection 403(b)—titled “APPLICABILITY TO PENDING\nCASES”—made §403(a)’s reduced penalties applicable to\ncertain existing §924(c) offenders, as follows:\n    “This section, and the amendments made by this sec-\n    tion, shall apply to any offense that was committed be-\n    fore the date of enactment of this Act, if a sentence for\n    the offense has not been imposed as of such date of en-\n    actment.” §403(b), 132 Stat. 5222.\n                              II\n  In 2009, petitioners Tony Hewitt, Corey Duffey, and Jar-\nvis Ross were convicted of multiple counts of bank robbery\nand conspiracy to commit bank robbery, along with corre-\nsponding §924(c) offenses for use of a firearm during a crime\nof violence. Each petitioner received a mandatory 5-year\nsentence as to their first §924(c) count of conviction. And,\ndespite being first-time offenders, each received 25-year\n\f4                    HEWITT v. UNITED STATES\n\n                          Opinion of the Court\n\nmandatory sentences on every §924(c) count beyond their\nfirst. Thus, in total, each petitioner’s sentence exceeded 325\nyears. Roughly 25 of those years were due to the robbery\noffenses themselves, while the rest were attributable to\nstacked §924(c) counts.\n   Petitioners successfully challenged some of their convic-\ntions on direct appeal, and the Fifth Circuit accordingly va-\ncated petitioners’ sentences.2 In 2012, the District Court\nresentenced each petitioner to between 285 and 305 years\non the counts that remained—sentences that the Fifth Cir-\ncuit affirmed on direct review. Petitioners also filed post-\nconviction motions under 28 U. S. C. §2255, which were\neach denied.\n   After Congress passed the First Step Act in 2018, this\nCourt held that the “crime of violence” definition the Gov-\nernment routinely used to support some §924(c) convictions\nwas unconstitutionally vague. See United States v. Davis,\n588 U. S. 445, 470 (2019). Because that holding potentially\naffected some of petitioners’ remaining convictions, the\nFifth Circuit granted petitioners authorization to file a sec-\nond or successive postconviction motion under 28 U. S. C.\n§2255. The District Court then vacated the impacted\n§924(c) convictions, as well as petitioners’ sentences.\n   When the District Court held resentencings for the re-\nmaining convictions, petitioners argued that the First Step\nAct’s 5-year—not 25-year—mandatory minimum penalties\napplied. Petitioners argued that they were entitled to ret-\nroactive application of the First Step Act’s more lenient\npenalties because a vacated prior sentence is not a sentence\nthat “has . . . been imposed” for purposes of §403(b).3 The\n——————\n  2 Petitioners were initially convicted of attempted bank robbery, too.\n\nThose convictions—along with the corresponding §924(c) counts—were\nvacated following petitioners’ successful challenges on direct appeal. See\nUnited States v. Duffey, 456 Fed. Appx. 434, 444–445 (CA5 2012).\n  3 During Duffey’s and Ross’s resentencings before the District Court,\n\nthe Government maintained that petitioners were ineligible for First\n\f                     Cite as: 606 U. S. ____ (2025)                     5\n\n                          Opinion of the Court\n\nDistrict Court disagreed and resentenced petitioners under\nthe pre-Act sentencing scheme, giving them stacked 25-\nyear mandatory minimum sentences for each §924(c) count\nof conviction beyond their first. Petitioners thus each re-\nceived sentences of 130 years or more—105 years of which\nwere attributable to stacked §924(c) penalties.\n   On appeal, petitioners and the Government agreed that\nthe First Step Act should have applied at petitioners’ resen-\ntencings. The parties thus jointly requested vacatur of pe-\ntitioners’ sentences, which the Fifth Circuit denied. 92\nF. 4th 304, 310 (2024) (case below). In that court’s view,\n§403(b) applies only “to defendants for whom ‘a sentence . . .\nha[d] not been imposed’ as of the enactment date.” Ibid.\n(alteration in original). Because each petitioner had been\nsentenced (twice) prior to the Act’s enactment, the panel\nconcluded that petitioners were not eligible for the First\nStep Act’s more lenient mandatory minimums.\n   We granted certiorari to decide whether §403(b) of the\nFirst Step Act confers the benefit of the Act’s more lenient\npenalties to defendants facing post-Act resentencing follow-\ning vacatur of their pre-Act sentence. 603 U. S. ___ (2024).4\nBecause the United States agrees with petitioners on the\n——————\nStep Act relief. But, by the time of Hewitt’s resentencing, the Govern-\nment had changed its position; it supported Hewitt’s request for resen-\ntencing under the Act.\n   4 The Courts of Appeals have divided over whether offenders who were\n\nsentenced pre-Act, but whose sentences were later vacated, are eligible\nto receive First Step Act benefits at their post-Act resentencing. Com-\npare United States v. Merrell, 37 F. 4th 571, 577–578 (CA9 2022) (hold-\ning that, under §403(b), such an offender benefits from the Act at resen-\ntencing), and United States v. Mitchell, 38 F. 4th 382, 386–389 (CA3\n2022) (same), with United States v. Jackson, 995 F. 3d 522, 525–526\n(CA6 2021) (holding that such an offender does not benefit from the Act\nat resentencing, if the prior sentence was vacated after the Act’s enact-\nment); see also United States v. Uriarte, 975 F. 3d 596, 601–602, and n. 3\n(CA7 2020) (en banc) (holding that such an offender benefits from the Act\nif his sentence was vacated prior to the Act’s enactment date, but reserv-\ning judgment as to postenactment vacatur).\n\f6                 HEWITT v. UNITED STATES\n\n                      Opinion of the Court\n\nmerits of their appeals, the Court appointed Michael H.\nMcGinley as amicus curiae to defend the judgment below.\n603 U. S. ___ (2024). He has ably discharged his responsi-\nbilities.\n                              III\n  The Fifth Circuit held, and amicus and the dissent con-\ntend, that §403(b) excludes any defendant who was sen-\ntenced prior to the enactment date of the First Step Act—\neven if his sentence was later vacated. That is so, in their\nview, because the Act applies only “if a sentence for the of-\nfense has not been imposed as of ” the Act’s enactment date,\nand a sentence “has . . . been imposed” upon that defendant\nas a matter of historical fact. 132 Stat. 5222 (emphasis\nadded). But based on the text of §403(b) and the nature of\nvacatur, we conclude that a sentence has been imposed for\npurposes of that provision if, and only if, the sentence is ex-\ntant—i.e., has not been vacated.\n                              A\n   To understand why this is so, focus first on the language\nCongress used. Most notably, the operative phrase is not\nwritten in the past-perfect tense, excluding anyone upon\nwhom a sentence “had” been imposed. Rather, Congress\nemployed the present-perfect tense—thereby requiring\nevaluation of whether “a sentence . . . has . . . been imposed”\nupon the defendant. §403(b), 132 Stat. 5222 (emphasis\nadded). In this context, that distinction makes a difference.\nSee United States v. Wilson, 503 U. S. 329, 333 (1992)\n(“Congress’ use of a verb tense is significant in construing\nstatutes”).\n   The present-perfect tense can refer to either (1) “an act,\nstate, or condition that is now completed” or (2) “a past ac-\ntion that comes up to and touches the present.” The Chicago\nManual of Style §5.132, p. 268 (17th ed. 2017) (emphasis\n\f                      Cite as: 606 U. S. ____ (2025)                       7\n\n                           Opinion of the Court\n\nadded). But when used in either sense, the tense simulta-\nneously “involves reference to both past and present.” R.\nHuddleston & G. Pullum, The Cambridge Grammar of the\nEnglish Language 143 (2002). That is, while “the primary\nfocus is on the present,” the past maintains “ ‘current rele-\nvance.’ ” Ibid. (confirming that the present-perfect tense ad-\ndresses “a time-span beginning in the past and extending\nup to now”).5 Thus, one might employ the present-perfect\ntense to describe situations “involv[ing] a specific change of\nstate” that produces a “continuing result.” Id., at 145 (bold-\nface deleted).\n  Here is an example. Suppose the U. S. Olympic Commit-\ntee enacted a rule stating that athletes may call themselves\nOlympic champions if a gold medal “has been awarded” to\nthem. Pursuant to that rule, a U. S. sprinter who took first\nplace in the 2016 Summer Olympics’ 100-meter finals could\nvalidly proclaim—today—that she is “an Olympic cham-\npion.” The existence of her win as a historical event triggers\nthe rule’s proper application, because it gives rise to the in-\nference that the athlete remains an Olympic gold medalist\nat present, thereby justifying her continued use of the\n“Olympic champion” title. See ibid. (explaining that the rel-\nevant “connection with the present” here would be “that the\nresultant state still obtains now”).\n  But now imagine that the Olympic Committee stripped\nthis sprinter of her medal after discovering that she used\n——————\n   5 A primary flaw of the dissent’s textual argument is its failure to ap-\n\npreciate that, under either meaning of the present perfect, the event in\nquestion must relate to now. In other words, while the dissent accurately\nobserves that the present-perfect tense can be used in one of two ways,\nsee post, at 4 (opinion of ALITO, J.), it ignores that neither refers to cir-\ncumstances that are wholly in the past. What makes this the present-\nperfect tense is that, in each of its manifestations, there exists a connec-\ntion to the present. See Huddleston, Cambridge Grammar of the English\nLanguage, at 143 (confirming that references “to times wholly before\nnow”—when the present “is explicitly or implicitly excluded”—are\nlargely “incompatible with the present perfect”).\n\f8                    HEWITT v. UNITED STATES\n\n                          Opinion of the Court\n\nperformance-enhancing drugs during the competition. Can\nthat athlete, under the rule, still call herself an Olympic\nchampion? The answer is no. Yes, she had been awarded\nsuch a medal, but it was revoked; the fact that she stood on\nthe podium and was declared the winner in 2016 is inappo-\nsite for purposes of establishing whether she qualifies for\nOlympic-champion bragging rights under the rule today.6\n   When used in this way, the present-perfect tense conveys\nto a listener that the event in question continues to be true\nor valid. The dissent counters that, for purposes of the First\nStep Act, the relevant moment of analysis should not be the\npresent, but rather the statute’s date of enactment. See\npost, at 4–5. But that reframing is inconsistent with nor-\nmal understandings of the present-perfect tense, which by\ndefinition focuses on the present.7 Today, if an event is\nmerely a relic of history because it was voided by a subse-\nquent action, the past-perfect (not the present-perfect)\ntense would usually be the more appropriate verb choice.\nSee B. Garner, Modern English Usage 1082 (5th ed. 2022)\n\n——————\n   6 The dissent does not dispute that a sprinter who is divested of her\n\ngold medal no longer qualifies as an “Olympic champion” under the hy-\npothetical rule. Nor does the dissent contest that, if the Committee\nwanted such a disqualified sprinter to be able to still claim the title, it\ncould phrase the rule in the past-perfect tense to accomplish that result\n(i.e., bestowing the honorific if a gold medal “had been awarded” to the\nathlete). The dissent’s primary response to this hypothetical is, instead,\nto zero in on “[t]he obvious purpose of the hypothetical rule” and to ex-\nplain that “the meaning of language is heavily dependent on context.”\nPost, at 10, n. 3. Part IV of this opinion fully addresses the context of\n§403(b)’s language and Congress’s primary objectives for enacting that\nprovision—both of which support the Court’s conclusion in this case.\n   7 And, notably, there is a relevant connection to the present in the op-\n\neration of §403(b) despite that statute’s express reference to the date of\nthe Act’s enactment: the current occasion of the sentencing of the defend-\nant in question. Sentencing courts read statutes at the moment of their\napplication—which, here, would be the moment of resentencing, not the\nmoment of enactment. From that proper vantage point, petitioners were\nnot subject to a sentence, as any previous sentence had been vacated.\n\f                  Cite as: 606 U. S. ____ (2025)            9\n\n                      Opinion of the Court\n\n(explaining that the past-perfect tense “represents an ac-\ntion as completed at some definite time in the past—that is,\nbefore some other past time referred to”); Chicago Manual\nof Style §5.133, at 268 (confirming that the past perfect “re-\nfers to an act, state, or condition that was completed before\nanother specified or implicit past time or past action”). Our\ndisqualified sprinter could thus still boast of her Olympic-\nchampion status if the rule were, instead, that any athlete\nwho “had been awarded” a gold medal was entitled to use\nthat honorific.\n    The fact that adjacent provisions of §403 contain past-\ntense verbs only strengthens the conclusion that §403(b)’s\nuse of the present-perfect tense is meaningful. Cf. Barrett\nv. United States, 423 U. S. 212, 217 (1976) (emphasizing\nwhen Congress “used the present perfect tense . . . in con-\ntrast to its use of the present tense” elsewhere in the stat-\nute). Section 404(c), for example, utilizes the simple past\ntense to address a defendant’s prior sentencing. See 132\nStat. 5222 (“No court shall entertain a motion made under\nthis section to reduce a sentence if the sentence was previ-\nously imposed or previously reduced in accordance with”\nthe relevant amendments (emphasis added)). The past\ntense also features earlier in §403(b) itself. See ibid. (cov-\nering “any offense that was committed before the date of\nenactment of [the] Act” (emphasis added)). But the verb\ntense at issue here (“has been”) is conspicuously different—\nmaking only clearer that a past sentence must have a rele-\nvant connection to the present for purposes of the retroac-\ntivity provision.\n    Indeed, amicus and the dissent’s historical-fact reading\nof §403(b) calls so naturally for the past-perfect tense that\njurists who share this view often employ that tense by de-\nfault. The Fifth Circuit below, for instance, stated that “the\nFirst Step Act applies to defendants for whom ‘a sentence\n. . . ha[d] not been imposed’ as of the enactment date.” 92\nF. 4th, at 310 (alteration in original). Other courts have\n\f10                HEWITT v. UNITED STATES\n\n                       Opinion of the Court\n\nconstrued §403(b) similarly. See, e.g., United States v.\nJackson, 995 F. 3d 522, 525 (CA6 2021) (noting that “as of\nDecember 21, 2018, a sentence had been imposed” upon the\ndefendant, even though it was later vacated). Congress of\ncourse “could have phrased its requirement in language\nthat looked to the past . . . , but it did not choose this readily\navailable option.” Gwaltney of Smithfield, Ltd. v. Chesa-\npeake Bay Foundation, Inc., 484 U. S. 49, 57 (1987). The\nnatural inference, then, is that Congress meant what it\nsaid, and, thus, that §403(b) covers only past sentences with\ncontinued legal validity, not those that have been vacated.\n                                B\n   Background principles regarding the legal effect of vaca-\ntur confirm that a sentence has been imposed for §403(b)\npurposes only so long as it remains valid. When interpret-\ning statutes, we “recogniz[e] that ‘Congress legislates\nagainst the backdrop,’ of certain unexpressed presump-\ntions.” Bond v. United States, 572 U. S. 844, 857 (2014)\n(quoting EEOC v. Arabian American Oil Co., 499 U. S. 244,\n248 (1991)). One such presumption is that vacated court\norders are void ab initio and thus lack any prospective legal\neffect. See United States v. Ayres, 9 Wall. 608, 610 (1870)\n(“[V]acating the former judgment . . . render[s] it null and\nvoid, and the parties are left in the same situation as if no\ntrial had ever taken place in the cause”). By operation of\nlegal fiction, the law acts as though the vacated order never\noccurred.\n   A criminal defendant whose judgment of conviction has\nbeen vacated, for example, is to be treated going forward as\nthough he were never convicted. See Fiswick v. United\nStates, 329 U. S. 211, 223 (1946) (confirming that one whose\nconviction is vacated “stand[s] in the position of any [per-\nson] who has been accused of a crime but not yet shown to\nhave committed it”). Thus, if Congress were to pass a stim-\nulus provision that gives checks to any small-business\n\f                      Cite as: 606 U. S. ____ (2025)                     11\n\n                           Opinion of the Court\n\nowner who “has not been convicted of fraud,” an owner\nwould not be rendered ineligible on the basis of a fraud con-\nviction that was overturned on appeal. While the owner\nhad been convicted of fraud, that judgment was invalidated\nand therefore became legally inoperable. In other words,\nthat vacated conviction is subsequently treated as no con-\nviction at all. See North Carolina v. Pearce, 395 U. S. 711,\n721 (1969) (verifying that vacatur causes a conviction to be\n“wholly nullified and the slate wiped clean”).8\n  Section 403(b) reflects this “common-sense” understand-\ning of background vacatur principles. Lewis v. United\nStates, 445 U. S. 55, 61, n. 5 (1980). Just as defendants\nwith vacated prior felony convictions are not precluded from\npossessing weapons under the federal felon-in-possession\nban, §403(b) retroactivity does not exclude from its ambit\nthose whose prior sentences have been vacated. See ibid.;\n18 U. S. C. §922(g)(1); see also Pepper v. United States, 562\nU. S. 476, 507 (2011) (explaining that vacatur of a criminal\nsentence “wipe[s] the slate clean”).\n  By authorizing retroactive application of the First Step\n——————\n  8 The dissent erroneously suggests that, under our precedents, a va-\n\ncated sentence continues to exist as a historical fact and thus retains\nprospective legal effect. See post, at 12–14. But the cases it cites do not\nsupport that contention. In Lewis v. United States, 445 U. S. 55 (1980),\nfor example, we considered whether the invalidity of one’s predicate fel-\nony conviction precludes conviction as a felon in possession of a weapon\nunder federal law. Id., at 58. We concluded the federal conviction could\nstand when the defendant’s prior felony conviction had “never been over-\nturned”—i.e., vacated—at the time he possessed the weapon. Id., at 57.\nBut we dismissed as “extreme” arguments suggesting that a vacated con-\nviction could have such prospective legal effect. Id., at 61, n. 5 (confirm-\ning the “common-sense” notion that “a disability based upon one’s status\nas a convicted felon” ceases as a matter of law as soon as “the conviction\nupon which that status depends has been vacated”). Bravo-Fernandez v.\nUnited States, 580 U. S. 5 (2016), is similarly unhelpful. That case con-\ncerned issue preclusion and jury findings and does not stand for the prop-\nosition that a vacated order itself retains continuing legal effect in the\nrelevant sense.\n\f12                  HEWITT v. UNITED STATES\n\n                         Opinion of JACKSON, J.\n\nAct’s more lenient penalties on any eligible offender upon\nwhom “a sentence . . . has not been imposed,” the text of\n§403(b) indicates that only past sentences with continued\nvalidity preclude application of the Act’s new penalties. A\njudge would thus correctly conclude at resentencing that, if\nan offender’s past sentence has been vacated, a sentence\n“has not been imposed” upon that offender for purposes of\nthe First Step Act; hence, the court can impose a new sen-\ntence today.\n                             IV\n                              A\n  The context and enactment history of the First Step Act\nand §403(b) further demonstrate that Congress’s choice of\nthe present-perfect tense was not accidental. Rather, Con-\ngress was reacting to sustained criticism of the prior sen-\ntencing scheme, and with §403(b), it intended to execute a\nclean break from the controversial and heavily contested\n“stacking” practice.\n  Sentencing judges had been among the harshest critics.\nBefore the First Step Act was enacted, more than one vet-\neran District Court Judge decried how the “stacking” pun-\nishment for first-time §924(c) offenders was “grossly dispro-\nportionate” and “shockingly harsh given the nature” of the\noffenses and a defendant’s “lack of criminal history.”\nUnited States v. Washington, 301 F. Supp. 2d 1306, 1309\n(MD Ala. 2004) (lamenting the requirement of a 40-year\nterm of imprisonment for a 22-year-old first-time offender,\nand remarking that it was “the worst and most unconscion-\nable sentence [the judge] ha[d] given in his 23 years on the\nfederal bench”).9 Judges on the Federal Courts of Appeals\n——————\n  9 See also, e.g., United States v. Holloway, 68 F. Supp. 3d 310, 312\n\n(EDNY 2014) (noting that §924(c) stacking “produce[d] sentences that\nwould be laughable if only there weren’t real people on the receiving end\nof them”); United States v. Angelos, 345 F. Supp. 2d 1227, 1244–1245,\n1248 (Utah 2004) (assailing being required to give a 24-year-old who had\n\f                     Cite as: 606 U. S. ____ (2025)                    13\n\n                         Opinion of JACKSON, J.\n\nalso “join[ed] in the litany of criticisms directed towards”\n§924(c)’s penalty regime for requiring the imposition of sen-\ntences that were “ ‘out of this world.’ ” United States v.\nHunter, 770 F. 3d 740, 746–747 (CA8 2014) (Bright, J., con-\ncurring); see also United States v. Hungerford, 465 F. 3d\n1113, 1118–1119 (CA9 2006) (Reinhardt, J., concurring in\njudgment) (deeming “irrational, inhumane, and absurd” the\nmandatory 159-year sentence imposed upon “a 52 year-old\nmentally disturbed woman with no prior criminal record”\nwho had otherwise “led a spotless, law-abiding existence”);\nUnited States v. Smith, 756 F. 3d 1179, 1181 (CA10 2014)\n(Gorsuch, J.) (observing that it was “no fanciful possibility”\nthat §924(c) stacking would lead to “prison term[s] of many\ndecades” that were “certain to outlast the defendant’s life\nand the lives of every person now walking the planet”).\n  Meanwhile, other institutional stakeholders raised simi-\nlarly pointed objections to Deal’s stacking system. In its\nannual report to Congress, the United States Sentencing\nCommission criticized how §924(c) stacking had “result[ed]\nin excessively severe and unjust sentences,” particularly in\ncases in which “the offense did not involve any physical\nharm or threat of physical harm to a person.” U. S. Sen-\ntencing Commission, Report to the Congress: Mandatory\nMinimum Penalties in the Federal Criminal Justice System\n359 (Oct. 2011). The United States Judicial Conference ex-\npressed similar concerns.10\n\n——————\npossessed weapons while dealing small amounts of marijuana “more\nthan doubl[e]” the sentence recommended for crimes resulting in “actual\nviolence to victims,” such as “hijack[ing]” an airplane, “detonat[ing] a\nbomb in a public place,” or committing “rap[e]” or “second-degree\nmurde[r]”).\n   10 See, e.g., Hearing before the Over-Criminalization Task Force of\n\n2014 of the House Committee on the Judiciary, 113th Cong., 2d Sess., 41\n(2014) (testimony of the Hon. Irene Keeley, U. S. District Judge, Judicial\nConference of the U. S.) (explaining that §924(c) stacking produced “par-\nticularly egregious” sentences for first-time offenders that ran “contrary\n\f14                   HEWITT v. UNITED STATES\n\n                         Opinion of JACKSON, J.\n\n   The problem, as all seemed to recognize, was not that fed-\neral law permitted judges to impose lengthy sentences with\nrespect to first-time §924(c) offenders—it was that the stat-\nute, as Deal had interpreted it, required it. District judges\ncould not adhere to the statutory command that they give\nsentences that are “sufficient, but not greater than neces-\nsary, to comply with the purposes” of punishment, 18\nU. S. C. §3553(a), if they were also required to sentence\nfirst-time offenders to §924(c)’s unduly harsh mandatory\nminimum penalties. Additionally problematic was the fact\nthat, while federal law requires sentencing judges to “avoid\nunwarranted sentence disparities among defendants,”\n§3553(a)(6), the variation among prosecutors’ charging\npractices meant that §924(c) stacking was a reality for only\nsome first-time offenders.11\n   With sentencing judges routinely imposing what\namounted to mandatory life sentences on first-time §924(c)\noffenders, in 2018, Congress eventually heeded the public\n——————\nto the interests of justice” and “undermine[d] confidence” in its admin-\nistration).\n   11 The policies of U. S. Attorney’s Offices diverged as to when—or\n\nwhether—they would bring multiple §924(c) counts, a decision over\nwhich judges lack any control. See id., at 45 (testimony of the Hon. Patti\nSaris, Chair, U. S. Sentencing Commission). This produced disparate\nsentencing outcomes for similarly situated offenders across judicial dis-\ntricts. See U. S. Sentencing Commission, Report to the Congress: Man-\ndatory Minimum Penalties in the Federal Criminal Justice System 361–\n362 (Oct. 2011) (attributing the “geographic concentration” associated\nwith §924(c) sentencing “to inconsistencies in the charging of multiple\nviolations of section 924(c)”); see also In re Hernandez, 857 F. 3d 1162,\n1169 (CA11 2017) (Martin, J., concurring in result) (finding “troubling”\nthat the defendant “might never have received this [stacked] sentence if\nhe had been sentenced in another part of the country”). In one case in\nwhich prosecutors stacked additional §924(c) counts after the defendant\nrefused a plea offer, the District Judge specifically lamented the “risk of\nmassive sentencing disparity between identically-situated offenders\nwithin the federal system,” because other U. S. Attorney’s Offices might\nnot have proceeded in that same fashion. United States v. Angelos, 345\nF. Supp. 2d 1227, 1253–1254 (Utah 2004).\n\f                      Cite as: 606 U. S. ____ (2025)                    15\n\n                         Opinion of JACKSON, J.\n\noutcry. An “extraordinary political coalition” formed, as\nmembers of Congress worked together to develop “a bipar-\ntisan sentencing and prison reform bill” to address §924(c)\nstacking. 164 Cong. Rec. S7645 (Dec. 17, 2018) (statement\nof Sen. Durbin); see also Brief for Sen. Richard J. Durbin\net al. as Amici Curiae 5–8 (Senators Brief ). The First Step\nAct was the much-anticipated, much-heralded fruit of their\nlabor—and one that many in Congress hoped would yield\nimmediate benefits. See id., at 17.12\n                              B\n   It is noteworthy for present purposes that the statute\nCongress crafted to depart from the much-maligned “stack-\ning” sentencing regime did so in a two-part fashion. First,\n§403(a) eliminated 25-year stacked sentences for first-time\n§924(c) offenders. Second, §403(b) addressed the retroac-\ntivity of the §403(a) benefit in a “ ‘targeted way,’ ” so as to\nensure that judges were no longer constrained to impose 25-\nyear stacked sentences on first-time §924(c) offenders mov-\ning forward. Id., at 15 (quoting 164 Cong. Rec., at S7645\n(statement of Sen. Durbin)).\n   That second part of Congress’s response—the focus of the\ncases before us today—was highly consequential. By dis-\nplacing the background rule that changes to sentencing\nstatutes apply only prospectively (to defendants who com-\nmit their offenses after the law’s effective date), Congress\nmade clear that the First Step Act’s more lenient penalties\nwere to apply to some “ ‘pending’ ” cases, too—i.e., the new\npenalties would be applicable to certain defendants who\nhad committed their offenses before the First Step Act.\n——————\n   12 The dissent agrees that our job is to “interpret what Congress meant”\n\nby the words in §403(b). Post, at 4. Here, Congress’s desire to change\nthe derided, draconian sentencing stacking scheme Deal had created\ncould not be clearer. Thus, far from “march[ing] in the parade of sen-\ntencing reform,” post, at 2, we are merely observing the events and cir-\ncumstances that led Congress to take up the banner of sentencing reform\nitself.\n\f16                HEWITT v. UNITED STATES\n\n                     Opinion of JACKSON, J.\n\nSenators Brief 15 (quoting §403(b), 132 Stat. 5222). Per\n§403(b), any defendant who still needed to be sentenced as\nof the First Step Act’s effective date would receive the Act’s\nmore lenient penalties. Thus, as a practical matter, judges\nwould no longer have to impose harsh “stacked” sentences\nupon first-time §924(c) offenders.\n   Notably, because §403(b) retroactivity was only partial, it\ndiffered substantially from the full retroactivity Congress\nemployed with respect to other kinds of penalty changes it\ninstituted in the First Step Act. See, e.g., §404(b), 132 Stat.\n5222; Terry v. United States, 593 U. S. 486, 491 (2021) (ex-\nplaining that Congress made the First Step Act’s statutory\nchanges to the crack-cocaine minimums fully retroactive,\nand thus “gave courts authority to reduce the sentences” of\npreviously sentenced crack offenders, where applicable).\nCongress certainly had the full-retroactivity option before\nit when it crafted §403; indeed, earlier versions of the Act\nwould have extended §403(a) benefits to at least some\n§924(c) offenders who were already sentenced. See, e.g.,\nSentencing Reform Act of 2015, H. R. 3713, 114th Cong., 2d\nSess., §5(b)(2), pp. 14–16 (2016) (providing for reduced\nterms of imprisonment in “certain past cases” (capitaliza-\ntion and italics deleted)); Sentencing Reform and Correc-\ntions Act of 2017, S. 1917, 115th Cong., 1st Sess., §104(b)(2),\npp. 13–15 (2017) (permitting “sentence reduction” for cer-\ntain “past cases” (capitalization deleted)). But authorizing\nthe reopening of closed cases upends finality and can also\nbe administratively burdensome. See Senators Brief 15\n(noting that Congress forwent full retroactivity to serve “ju-\ndicial economy” and “preserv[e] sentences that were actu-\nally valid and final”). Section 403’s partial retroactivity\navoided these problems, while still advancing Congress’s\naim of changing how first-time §924(c) defendants are sen-\ntenced.\n   In short, §403(b)—a middle-ground solution to the prob-\n\f                  Cite as: 606 U. S. ____ (2025)            17\n\n                     Opinion of JACKSON, J.\n\nlem of harsh “stacked” sentences for first-time §924(c) of-\nfenders—reflected a balance of Congress’s policy objectives.\nBy leaving intact §924(c) sentences that judges had already\nimposed, Congress reinforced its interest in finality and\navoided burdening district courts with additional litigation.\nBut it also substantially advanced its goal of returning a\nsignificant amount of sentencing discretion to district court\njudges moving forward, by giving retroactive effect to the\nAct’s more lenient penalties for those first-time §924(c) of-\nfenders who had yet to be sentenced.\n                                V\n   The reading of §403(b) that petitioners and the Govern-\nment promote thus coheres with the text, context, and his-\ntory of that provision. Under this view, First Step Act sen-\ntencing benefits apply to all first-time §924(c) offenders\nsentenced after the Act’s enactment date (whether it is an\ninitial sentencing or a resentencing). This means that\n§403(b)’s retroactivity line falls between those past §924(c)\noffenders with final sentences that are still in effect, on the\none hand, and those who still need to be sentenced for their\n§924(c) offense, on the other. The former are stuck with\ntheir old sentences, for finality reasons, while the latter are\neligible for First Step Act benefits at resentencing, since\nthey have to be sentenced regardless.\n   Under amicus and the dissent’s reading, however, there\nexists a further line of division within the group of offenders\nwho currently lack a sentence—separating those who have\nbeen sentenced previously for the §924(c) offense at issue\nfrom those who have not. For individuals in the former\ncamp, per amicus and the dissent, a judge must return to\nthe superseded sentencing scheme and impose stacked 25-\nyear sentences when such defendants are resentenced.\n   Carving up the yet-to-be-sentenced group of offenders in\nthis way does not reflect Congress’s intent. See Senators\nBrief 17 (a bipartisan group of Senators, explaining that\n\f18               HEWITT v. UNITED STATES\n\n                    Opinion of JACKSON, J.\n\n“[t]he considerations animating the First Step Act’s enact-\nment undermine any suggestion that Congress intention-\nally excluded from Section 403’s reach pre-Act offenders\nwhose sentences are invalid as a matter of law”). Nor does\nit comport with the statutory scheme that Congress en-\nacted, for two primary reasons.\n   First, the text and context of §403(b) do not support dif-\nferentiating between §924(c) offenders on the mere basis of\nthe historical fact of a past sentencing (as we explained in\nPart III, supra), and, frankly, it is not clear what distin-\nguishing between previously sentenced and never-before-\nsentenced offenders would accomplish. The prior imposi-\ntion of a sentence does not bear on finality; if the offender\ncurrently lacks a sentence, then a court will have to resen-\ntence the defendant in any event. And though it would\nmake sense to draw the line as amicus and the dissent do if\nthe prior imposition of a sentence helped judges to more ac-\ncurately identify serious first-time §924(c) offenders—po-\ntentially justifying the harsh and outdated stacked penal-\nties that the First Step Act supplanted—nothing in the\nlegislative record suggests this is so. Stated simply: The\ndistinction between previously sentenced defendants and\nthose who have never been sentenced before seems to make\nno difference in terms of the retroactivity aims of the stat-\nute.\n   By contrast, requiring judges to impose Deal-era stacked\n§924(c) sentences at resentencings runs headlong into the\nanimating aims of the First Step Act. See Miller v. French,\n530 U. S. 327, 341 (2000) (rejecting an interpretation that\nwould undermine the statute and run “plainly contrary to\nCongress’ intent in enacting” it). Neither amicus nor the\ndissent can explain why Congress would have wanted sen-\ntencing judges, who are presently working to dole out pro-\nportionate plenary sentences under the new regime, to have\nto return to the draconian, pre-Act scheme for offenders\nwho just happen to be facing resentencing, as opposed to\n\f                  Cite as: 606 U. S. ____ (2025)           19\n\n                      Opinion of the Court\n\nfirst sentencing. Requiring that kind of reversion prevents\njudges from uniformly moving past Deal, which was the pri-\nmary point of Congress’s enactment of §403.\n   Second, the reading of §403(b) that we adopt today is\nplainly more administrable than the one amicus and the\ndissent offer. Amicus argues that his interpretation is easy\nto apply, because a district judge only needs to know\nwhether a prior sentence had ever been imposed upon the\ndefendant for the relevant offense. But that knowledge is\nnot enough—the sentencing judge would still need to refer-\nence, recall, and apply the superseded “stacking” regime, if\napplicable. And there is a much more straightforward way\nto administer §403(b): From the Act’s enactment date on-\nward, sentencing judges impose the First Step Act’s less-\nened mandatory minimums for any first-time §924(c) of-\nfender—full stop. This reading of §403(b) requires no\nadditional effort on the part of the judge to track down a\ndefendant’s sentencing history or to confirm what manda-\ntory minimums previously governed. And it allows district\njudges to treat all first-time §924(c) defendants who appear\nbefore them for sentencing in an equitable manner that\nminimizes sentencing disparities, consistent with Con-\ngress’s sentencing directives.\n                         *    *    *\n   Under the interpretation of §403(b) we adopt today, all\nfirst-time §924(c) offenders who appear for sentencing after\nthe First Step Act’s enactment date—including those whose\nprevious §924(c) sentences have been vacated and who thus\nneed to be resentenced—are subject to the Act’s revised\npenalties. The Fifth Circuit’s contrary reading of §403(b) is\nreversed, and its judgment in these cases is remanded for\nfurther proceedings.\n                                             It is so ordered.\n\f                  Cite as: 606 U. S. ____ (2025)          1\n\n                      ALITO, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n            TONY R. HEWITT, PETITIONER\n23–1002                 v.\n                  UNITED STATES\n\n   COREY DEYON DUFFEY, ET AL., PETITIONERS\n23–1150             v.\n              UNITED STATES\n ON PETITIONS FOR WRITS OF CERTIORARI TO THE UNITED\n   STATES COURT OF APPEALS FOR THE FIFTH CIRCUIT\n        Nos. 23–1002 and 23–1150. Decided June 26, 2025\n\n   JUSTICE ALITO, with whom JUSTICE THOMAS, JUSTICE\nKAVANAUGH, and JUSTICE BARRETT join, dissenting.\n   In the First Step Act of 2018, Congress reduced the\nmandatory-minimum sentence for certain firearm offenses.\nLike all changes to sentencing law, this amendment applies\nprospectively. But Congress also thought it wise to apply\nthe amendment to “Pending Cases.” Of course, “Pending\nCases” does not mean “All Cases,” and Congress limited the\nretroactive reach of the amendment to defendants for whom\n“a sentence for the offense has not been imposed as of [the\nAct’s] date of enactment.” 132 Stat. 5222. In other words,\nthe amendment applies retroactively only if the defendant\nhad yet to be sentenced when Congress passed the Act in\n2018. Petitioners, who were sentenced in 2010, do not come\nclose to meeting that test.\n   Today, the Court disfigures the Act in order to reach a\ndifferent result. Its interpretation relies on two necessary\npremises. First, the Court insists that what Congress re-\nally meant to say is that the amendment applies retroac-\ntively unless “a legally valid sentence” is in force on the\nAct’s date of enactment. Second, to get around the fact that\npetitioners did have “legally valid” sentences when the Act\n\f2                 HEWITT v. UNITED STATES\n\n                       ALITO, J., dissenting\n\nwas passed, the Court invents a novel “vacatur” principle.\nThe Court tells us that the 2022 vacatur of petitioners’ sen-\ntences rendered those sentences legal nullities from their\ninception. The Court’s interpretation thus unspools the\nAct’s carefully wound retroactivity command to mean that\nany defendant whose sentence is vacated at any time and\nfor any reason may claim the benefit of the Act’s reduced\nmandatory minimum. But nothing in the text or broader\ncontext supports such a boundless interpretation. Indeed,\nthe portions of today’s decision that command the votes of\nonly three Justices give the game away. Animating the\nCourt’s atextual interpretation is a thinly veiled desire to\nmarch in the parade of sentencing reform. But our role is\nto interpret the statute before us, not overhaul criminal\nsentencing.\n                               I\n   Sixteen years ago, a jury convicted petitioners Corey\nDuffey, Tony Hewitt, and Jarvis Ross of multiple 18 U. S. C.\n§924(c) offenses for use of a firearm in furtherance of a\ncrime of violence. At the time, first-time §924(c) offenders\nlike petitioners could receive, after a single trial, a 5-year\nmandatory-minimum sentence for an initial §924(c) convic-\ntion and a consecutive 25-year mandatory-minimum sen-\ntence for each “second or subsequent” §924(c) conviction.\nSee §§924(c)(1)(A)(i), (c)(1)(C), (c)(1)(D)(ii) (2012 ed.); Deal\nv. United States, 508 U. S. 129, 137 (1993). In 2010, the\nDistrict Court sentenced petitioners under this so-called\nstacking procedure, and after a remand, the District Court\nresentenced petitioners in 2012. Direct review of their con-\nvictions and sentences was complete by 2015. See United\nStates v. Ross, 544 Fed. Appx. 544, 545 (CA5 2013) (per cu-\nriam) (dismissing Duffey’s appeal because it presented “no\nnonfrivolous issue for appellate review”); United States v.\nRoss, 582 Fed. Appx. 528 (CA5 2014) (per curiam) (affirm-\ning Hewitt’s and Ross’s sentences); Hewitt v. United States,\n\f                  Cite as: 606 U. S. ____ (2025)            3\n\n                      ALITO, J., dissenting\n\n574 U. S. 1201 (2015) (denying Hewitt’s petition for a writ\nof certiorari).\n   Petitioners’ sentences had thus long been final when Con-\ngress enacted the First Step Act on December 21, 2018. The\nAct introduced a bevy of sentencing reforms, including an\namendment that eliminated the practice of §924(c) sentence\nstacking. See 132 Stat. 5221–5222. Although it had previ-\nously considered applying this amendment to all §924(c) of-\nfenders (including those with final sentences), see S. 2123,\n114th Cong., 1st Sess., §104(b)(2) (2015) (reported by Com-\nmittee), Congress settled on a far narrower retroactivity\ncommand:\n      “APPLICABILITY TO PENDING CASES.—This section,\n    and the amendments made by this section, shall apply\n    to any offense that was committed before the date of\n    enactment of this Act, if a sentence for the offense has\n    not been imposed as of such date of enactment.” 132\n    Stat. 5222.\nOn the “date of enactment,” petitioners’ 2012 sentences re-\nmained in full force. As such, petitioners did not move to\nreduce their sentences in the immediate aftermath of the\nAct’s passage.\n  But several strokes of good fortune soon came petitioners’\nway. The year after Congress passed the First Step Act, we\nheld in United States v. Davis, 588 U. S. 445, 448 (2019),\nthat §924(c)’s residual clause is unconstitutionally vague.\nThen, later that same year, the Fifth Circuit determined\nthat Davis should apply retroactively. See United States v.\nReece, 938 F. 3d 630, 635 (2019). Seeking to take advantage\nof these fortuitous developments, petitioners successfully\nmoved to set aside some, though not all, of their §924(c) con-\nvictions that were predicated on the residual clause. Alt-\nhough the District Court could have vacated petitioners’\nsentences for only those invalid §924(c) counts, petitioners\ncaught yet another lucky break. The District Court opted\n\f4                 HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\nto vacate their entire sentences and ordered plenary resen-\ntencing on the remaining counts. Petitioners now try to\npush their luck even further, contending that the District\nCourt should apply the First Step Act’s reduced mandatory\nminimum for their remaining §924(c) counts.\n                                II\n  As all agree, petitioners’ argument requires us to inter-\npret what Congress meant when it said “a sentence for the\noffense has not been imposed as of [the Act’s] date of enact-\nment.” What first jumps out about this provision is that\nCongress used the present-perfect tense in the phrase “has\nnot been imposed.” The present-perfect tense “denotes an\nact, state, or condition that” is either (1) “now completed” or\n(2) “continues up to the present.” The Chicago Manual of\nStyle §5.132, p. 268 (17th ed. 2017).\n  Context often indicates whether a speaker is using the\nformer sense of the present-perfect tense (e.g., “he has been\nawarded a trophy”) or the latter sense of the present-perfect\ntense (e.g., “he has trained for a trophy for the last three\nyears”). See B. Garner, The Chicago Guide to Grammar,\nUsage, and Punctuation 97 (2016). Consider the following\nexample. Suppose I ask a man passing by a courthouse,\n“Has a sentence been imposed on John Smith?” He could\nrespond either, “Yes, on July 1” or “Yes, since July 1.” The\nformer response is perhaps the more natural one, and it as-\nsumes I asked for the historical fact of Smith’s sentencing\nin the indefinite past. The latter response is correct (though\nperhaps awkward), and it assumes I asked about the con-\ntinuing legal validity of Smith’s sentence up to the present.\n  The First Step Act’s “grammatical structure conceivably\nleaves some room for either reading,” United States v. Uri-\narte, 975 F. 3d 596, 607 (CA7 2020) (en banc) (Barrett, J.,\ndissenting), but petitioners lose either way. On one hand,\nthe phrase “a sentence . . . has . . . been imposed as of [the\nAct’s] date of enactment” could refer to the historical fact\n\f                      Cite as: 606 U. S. ____ (2025)                        5\n\n                            ALITO, J., dissenting\n\nthat a district court imposed a sentence before the Act’s pas-\nsage, regardless of whether that sentence remains legally\nvalid in the future. This “historical-fact interpretation”\nplainly forecloses relief for petitioners because, as no one\ndisputes, the District Court first imposed their sentences\nwell before the Act’s passage.1 On the other hand, “a sen-\ntence . . . has . . . been imposed as of [the Act’s] date of en-\nactment” could mean that a defendant was subject to a le-\ngally valid sentence that continued to be in force on the\nAct’s enactment date. But again, petitioners did have le-\ngally valid sentences “as of [the Act’s] date of enactment,”\nso they lose under this “legal-validity interpretation” of the\nAct too.2\n——————\n   1 The Court dismisses the historical-fact interpretation out of hand be-\n\ncause, as it understands English grammar, the present-perfect tense re-\nquires “a connection to the present.” Ante, at 7, n. 5. But before pro-\nnouncing new rules of grammar, the Court might first consider\nconsulting the authorities it cites. See, e.g., R. Huddleston & G. Pullum,\nThe Cambridge Grammar of the English Language 144 (2002) (noting\nthe “present perfect allows for the inclusion, under restrictive conditions,\nof a past time adjunct”). As these authorities suggest, the present-perfect\ntense allows one to say, for example, “[h]e has got up at five o’clock,” ibid.\n(emphasis deleted), or “he has played golf before yesterday.”\n   2 The Act’s requirement that a sentence “has . . . been imposed as of\n\n[the Act’s] date of enactment” provides an essential temporal benchmark\nfor both the historical-fact and the legal-validity interpretation. Re-\nmarkably, however, the Court reads this requirement out of the Act en-\ntirely. The Court insists that sentencing courts should “read” the First\nStep Act at “the moment of resentencing,” without any reference to the\nAct’s enactment date. Ante, at 8, n. 7. But the Court is mistaken. It\nstarts on the right foot, acknowledging the “widely accepted modern leg-\nislative drafting convention that a law should not be read to speak as of\nthe date of enactment.” Carr v. United States, 560 U. S. 438, 463 (2010)\n(ALITO, J., dissenting). This “convention” provides that, “except in unu-\nsual circumstances,” “all laws . . . should be written in the present tense”\nto ensure that a “ ‘legislative provision speaks as of any date on which it\nis read (rather than as of when drafted, enacted, or put into effect).’ ”\nIbid. (quoting Senate Office of the Legislative Counsel, Legislative Draft-\ning Manual §103(a), p. 4 (1997) (emphasis deleted)). But the First Step\nAct is such an “unusual circumstanc[e]” in which Congress deviated from\n\f6                   HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\n   Realizing the Act’s use of the present-perfect tense alone\ncannot help petitioners, the Court invents a novel “vacatur”\nprinciple to supercharge the legal-validity interpretation.\nThe Court tells us that the First Step Act incorporates the\nbackground “presumption” that “vacated court orders are\nvoid ab initio and thus lack any prospective legal effect.”\nAnte, at 10. This revamped version of the legal-validity in-\nterpretation means that “a sentence . . . has . . . been im-\nposed as of [the Act’s] date of enactment” if a defendant re-\nceives a legally valid sentence before the Act’s passage and\nthat sentence is never, at any future time, vacated. Under\nthis view, the 2022 vacatur of petitioners’ 2012 sentences\nimplies that, “[b]y operation of [a] legal fiction,” their 2012\nsentences “never occurred” and so could not have been le-\ngally valid as of the Act’s enactment date. Ibid.\n   The Court’s vacatur-inflected legal-validity interpreta-\ntion thus rests on two necessary premises. First, the legal-\nvalidity interpretation is superior to the historical-fact in-\nterpretation. Second, the Act incorporates the “vacatur”\nprinciple. If either premise falters, so does the Court’s in-\nterpretation. In my view, there is little doubt that both of\nthe necessary premises fail.\n                              III\n                               A\n  To start, the most plausible reading of the retroactivity\nprovision is that “a sentence . . . has . . . been imposed”\nwhen, as a matter of historical fact, a district court has sen-\ntenced a defendant. Subsequent legal changes—such as the\nvacatur of a previously imposed sentence—do not change\nthe purely historical fact that a defendant was, at a point\nin time, actually sentenced. When the Act asks whether a\nsentence “has . . . been imposed,” it refers to the unchanging\n——————\nthis “convention.” The Act takes the unusual steps of referencing the\ndate on which it was “enacted” and employing the present-perfect tense,\nnot the ordinary present tense.\n\f                   Cite as: 606 U. S. ____ (2025)              7\n\n                       ALITO, J., dissenting\n\nhistorical fact of sentencing and whether it occurred before\nthe “date of enactment.”\n   To see why, begin with the word “imposed.” A “sentence\nis imposed” when there is a “pronouncement of judgment.”\nLott v. United States, 367 U. S. 421, 426 (1961); see Young\nv. United States, 943 F. 3d 460, 463 (CADC 2019) (“[I]n or-\ndinary usage a sentence is ‘imposed’ when the district court\npronounces it”). The Sentencing Reform Act treats the “im-\nposition” of a sentence as the moment when a district court\n“state[s] in open court the reasons for . . . the particular sen-\ntence.” 18 U. S. C. §3553(c); Black’s Law Dictionary 1470\n(12th ed. 2024) (defining “pronounce” as “announce for-\nmally”). The word “imposed” is thus most naturally under-\nstood to refer to a concrete “action by a district court” that\noccurs at a specific point in time. Uriarte, 975 F. 3d, at 607\n(Barrett, J., dissenting); see also United States v. Carpen-\nter, 80 F. 4th 790, 791 (CA6 2023) (Kethledge, J., concurring\nin denial of rehearing en banc) (“[T]he act of imposing a sen-\ntence could not possibly ‘continue up to the present’—be-\ncause the imposition of a sentence occurs at a fixed point in\ntime”). A defendant may be sentenced, resentenced, and\nresentenced again, and at each hearing a sentence is “im-\nposed” even if some of those sentences are later set aside as\nlegally invalid.\n   Our cases and other provisions of Title 18 confirm that\nthe word “imposed” marks the historical point at which a\nsentence is pronounced regardless of whether that sentence\nhas continuing legal validity. For example, in the midst of\na discussion about plenary resentencing (a topic of particu-\nlar relevance to these cases), we once noted that “[i]n re-\nmanded cases . . . trial courts have imposed a sentence on\nthe remaining counts longer than the sentence originally\nimposed on those particular counts.” Greenlaw v. United\nStates, 554 U. S. 237, 253 (2008) (emphasis added). In an-\nother case, a joint opinion of the Court noted that the “death\n\f8                 HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\nsentences imposed for armed robbery, however, were va-\ncated.” Gregg v. Georgia, 428 U. S. 153, 161–162 (1976)\n(opinion of Stewart, Powell, and Stevens, JJ.) (emphasis\nadded). In both instances, our use of “imposed” signified\nonly that a court had, at some point in time, pronounced a\nsentence. Our use of “imposed” could not possibly be under-\nstood to refer to the legal validity of those later-invalidated\nsentences. Further, in other parts of Title 18, Congress\nuses “imposed” to signify the historical fact of a sentence,\nnot its continuing legal validity. See, e.g., §3742(a)(2) (al-\nlowing a defendant to appeal “an otherwise final sentence\nif the sentence . . . was imposed as a result of an incorrect\napplication of the sentencing guidelines”); §3742(f )(1) (em-\npowering courts of appeals to remand on a finding that “the\nsentence was imposed in violation of law”). I see no reason\nto think Congress intended a different meaning of “im-\nposed” in another provision of Title 18.\n   Additional support for the historical-fact interpretation is\nfound in Congress’s use of the phrase “a sentence.” The\nword “a” is an “indefinite article” that “points to a non-\nspecific object, thing, or person that is not distinguished\nfrom the other members of a class.” B. Garner, Modern\nEnglish Usage 1195 (5th ed. 2022) (Modern English Usage).\n“When used as an indefinite article, ‘a’ means ‘[s]ome unde-\ntermined or unspecified particular.’ ” McFadden v. United\nStates, 576 U. S. 186, 191 (2015) (quoting Webster’s New\nInternal Dictionary 1 (2d ed. 1954)). In that sense, Con-\ngress’s use of the indefinite article lends a broad construc-\ntion to the word “sentence,” as if to say “any sentence” ever\nimposed, including a later-vacated sentence. In conjunction\nwith the word “imposed,” the phrase “a sentence” thus puts\nthe statutory focus on the existence of any kind of sentence\npronounced in the record, regardless of that sentence’s pre-\nsent legal status.\n   Indeed, contrary to the Court’s suggestion, the word “sen-\ntence” does not ineluctably mean a “legally valid” sentence.\n\f                  Cite as: 606 U. S. ____ (2025)             9\n\n                      ALITO, J., dissenting\n\nOur own cases prove the point because we have often found\nit necessary to clarify whether a sentence is valid or invalid.\nSee, e.g., Swarthout v. Cooke, 562 U. S. 216, 220 (2011) (per\ncuriam) (“There is no right under the Federal Constitution\nto be conditionally released before the expiration of a valid\nsentence” (emphasis added)); Pollard v. United States, 352\nU. S. 354, 357, 360 (1957) (“The only sentence that was en-\ntered at the 1952 hearing was the one of probation, admit-\ntedly invalid because of petitioner’s absence” (emphasis\nadded)); Richmond v. Lewis, 506 U. S. 40, 43 (1992) (“[P]eti-\ntioner’s conviction was found valid but his sentence invalid”\n(emphasis added)); see also Uriarte, 975 F. 3d, at 607 (Bar-\nrett, J., dissenting) (“That is why it is perfectly coherent to\ndescribe the procedural posture of a case by saying, ‘a sen-\ntence was imposed last year, but it has since been vacated\non appeal’ ”). If Congress sought to narrow “a sentence” in\na specialized way to indicate a legally valid sentence, it\ncould have referred to “a final sentence,” “a legally valid\nsentence,” or more prosaically, “the sentence.” Accord,\nUnited States v. Hernandez, 107 F. 4th 965, 969 (CA11\n2024).\n   Reading the retroactivity provision in context, the phrase\n“a sentence has not been imposed” most straightforwardly\nmeans that a district court has not, as a matter of historical\nfact, sentenced a defendant for his §924(c) offenses before\nthe Act’s “date of enactment.” So how can the Court read\nthe same text to refer to a presently valid sentence, rather\nthan one that was historically “imposed” in the past? See\nante, at 10. Bizarrely, the Court’s analysis begins and ends\nwith Congress’s use of the present-perfect tense. Through\nthe use of a single hypothetical, which does not resemble\nthe structure of the provision actually before us, the Court\ndraws the conclusion that “the present-perfect tense con-\nveys to a listener that the event in question continues to be\ntrue or valid.” Ante, at 8. But, as I have explained, the\n\f10                    HEWITT v. UNITED STATES\n\n                           ALITO, J., dissenting\n\npresent-perfect tense is, as a general matter, capable of sup-\nporting either the historical-fact or legal-validity interpre-\ntation. The surrounding context and the specific words\nCongress employed indicate how the present-perfect tense\nmay support one interpretation or the other. As to the ac-\ntual words in the retroactivity provision (“imposed,” “a sen-\ntence”), the Court’s textual analysis in Part III–A is silent.3\n——————\n   3 The Court’s legal-validity interpretation also rests on the mistaken\n\npremise that the past-perfect tense best captures the historical-fact in-\nterpretation. The Court claims “if an event is merely a relic of history\nbecause it was voided by a subsequent action, the past-perfect (not the\npresent-perfect) tense would usually be the more appropriate verb\nchoice.” Ante, at 8. I hope readers do not look to this Court as an author-\nity on English grammar because this broad pronouncement is badly mis-\ntaken. As support for its grammatical rule, the Court offers a hypothet-\nical: suppose a U. S. Olympic Committee rule says that “athletes may\ncall themselves Olympic champions if a gold medal ‘has been awarded’\nto them.” Ante, at 7. If the Olympic gold medalist is stripped of her\nmedal, however, the Court claims she can no longer call herself an\n“Olympic champion” under the rule. To enable our athlete to still call\nherself an Olympic champion based on her now-stripped medal, the\nCourt tells us “the past-perfect” tense would be “more appropriate” (e.g.,\n“she had been awarded such a medal”). Ante, at 8–9. That is highly\ndebatable.\n   The only lesson taught by the Court’s example is that the meaning of\nlanguage is heavily dependent on context. The obvious purpose of the\nhypothetical rule is to restrict the class of individuals who are entitled to\nthe honor of calling themselves Olympic champions, and the Court pre-\nsumes that the athlete in question lost her medal because she engaged\nin improper conduct, e.g., taking performance-enhancing drugs. But sup-\npose the medal was taken away for an illegitimate reason. Some histo-\nrians think that Jim Thorpe, a legendary Native American athlete who\ndominated the 1912 Olympics, was stripped of his medals at least in part\nbecause of racism. See B. Crawford, All American: The Rise and Fall of\nJim Thorpe 209–210 (2005); J. Elfers, The Tour To End All Tours: the\nStory of Major League Baseball’s 1913–1914 World Tour 18 (2003). That\nwas not completely undone until 2022, long after Thorpe died. See V.\nMather & T. Panja, Jim Thorpe Is Restored as Sole Winner of 1912 Olym-\npic Gold Medals, N. Y. Times, July 15, 2022. Suppose Thorpe had been\nasked: “Have you ever been awarded an Olympic medal?” Would he have\nbeen a liar if he answered “yes”? The Court seems to think so.\n\f                     Cite as: 606 U. S. ____ (2025)                    11\n\n                          ALITO, J., dissenting\n\nThe Court’s failure to defend the legal-validity interpreta-\ntion is thus an independently fatal blow to its holding.\n                                B\n   Assuming the Court had proved up the legal-validity in-\nterpretation, it would still need to establish its “vacatur”\nprinciple. That is, it would still need to prove not only that\nthe Act is concerned with a sentence’s continuing legal va-\nlidity up to the “date of enactment,” but also that the Act\nhinges on the continuing validity of a sentence after the\ndate of enactment. The Court can prove as much only by\ninventing a “legal fiction” that a vacated sentence “never\noccurred.” Ante, at 10. But one need only scratch the sur-\nface of this purported “legal fiction” to understand how thor-\noughly unpersuasive it is.\n   As a preliminary matter, the Court’s “vacatur” principle\ndoes not exist. The Court assures us that there is a well-\nestablished principle in the criminal law that “vacated\ncourt orders are void ab initio and thus lack any prospective\nlegal effect.” Ibid. It derives this rule by over-reading a few\ncreative turns of phrase in our cases. See ante, at 11 (citing\nNorth Carolina v. Pearce, 395 U. S. 711, 721 (1969) (stating\nvacatur causes a conviction to be “ ‘wholly nullified and the\nslate wiped clean’ ”); Pepper v. United States, 562 U. S. 476,\n507 (2011) (noting vacatur “ ‘wipe[s] the slate clean’ ”)). But\na more careful reading of our precedents and other provi-\nsions in Title 18 indicates that vacatur does not erase the\nhistorical fact of a previously imposed conviction or sen-\ntence. Further, even if the “vacatur” principle exists, the\n——————\n   Indeed, the Court offers no answer to the argument that the present-\nperfect tense may be properly used to refer to a past event that was later\nundone. Instead, the Court promises readers that an answer will come\nin Part IV of its opinion—i.e., the portions in which only three Justices\njoin. See ante, at 8, n. 6. But this promise goes unfulfilled. Part IV\ncontains no deus ex machina to salvage the Court’s interpretation; ra-\nther, Part IV throws a celebration for the First Step Act, perhaps hoping\nreaders lose sight of the text behind all the confetti.\n\f12                  HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\nAct’s retroactivity provision does not incorporate it.\n                                1\n    Our precedents foreclose the Court’s “vacatur” principle.\nTake, for example, one of the cases the Court cites, Lewis v.\nUnited States, 445 U. S. 55 (1980). See ante, at 11. There,\nthe defendant challenged his conviction under a federal\nstatute prohibiting “ ‘[a]ny person who . . . has been con-\nvicted by a court of the United States or of a State’ ” from\n“ ‘receiv[ing], possess[ing], or transport[ing] . . . any fire-\narm.’ ” 445 U. S., at 56, and n. 1 (quoting 18 U. S. C.\n§1202(a)(1) (1970 ed.)). The defendant argued that his\npredicate state conviction was invalid because he lacked\ncounsel and that, as such, he could not be convicted as a\nfelon in possession under the federal statute. We assumed\nthat the predicate state conviction was subject to invalida-\ntion (i.e., vacatur), see 445 U. S., at 58, but we nevertheless\nupheld the felon-in-possession conviction. We reasoned\nthat the statute’s “sweeping” language, which is phrased in\nthe present-perfect tense just like the First Step Act, fo-\ncused on “the fact of a [predicate] felony conviction.” Id., at\n60. At the time of his federal offense, the defendant’s state\nconviction was extant and thus disabled him from firearm\npossession. Congress made “[n]o exception” for “a person\nwhose outstanding [predicate] conviction ultimately might\nturn out to be invalid for any reason.” Id., at 62. So a sub-\nsequent invalidation of his state predicate conviction due to\nhis lack of counsel would not render that conviction “invalid\nfor all purposes.” Id., at 67. Lewis thus powerfully refutes\nthe Court’s vacatur principle. If vacatur of the defendant’s\npredicate conviction implied the conviction “never\noccurred,” as the Court today insists, then his felon-in-\npossession conviction could not stand. Ante, at 10. But that\nis the very argument Lewis foreclosed.4\n\n——————\n 4 In responding to Lewis, the Court accidentally fires on its own posi-\n\f                      Cite as: 606 U. S. ____ (2025)                      13\n\n                           ALITO, J., dissenting\n\n   Although it supports the petitioners in this appeal, the\nUnited States also concedes (albeit sheepishly in a footnote)\nthat the Court’s “general background legal principle that\nvacatur makes a sentence void from the start for all pur-\nposes” is “incorrect.” Brief for United States 27, n. 4 (inter-\nnal quotation marks and alterations omitted). As it\nacknowledges, lower courts routinely follow Lewis and up-\nhold convictions despite the later vacatur of predicate of-\nfenses. See, e.g., Burrell v. United States, 384 F. 3d 22, 27–\n28 (CA2 2004) (“[I]t is the mere fact of [a prior] conviction\nat the time of the charged possession, not the reliability of\nthe conviction, that establishes the §922(g)(1) predicate”\n(internal quotation marks omitted)); United States v. Rob-\nerson, 752 F. 3d 517, 522 (CA1 2014) (upholding a convic-\ntion for failure to register as a sex offender even though the\npredicate sex offense was later vacated).\n   Moreover, as the United States also acknowledges,\nLewis’s logic crosses into the constitutional context. Con-\nsider Bravo-Fernandez v. United States, 580 U. S. 5 (2016),\nin which we considered the application of issue preclusion\nunder the Double Jeopardy Clause when a jury returns in-\nconsistent verdicts. It is well established that if a jury con-\nvicts on one count but acquits on another count involving\nthe same conduct, the acquittal has no issue preclusive ef-\nfect. See id., at 13. Likewise, if a jury acquits on one count\nbut fails to reach agreement on another count, the acquittal\nhas such an effect. See id., at 13–14. In Bravo-Fernandez,\na jury convicted on one count but acquitted on others that\n——————\ntion. The Court justifies Lewis’s holding by explaining that “the defend-\nant’s prior felony conviction had ‘never been overturned’—i.e., vacated—\nat the time he possessed the weapon.” Ante, at 11, n. 8 (quoting Lewis v.\nUnited States, 445 U. S. 55, 57 (1980)). But that is precisely the point.\nLewis afforded “prospective legal effect” to the defendant’s vacated con-\nviction by refusing to ignore the historical fact of his predicate conviction\neven after the vacatur. I see no way to reconcile that reasoning with the\nCourt’s rule that a vacated sentence never “retains prospective legal ef-\nfect.” Ibid.\n\f14                  HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\nwere claimed to involve the same conduct. The conviction,\nhowever, was vacated due to “an unrelated legal error,” and\nthe defendant argued that the Court should treat the con-\nviction as if it had never occurred and that the acquittal had\nissue preclusive effect barring reprosecution. Id., at 9. We\nrejected this argument, holding that the conviction’s later\ninvalidation did not “erase” its historical existence for the\npurposes of issue preclusion because the vacatur did not\n“bear on the factual determinations actually and neces-\nsarily made by the jury.” Id., at 21 (internal quotation\nmarks omitted). Bravo-Fernandez thus treated the histori-\ncal fact of a later-vacated conviction as legally relevant,\nwhich is irreconcilable with the Court’s “vacatur” principle.\n   The only “ ‘unexpressed presumptio[n]’ ” I can derive from\nour cases and those from the courts of appeals is the oppo-\nsite of the one the Court advances today. Ante, at 10 (quot-\ning Bond v. United States, 572 U. S. 844, 857 (2014)).\n                               2\n   Congress too has rejected the Court’s “vacatur” principle.\nIn the Sentencing Reform Act, Congress “se[t] forth a spe-\ncial . . . background principle” that is incompatible with the\n“vacatur” rule invented today. Dorsey v. United States, 567\nU. S. 260, 275 (2012) (emphasis deleted).5 That is, after a\nsentence is vacated, a district court during resentencing\nmust apply the Sentencing Guidelines that “were in effect\non the date of the previous sentencing of the defendant\nprior to the appeal.” 18 U. S. C. §3742(g)(1). The vacatur\nof an initial sentence thus does not “wipe the slate clean” in\nrelation to the Guidelines range. Contra, Pepper, 562 U. S.,\nat 507. Petitioners try to write off this provision as a devi-\nation from the background presumption that vacatur voids\n——————\n  5 In Dorsey, 567 U. S., at 275, we referred to 18 U. S. C.\n\n§3553(a)(4)(A)(ii) as establishing the relevant “background principle.”\nThat provision incorporates by reference the anti-vacatur rule of\n§3742(g).\n\f                      Cite as: 606 U. S. ____ (2025)                     15\n\n                           ALITO, J., dissenting\n\na sentence ab initio. See Brief for Petitioner Hewitt 24;\nBrief for Petitioner Duffey et al. 47. But §3742(g)(1)’s anti-\nvacatur rule cannot be described as a minor exception to an\notherwise widespread principle. The rule does not appear\nin some “little-used backwater” of the Sentencing Reform\nAct. West Virginia v. EPA, 597 U. S. 697, 730 (2022). Ra-\nther, it is incorporated into the default procedures that ap-\nply in every criminal sentencing.6 See §§3553(a)(4)(A)(ii),\n(a)(5)(B).\n    In short, the Court’s failure to “sho[w] that its own rule\n. . . existed as a background matter when Congress enacted”\nthe First Step Act is fatal to its position. Coinbase, Inc. v.\nBielski, 599 U. S. 736, 753–754 (2023) (JACKSON, J., dis-\nsenting).\n                               3\n  Even assuming the “vacatur” principle is not a figment of\nthe Court’s imagination, it lacks any foothold in the Act’s\ntext. “When called on to resolve a dispute over a statute’s\nmeaning, this Court normally seeks to afford the law’s\nterms their ordinary meaning at the time Congress adopted\nthem.” Niz-Chavez v. Garland, 593 U. S. 155, 160 (2021).\nOf course, we sometimes look to principles beyond the four\ncorners of a statute to understand the background against\nwhich Congress legislated. But we typically do so in dis-\ncrete situations. For example, we look to background\ncommon-law principles to fill in obvious gaps in statutes,\nsuch as a missing mens rea element in a criminal statute.\nSee, e.g., Staples v. United States, 511 U. S. 600, 619 (1994)\n\n——————\n  6 The portion of the opinion in which only three Justices join expresses\n\nconcern that, under the historical-fact interpretation, district judges will\nstruggle “to reference, recall, and apply the superseded ‘stacking’ re-\ngime.” Ante, at 19. But I have far more faith in district judges’ ability to\nenforce older sentencing regimes. Indeed, district judges’ familiarity\nwith 18 U. S. C. §3742(g), which routinely requires them to apply obso-\nlete Sentencing Guidelines in the present, is proof positive.\n\f16                HEWITT v. UNITED STATES\n\n                       ALITO, J., dissenting\n\n(mens rea); Agency Holding Corp. v. Malley-Duff & Associ-\nates, Inc., 483 U. S. 143, 150 (1987) (statutes of limitations);\nMarx v. General Revenue Corp., 568 U. S. 371, 382 (2013)\n(attorney’s fees and costs). Or we import extra-textual\nmeaning when Congress employs a “term of art that had an\nestablished meaning under” a relevant “backdrop.” Stewart\nv. Dutra Constr. Co., 543 U. S. 481, 487 (2005).\n   The First Step Act fits neither mold, and the Court makes\nno effort in Part III–B to analyze how its “vacatur” principle\nmaps on to the text. The Court points to no obvious gap in\nthe Act’s retroactivity provision that could be filled with\n“recognized” “background principles of construction.”\nBond, 572 U. S., at 857. Nor does the Court suggest that\nthe utterly ordinary words in the Act’s retroactivity provi-\nsion carry some specialized meaning related to vacatur. “In\nthe absence of some strong contrary indication” of special-\nized meaning, we must “ ‘assume that the ordinary mean-\ning’ ” of words like “sentence,” which captures both extant\nand vacated sentences, “controls.” Monsalvo Velázquez v.\nBondi, 604 U. S. ___, ___ (2025) (ALITO, J., dissenting) (slip\nop., at 4); see Part III–A, supra.\n                               C\n   The superiority of the historical-fact interpretation and\nthe nonexistence of the Court’s “vacatur” principle are in-\ndependent reasons to reject the Court’s holding. But even\nif the matter were close, two more factors counsel against\nthe Court’s rule.\n   First, the retroactivity provision’s title—“APPLICABILITY\nTO PENDING CASES”—advises against the Court’s boundless\ninterpretation. “[T]he title of a statute and the heading of\na section are tools available for the resolution of a doubt\nabout the meaning of a statute.” Dubin v. United States,\n599 U. S. 110, 120–121 (2023) (internal quotation marks\nomitted); see also Yates v. United States, 574 U. S. 528, 552\n(2015) (ALITO, J., concurring in judgment) (“Titles can be\n\f                  Cite as: 606 U. S. ____ (2025)            17\n\n                      ALITO, J., dissenting\n\nuseful devices to resolve doubt about the meaning of a stat-\nute” (internal quotation marks omitted)). Here, the phrase\n“Pending Cases” suggests Congress was concerned with the\nfinite population of defendants who, on the date of the First\nStep Act’s enactment, lacked an initial sentence for §924(c)\noffenses. See Black’s Law Dictionary, at 1366 (defining\n“pending” as “[r]emaining undecided; awaiting decision”);\nModern English Usage 813 (defining “pending” as “await-\ning an outcome”). But the Court’s “vacatur” principle would\nobliterate that closed set and refashion the retroactivity\nprovision as an open-ended entitlement for any defendant\nconvicted of multiple §924(c) offenses whose sentence is va-\ncated at any time and for any reason. That means, as the\nUnited States concedes, the “universe” of “Pending Cases”\nwould “increase,” for example, “anytime this Court issues a\ndecision that affects the validity of 924(c) sentences.” Tr. of\nOral Arg. 49. If Congress intended the retroactivity provi-\nsion to benefit such an amorphous population that may for-\never grow in size, I seriously doubt it would have labeled\nthe Act’s retroactivity provision with the phrase “Pending\nCases.”\n   Second, the presumption against retroactivity further\nweighs against the Court’s unnecessarily broad interpreta-\ntion. The Federal Saving Statute sets forth “an important\nbackground principle of interpretation” that “a new crimi-\nnal statute that ‘repeal[s]’ an older criminal statute shall\nnot change the penalties ‘incurred’ under that older statute\n‘unless the repealing Act shall so expressly provide.’ ”\nDorsey, 567 U. S., at 272, 274 (quoting 1 U. S. C. §109). Ac-\ncordingly, Congress may give retroactive effect to new re-\nductions in criminal penalties, but it must do so with “plain\nimport” or “fair implication.” 567 U. S., at 275 (internal\nquotation marks omitted). Here, the First Step Act pro-\nvides a clear intent to rebut the presumption against retro-\nactivity as to offenders for whom a sentence “has not been\nimposed.” Although I believe the scope of that retroactivity\n\f18               HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\ncommand is sufficiently clear for the reasons I have already\ngiven, to the extent there is any ambiguity about how far\nthe Act’s retroactivity command should go, the presumption\nputs a thumb on the scale against construing the retroac-\ntivity command to its broadest extent as the Court does to-\nday.\n                               IV\n   After the Court is through with the text and nonexistent\nprinciples of vacatur, three Justices continue on for pages,\nsparing no effort, to extol the “much-anticipated, much-\nheralded” First Step Act. Ante, at 15. But what is the point\nof all this lauding? Perhaps realizing the weakness of their\ntextual argument, the three Justices think it wise to spruce\nup the opinion. They attempt to do so by asserting that\nwhen a “ ‘bipartisan’ ” “supermajority” of Congress passes\n“landmark” legislation, it intends to go big, down to the very\nlast subsection (or here, application note to a subsection).\nAnte, at 3; ante, at 15 (opinion of JACKSON, J., joined by\nSOTOMAYOR and KAGAN, JJ.). So I gather they would have\nus broadly construe every atom of the “landmark” First\nStep Act in a way that furthers Congress’s supposedly\ngrand ambition to turn the page on “harsh” sentencing\npractices. Ante, at 16.\n   There is no “landmark” canon of construction requiring\nthe Court to construe important legislation to its furthest\npossible implication. “ ‘[N]o legislation pursues its purposes\nat all costs.’ ” American Express Co. v. Italian Colors Res-\ntaurant, 570 U. S. 228, 234 (2013) (quoting Rodriguez v.\nUnited States, 480 U. S. 522, 525–526 (1987) (per curiam)).\nIndeed, just last Term we rejected the same sort of “land-\nmark” argument when interpreting a different provision of\nthe First Step Act. See Pulsifer v. United States, 601 U. S.\n124, 151–152 (2024). Experience shows that more often\nthan not, “landmark” legislation reflects the necessary log-\n\f                    Cite as: 606 U. S. ____ (2025)                  19\n\n                         ALITO, J., dissenting\n\nrolling of the legislative process, which prizes political com-\npromise over statutory clarity. That reality cautions\nagainst the precise move the Court makes today: an infer-\nence that Congress hid in an “ancillary” and intentionally\ncircumscribed provision a retroactivity command that\nwould “alter the fundamental details” of how §924(c) sen-\ntencing should work for all time. Whitman v. American\nTrucking Assns., Inc., 531 U. S. 457, 468 (2001).\n   The three-Justice opinion rattles off the public criticisms\nthat supposedly spurred Congress to reform the practice of\n§924(c) sentence “stacking.” But this discussion is beside\nthe point. Nothing in this multi-page discussion sheds light\non how Members of Congress understood the retroactivity\nprovision before us.\n   Carried away with its enthusiasm for the changes ef-\nfected by the First Step Act, the three Justices bestow an\nentirely undeserved windfall on the actual petitioners in\nthese cases. Due to the especially violent nature of their\nrobberies,7 petitioners were convicted of more than a dozen\n§924(c) offenses, about half of which were not predicated on\n§924(c)’s residual clause.\n   In 2019 we decided Davis and provided a basis to set\naside petitioners’ §924(c) convictions under the residual\nclause, but Davis did nothing to disturb petitioners’ other\n§924(c) convictions and associated mandatory-minimum\nsentences. In cases “involv[ing] multicount indictments\nand a successful attack by a defendant on some but not all\n——————\n  7 Dubbed the “Scarecrow Bandits” due to their plaid-shirt and floppy-\n\nhat disguises, petitioners and their confederates “violently robbed” a\nstring of banks in the Dallas-Fort Worth area around 2008. 2009 WL\n2356156, *1 (ND Tex. July 30, 2009); see FBI, Scarecrow Bandit Leader\nSentenced to 355 Years in Federal Prison on Bank Robbery and Firearms\nConvictions (May 5, 2010). During the robberies, the Scarecrow Bandits\nheld bank employees and customers at gunpoint and physically as-\nsaulted them with firearms and stun guns. See 2009 WL 2356156, *1.\nIn total, the conspiracy stole more than $350,000 before authorities\ncaught up with them. See Brief for United States 7.\n\f20                   HEWITT v. UNITED STATES\n\n                           ALITO, J., dissenting\n\nof the counts of conviction,” a court, “in such instances, may\nvacate the entire sentence on all counts” and “reconfigure\nthe sentencing plan” in toto. Greenlaw, 554 U. S., at 253\n(emphasis added).8 But, as petitioners’ counsel conceded,\ncourts are under “no obligation” to follow this convention\nand may instead choose to vacate only those parts of the\nsentence related to an intervening change in law. Tr. of\nOral Arg. 15. Nor does this strike me as a case in which full\nvacatur was warranted. Section 924(c) convictions must\nrun consecutively “with any other term of imprisonment.”\n§924(c)(1)(D)(ii). So §924(c) sentences are presumably eas-\nier to identify and extract from a defendant’s total term of\nimprisonment, often obviating the need for a plenary resen-\ntencing. The likely unnecessary vacatur of each petitioner’s\nentire sentence was thus a stroke of good fortune that\nopened the door to petitioners’ First Step Act claims.9 The\nlower courts (correctly) rejected those efforts, but petition-\ners have found a sympathetic audience in this Court. The\n——————\n   8 The chief reason for vacating perfectly valid convictions in such cases\n\nis to allow the sentencing court to consider whether the sentence previ-\nously imposed on a valid count provides sufficient punishment for the\ndefendant’s conduct. See Greenlaw, 554 U. S., at 253–254. Suppose a\ndefendant is convicted of two offenses, each with a 5-year mandatory\nminimum. The sentencing judge, thinking that the appropriate punish-\nment for the defendant’s criminal conduct is 10 years’ imprisonment, im-\nposes a 5-year term of imprisonment on both counts and runs the counts\nconsecutively. If one of the counts of conviction is reversed and the case\nis remanded, the sentencing judge may wish to enlarge the initial 5-year\nsentence on the remaining count to 10 years’ imprisonment. So the de-\nfendant “ultimately may gain nothing from his limited success on ap-\npeal.” Id., at 254. It is therefore ironic that the unnecessary vacatur of\npetitioners’ valid convictions has given them a benefit.\n   9 The District Court’s willingness to vacate petitioners’ entire sen-\n\ntences appears to have been informed by the position of the United\nStates, which “agreed” with petitioners that the “sentences on all re-\nmaining counts should be vacated.” Agreed Order in No. 3:08–cr–167\n(ND Tex., Nov. 2, 2021), ECF Doc. 700, p. 2 (Ross); see Agreed Order in\nNo. 3:08–cr–167 (June 14, 2021), ECF Doc. 672, p. 2 (Duffey); Agreed Or-\nder in No. 3:08–cr–167 (Aug. 19, 2021), ECF Doc. 683, p. 2 (Hewitt).\n\f                  Cite as: 606 U. S. ____ (2025)           21\n\n                      ALITO, J., dissenting\n\nthree Justices attribute today’s outcome to grand congres-\nsional design coming to fruition, but in reality, petitioners’\nchange in fortune can be attributed only to the happen-\nstance of legal developments with not the faintest relation-\nship to the First Step Act.\n                         *     *    *\n   The Court ignores Congress’s intention to afford only lim-\nited retroactive relief to certain offenders under the First\nStep Act. Instead, the Court embraces an interpretation\nthat has no limiting principle and affords petitioners a\nwindfall. That is an indefensible result based on indefensi-\nble reasoning. I cannot agree with the Court’s decision, so\nI must respectfully dissent.\n\f", "html": "", "html_lawbox": "", "html_columbia": "", "html_anon_2020": "", "xml_harvard": "", "html_with_citations": "<pre class=\"inline\">(Slip Opinion)              OCTOBER TERM, 2024                                       1\n\n                                       Syllabus\n\n         NOTE: Where it is feasible, a syllabus (headnote) will be released, as is\n       being done in connection with this case, at the time the opinion is issued.\n       The syllabus constitutes no part of the opinion of the Court but has been\n       prepared by the Reporter of Decisions for the convenience of the reader.\n       See United States v. Detroit Timber &amp; Lumber Co., </pre><span class=\"citation\" data-id=\"96405\"><a href=\"/opinion/96405/united-states-v-detroit-timber-lumber-co/#337\" aria-description=\"Citation for case: United States v. Detroit Timber &amp; Lumber Co.\">200 U. S. 321, 337</a></span><pre class=\"inline\">.\n\n\nSUPREME COURT OF THE UNITED STATES\n\n                                       Syllabus\n\n                     HEWITT v. UNITED STATES\n\nCERTIORARI TO THE UNITED STATES COURT OF APPEALS FOR\n                  THE FIFTH CIRCUIT\n\n   No. 23–1002. Argued January 13, 2025—Decided June 26, 2025*\n\n\nBefore the First Step Act was enacted in 2018, federal judges were re-\n  quired to sentence first-time offenders convicted of violating </pre><span class=\"citation no-link\">18\n  U. S. C. §924</span><pre class=\"inline\">(c)—a law that criminalizes possessing a firearm while\n  committing other crimes—to “stacked” 25-year periods of incarcera-\n  tion. The First Step Act eliminated this harsh mandatory minimum\n  penalty. Section 403(b) of the Act also made its more lenient penalties\n  partially retroactive. Specifically, if a sentence “has not been imposed”\n  upon an eligible §924(c) offender as of the date of the First Step Act’s\n  enactment, the Act applies. The question presented here concerns an\n  edge case: What penalties apply when a §924(c) offender had been sen-\n  tenced as of the Act’s enactment, but that sentence was subsequently\n  vacated, such that the offender must face a post-Act resentencing?\n     In 2009, petitioners Tony Hewitt, Corey Duffey, and Jarvis Ross\n  were convicted of multiple counts of bank robbery and conspiracy to\n  commit bank robbery, along with corresponding §924(c) offenses for\n  use of a firearm during a crime of violence. Each petitioner received a\n  mandatory 5-year sentence for his first §924(c) count of conviction and,\n  despite being first-time offenders, each received 25-year mandatory\n  sentences on every §924(c) count beyond his first. Thus, each peti-\n  tioner’s sentence exceeded 325 years. Petitioners successfully chal-\n  lenged some of their convictions on direct appeal, and the Fifth Circuit\n  vacated petitioners’ sentences. In 2012, the District Court resentenced\n  each petitioner to between 285 and 305 years on the counts that re-\n  mained.\n——————\n   *Together with No. 23–1150, Duffey et al. v. United States, also on cer-\ntiorari to the same court.\n\f2                      HEWITT v. UNITED STATES\n\n                                  Syllabus\n\n       In 2019, the Court held that the “crime of violence” definition the\n    Government routinely used to support some §924(c) convictions was\n    unconstitutionally vague. See United States v. Davis, </pre><span class=\"citation no-link\">588 U. S. 445</span><pre class=\"inline\">,\n    470. Because that holding potentially affected some of petitioners’ re-\n    maining convictions, the Fifth Circuit granted petitioners authoriza-\n    tion to file a second or successive postconviction motion. The District\n    Court then vacated the impacted §924(c) convictions, as well as peti-\n    tioners’ sentences. When the District Court held resentencings for the\n    remaining convictions, petitioners argued that the First Step Act’s 5-\n    year—not 25-year—mandatory minimum penalties applied. Petition-\n    ers argued they were entitled to retroactive application of the Act’s\n    more lenient penalties because a vacated prior sentence is not a sen-\n    tence that “has . . . been imposed” for purposes of §403(b). The District\n    Court disagreed and resentenced petitioners under the pre-Act sen-\n    tencing scheme, giving them stacked 25-year mandatory minimums\n    for each §924(c) count of conviction beyond their first. Petitioners thus\n    each received sentences of 130 years or more.\n       On appeal, petitioners and the Government agreed that the First\n    Step Act should have applied at petitioners’ resentencings. The Fifth\n    Circuit denied their joint request for vacatur. In that court’s view,\n    §403(b) applies only “to defendants for whom ‘a sentence . . . ha[d] not\n    been imposed’ as of the enactment date.” </pre><span class=\"citation no-link\">92 F. 4th 304</span><pre class=\"inline\">, 310. Because\n    each petitioner had been sentenced (twice) prior to the Act’s enact-\n    ment, the panel concluded that petitioners were not eligible for the\n    First Step Act’s more lenient mandatory minimums.\nHeld: The judgment is reversed, and the case is remanded. Pp. 6–12.\n</pre><span class=\"citation no-link\">92 F. 4th 304</span><pre class=\"inline\">, reversed and remanded.\n     JUSTICE JACKSON delivered the opinion of the Court with respect to\n  Parts I, II, and III, concluding that under §403(b) of the First Step Act,\n  a sentence “has . . . been imposed” for purposes of that provision if, and\n  only if, the sentence is extant—i.e., has not been vacated. Thus, the\n  Act’s more lenient penalties apply to defendants whose previous\n  §924(c) sentences have been vacated and who need to be resentenced\n  following the Act’s enactment. Pp. 6–12.\n     (a) The text of §403(b) and the nature of vacatur support this con-\n  clusion. Congress employed the present-perfect tense, requiring eval-\n  uation of whether “a sentence . . . has . . . been imposed” upon the de-\n  fendant, rather than the past-perfect tense that would exclude anyone\n  upon whom a sentence “had” been imposed. The present-perfect tense\n  can refer to “an act, state, or condition that is now completed” or “a\n  past action that comes up to and touches the present” and thus conveys\n  that the event in question continues to be true or valid. The Chicago\n  Manual of Style §5.132, p. 268. When used in either sense, the pre-\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                     3\n\n                                Syllabus\n\n  sent-perfect tense addresses whether something has continuing rele-\n  vance to the present, not merely whether it occurred as a historical\n  fact. If an event is merely a relic of history because it was voided by a\n  subsequent action, the past-perfect (not the present-perfect) tense is\n  usually the more appropriate verb choice. The fact that adjacent pro-\n  visions of §403 contain past-tense verbs only strengthens the conclu-\n  sion that §403(b)’s use of the present-perfect tense is meaningful.\n  Pp. 6–10.\n      (b) Background principles regarding the legal effect of vacatur con-\n  firm that a sentence has been imposed for §403(b) purposes only so\n  long as it remains valid. When interpreting statutes, the Court recog-\n  nizes that Congress legislates against the backdrop of certain unex-\n  pressed presumptions. One such presumption is that vacated court\n  orders are void ab initio and thus lack any prospective legal effect. A\n  criminal defendant whose conviction has been vacated, for example, is\n  to be treated going forward as though he were never convicted. By\n  operation of legal fiction, the law acts as though the previous convic-\n  tion never occurred. Section 403(b) reflects this commonsense under-\n  standing of background vacatur principles. Just as defendants with\n  vacated prior felony convictions are not precluded from possessing\n  weapons under the federal felon-in-possession ban, §403(b) retroactiv-\n  ity does not exclude from its scope those whose prior sentences were\n  vacated. By authorizing retroactive application of the First Step Act’s\n  more lenient penalties on any eligible offender upon whom “a sentence\n  . . . has not been imposed,” the text of §403(b) indicates that only past\n  sentences with continued validity preclude application of the Act’s new\n  penalties. Pp. 10–12.\n\n   JACKSON, J., delivered the opinion of the Court with respect to Parts I,\nII, and III, in which ROBERTS, C. J., and SOTOMAYOR, KAGAN, and GOR-\nSUCH, JJ., joined, and an opinion with respect to Parts IV and V, in which\nSOTOMAYOR and KAGAN, JJ., joined. ALITO, J., filed a dissenting opinion,\nin which THOMAS, KAVANAUGH, and BARRETT, JJ., joined.\n\f                        Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                              1\n\n                             Opinion of the Court\n\n     NOTICE: This opinion is subject to formal revision before publication in the\n     United States Reports. Readers are requested to notify the Reporter of\n     Decisions, Supreme Court of the United States, Washington, D. C. 20543,\n     pio@supremecourt.gov, of any typographical or other formal errors.\n\n\nSUPREME COURT OF THE UNITED STATES\n                TONY R. HEWITT, PETITIONER\n23–1002                     v.\n                      UNITED STATES\n\n   COREY DEYON DUFFEY, ET AL., PETITIONERS\n23–1150             v.\n              UNITED STATES\n  ON PETITIONS FOR WRITS OF CERTIORARI TO THE UNITED\n    STATES COURT OF APPEALS FOR THE FIFTH CIRCUIT\n         Nos. 23–1002 and 23–1150. Decided June 26, 2025\n\n  JUSTICE JACKSON delivered the opinion of the Court, ex-\ncept as to Parts IV and V.*\n  Before the First Step Act was enacted in 2018, federal\njudges were required to sentence certain first-time offend-\ners convicted of violating </pre><span class=\"citation no-link\">18 U. S. C. §924</span><pre class=\"inline\">(c)—a law that\ncriminalizes the possession of a firearm while committing\nother crimes—to “stacked” 25-year periods of incarceration.\nThe First Step Act, </pre><span class=\"citation no-link\">132 Stat. 5194</span><pre class=\"inline\">, eliminated this harsh\nmandatory minimum penalty. Congress also made the\nAct’s more lenient penalties partially retroactive. Section\n403(b) specifies that the Act applies if a sentence “has not\nbeen imposed” upon an eligible §924(c) offender as of the\ndate of the First Step Act’s enactment. Id., at 5222.\n  The question presented here concerns an edge case: What\npenalties apply when a §924(c) offender had been sentenced\nas of the Act’s enactment, but that sentence was subse-\nquently vacated, such that the offender must face a post-\n——————\n   *THE CHIEF JUSTICE and JUSTICE GORSUCH join all but Parts IV and V\nof this opinion.\n\f2                   HEWITT v. UNITED STATES\n\n                        Opinion of the Court\n\nAct resentencing? We hold that, under that circumstance,\na sentence “has not been imposed” for purposes of §403(b).\nThus, the First Step Act’s more lenient penalties apply.\n                               I\n   Title </pre><span class=\"citation no-link\">18 U. S. C. §924</span><pre class=\"inline\">(c) criminalizes the use or posses-\nsion of a firearm during and in relation to a crime of vio-\nlence or drug-trafficking offense. The statute prescribes a\n5-year mandatory minimum penalty for any first-time of-\nfense, which must run consecutively to any other term of\nimprisonment. §§924(c)(1)(A)(i), (c)(1)(D)(ii). Before the\nFirst Step Act, §924(c) also contained a recidivism enhance-\nment that required imposition of an additional 25 years of\nimprisonment (on top of the 5-year mandatory minimum)\nfor any “second or subsequent conviction under this subsec-\ntion.” §924(c)(1)(C)(i) (2006 ed.).\n   In Deal v. United States, </pre><span class=\"citation\" data-id=\"9432802\"><a href=\"/opinion/112860/deal-v-united-states/\" aria-description=\"Citation for case: Deal v. United States\">508 U. S. 129</a></span><pre class=\"inline\"> (1993), this Court\ninterpreted that recidivism-related language to require an\nenhanced penalty for each and every §924(c) count of con-\nviction beyond a defendant’s first—even if those convictions\nwere part of the same criminal prosecution. Id., at 132–\n137. As a result, a first-time offender convicted of two\n§924(c) counts would receive a mandatory 25-year sentence\non the second count, “stacked” upon (i.e., running consecu-\ntively to) the first count’s mandatory 5-year sentence, for a\ntotal of 30 years of imprisonment.1 And each additional\n§924(c) count would add another 25 years to that defend-\nant’s total term of incarceration. See id., at 131–132. Un-\nder this “stacking” interpretation of §924(c)’s recidivism en-\nhancement, sentences for §924(c) offenses ballooned rapidly\nto span decades or even centuries.\n\n——————\n  1 When this Court decided Deal in 1993, the enhanced mandatory min-\n\nimum penalty under §924(c) was 20 years. See </pre><span class=\"citation no-link\">18 U. S. C. §924</span><pre class=\"inline\">(c) (1988\ned.). Congress increased the mandatory minimum to 25 years in 1998.\nSee §924(c) (1994 ed., Supp. IV); </pre><span class=\"citation no-link\">112 Stat. 3469</span><pre class=\"inline\">.\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)             3\n\n                      Opinion of the Court\n\n  On December 21, 2018, a supermajority of Congress en-\nacted the First Step Act, a landmark piece of legislation\nthat changed the federal criminal-sentencing system in nu-\nmerous respects. See </pre><span class=\"citation no-link\">132 Stat. 5194</span><pre class=\"inline\">. Among other things,\n§403(a) of the First Step Act “clarif[ied]” that district court\njudges are not required to impose stacked 25-year sentences\nwhen sentencing first-time §924(c) offenders. Id., at 5221–\n5222 (capitalization deleted). Abrogating this Court’s deci-\nsion in Deal, the statute established instead that, for first-\ntime offenders, 5-year mandatory minimums apply to each\ncount of conviction.\n  The First Step Act also addressed the potential for retro-\nactive application of this penalty reduction, by specifically\nidentifying the §924(c) offenders to whom the Act applied.\nOrdinarily, because judges impose sentences based on the\nstatutory penalties that exist at the time defendants com-\nmit their offenses, </pre><span class=\"citation no-link\">1 U. S. C. §109</span><pre class=\"inline\">, statutory changes to fed-\neral penalties only benefit future offenders. But Congress\naltered this default no-retroactivity rule in the Act itself.\nSection 403(b)—titled “APPLICABILITY TO PENDING\nCASES”—made §403(a)’s reduced penalties applicable to\ncertain existing §924(c) offenders, as follows:\n    “This section, and the amendments made by this sec-\n    tion, shall apply to any offense that was committed be-\n    fore the date of enactment of this Act, if a sentence for\n    the offense has not been imposed as of such date of en-\n    actment.” §403(b), </pre><span class=\"citation no-link\">132 Stat. 5222</span><pre class=\"inline\">.\n                              II\n  In 2009, petitioners Tony Hewitt, Corey Duffey, and Jar-\nvis Ross were convicted of multiple counts of bank robbery\nand conspiracy to commit bank robbery, along with corre-\nsponding §924(c) offenses for use of a firearm during a crime\nof violence. Each petitioner received a mandatory 5-year\nsentence as to their first §924(c) count of conviction. And,\ndespite being first-time offenders, each received 25-year\n\f4                    HEWITT v. UNITED STATES\n\n                          Opinion of the Court\n\nmandatory sentences on every §924(c) count beyond their\nfirst. Thus, in total, each petitioner’s sentence exceeded 325\nyears. Roughly 25 of those years were due to the robbery\noffenses themselves, while the rest were attributable to\nstacked §924(c) counts.\n   Petitioners successfully challenged some of their convic-\ntions on direct appeal, and the Fifth Circuit accordingly va-\ncated petitioners’ sentences.2 In 2012, the District Court\nresentenced each petitioner to between 285 and 305 years\non the counts that remained—sentences that the Fifth Cir-\ncuit affirmed on direct review. Petitioners also filed post-\nconviction motions under </pre><span class=\"citation no-link\">28 U. S. C. §2255</span><pre class=\"inline\">, which were\neach denied.\n   After Congress passed the First Step Act in 2018, this\nCourt held that the “crime of violence” definition the Gov-\nernment routinely used to support some §924(c) convictions\nwas unconstitutionally vague. See United States v. Davis,\n</pre><span class=\"citation no-link\">588 U. S. 445</span><pre class=\"inline\">, 470 (2019). Because that holding potentially\naffected some of petitioners’ remaining convictions, the\nFifth Circuit granted petitioners authorization to file a sec-\nond or successive postconviction motion under </pre><span class=\"citation no-link\">28 U. S. C.\n§2255</span><pre class=\"inline\">. The District Court then vacated the impacted\n§924(c) convictions, as well as petitioners’ sentences.\n   When the District Court held resentencings for the re-\nmaining convictions, petitioners argued that the First Step\nAct’s 5-year—not 25-year—mandatory minimum penalties\napplied. Petitioners argued that they were entitled to ret-\nroactive application of the First Step Act’s more lenient\npenalties because a vacated prior sentence is not a sentence\nthat “has . . . been imposed” for purposes of §403(b).3 The\n——————\n  2 Petitioners were initially convicted of attempted bank robbery, too.\n\nThose convictions—along with the corresponding §924(c) counts—were\nvacated following petitioners’ successful challenges on direct appeal. See\nUnited States v. Duffey, </pre><span class=\"citation\" data-id=\"620153\"><a href=\"/opinion/620153/united-states-v-corey-duffey/\" aria-description=\"Citation for case: United States v. Corey Duffey\">456 Fed. Appx. 434</a></span><pre class=\"inline\">, 444–445 (CA5 2012).\n  3 During Duffey’s and Ross’s resentencings before the District Court,\n\nthe Government maintained that petitioners were ineligible for First\n\f                     Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                     5\n\n                          Opinion of the Court\n\nDistrict Court disagreed and resentenced petitioners under\nthe pre-Act sentencing scheme, giving them stacked 25-\nyear mandatory minimum sentences for each §924(c) count\nof conviction beyond their first. Petitioners thus each re-\nceived sentences of 130 years or more—105 years of which\nwere attributable to stacked §924(c) penalties.\n   On appeal, petitioners and the Government agreed that\nthe First Step Act should have applied at petitioners’ resen-\ntencings. The parties thus jointly requested vacatur of pe-\ntitioners’ sentences, which the Fifth Circuit denied. </pre><span class=\"citation no-link\">92\nF. 4th 304</span><pre class=\"inline\">, 310 (2024) (case below). In that court’s view,\n§403(b) applies only “to defendants for whom ‘a sentence . . .\nha[d] not been imposed’ as of the enactment date.” Ibid.\n(alteration in original). Because each petitioner had been\nsentenced (twice) prior to the Act’s enactment, the panel\nconcluded that petitioners were not eligible for the First\nStep Act’s more lenient mandatory minimums.\n   We granted certiorari to decide whether §403(b) of the\nFirst Step Act confers the benefit of the Act’s more lenient\npenalties to defendants facing post-Act resentencing follow-\ning vacatur of their pre-Act sentence. </pre><span class=\"citation no-link\">603 U. S. ___</span><pre class=\"inline\"> (2024).4\nBecause the United States agrees with petitioners on the\n——————\nStep Act relief. But, by the time of Hewitt’s resentencing, the Govern-\nment had changed its position; it supported Hewitt’s request for resen-\ntencing under the Act.\n   4 The Courts of Appeals have divided over whether offenders who were\n\nsentenced pre-Act, but whose sentences were later vacated, are eligible\nto receive First Step Act benefits at their post-Act resentencing. Com-\npare United States v. Merrell, </pre><span class=\"citation no-link\">37 F. 4th 571</span><pre class=\"inline\">, 577–578 (CA9 2022) (hold-\ning that, under §403(b), such an offender benefits from the Act at resen-\ntencing), and United States v. Mitchell, </pre><span class=\"citation no-link\">38 F. 4th 382</span><pre class=\"inline\">, 386–389 (CA3\n2022) (same), with United States v. Jackson, </pre><span class=\"citation no-link\">995 F. 3d 522</span><pre class=\"inline\">, 525–526\n(CA6 2021) (holding that such an offender does not benefit from the Act\nat resentencing, if the prior sentence was vacated after the Act’s enact-\nment); see also United States v. Uriarte, </pre><span class=\"citation no-link\">975 F. 3d 596</span><pre class=\"inline\">, 601–602, and n. 3\n(CA7 2020) (en banc) (holding that such an offender benefits from the Act\nif his sentence was vacated prior to the Act’s enactment date, but reserv-\ning judgment as to postenactment vacatur).\n\f6                 HEWITT v. UNITED STATES\n\n                      Opinion of the Court\n\nmerits of their appeals, the Court appointed Michael H.\nMcGinley as amicus curiae to defend the judgment below.\n</pre><span class=\"citation no-link\">603 U. S. ___</span><pre class=\"inline\"> (2024). He has ably discharged his responsi-\nbilities.\n                              III\n  The Fifth Circuit held, and amicus and the dissent con-\ntend, that §403(b) excludes any defendant who was sen-\ntenced prior to the enactment date of the First Step Act—\neven if his sentence was later vacated. That is so, in their\nview, because the Act applies only “if a sentence for the of-\nfense has not been imposed as of ” the Act’s enactment date,\nand a sentence “has . . . been imposed” upon that defendant\nas a matter of historical fact. </pre><span class=\"citation no-link\">132 Stat. 5222</span><pre class=\"inline\"> (emphasis\nadded). But based on the text of §403(b) and the nature of\nvacatur, we conclude that a sentence has been imposed for\npurposes of that provision if, and only if, the sentence is ex-\ntant—i.e., has not been vacated.\n                              A\n   To understand why this is so, focus first on the language\nCongress used. Most notably, the operative phrase is not\nwritten in the past-perfect tense, excluding anyone upon\nwhom a sentence “had” been imposed. Rather, Congress\nemployed the present-perfect tense—thereby requiring\nevaluation of whether “a sentence . . . has . . . been imposed”\nupon the defendant. §403(b), </pre><span class=\"citation no-link\">132 Stat. 5222</span><pre class=\"inline\"> (emphasis\nadded). In this context, that distinction makes a difference.\nSee United States v. Wilson, </pre><span class=\"citation\" data-id=\"9432497\"><a href=\"/opinion/112711/united-states-v-wilson/#333\" aria-description=\"Citation for case: United States v. Wilson\">503 U. S. 329, 333</a></span><pre class=\"inline\"> (1992)\n(“Congress’ use of a verb tense is significant in construing\nstatutes”).\n   The present-perfect tense can refer to either (1) “an act,\nstate, or condition that is now completed” or (2) “a past ac-\ntion that comes up to and touches the present.” The Chicago\nManual of Style §5.132, p. 268 (17th ed. 2017) (emphasis\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                       7\n\n                           Opinion of the Court\n\nadded). But when used in either sense, the tense simulta-\nneously “involves reference to both past and present.” R.\nHuddleston &amp; G. Pullum, The Cambridge Grammar of the\nEnglish Language 143 (2002). That is, while “the primary\nfocus is on the present,” the past maintains “ ‘current rele-\nvance.’ ” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\"> (confirming that the present-perfect tense ad-\ndresses “a time-span beginning in the past and extending\nup to now”).5 Thus, one might employ the present-perfect\ntense to describe situations “involv[ing] a specific change of\nstate” that produces a “continuing result.” </pre><span class=\"citation no-link\">Id., at 145</span><pre class=\"inline\"> (bold-\nface deleted).\n  Here is an example. Suppose the U. S. Olympic Commit-\ntee enacted a rule stating that athletes may call themselves\nOlympic champions if a gold medal “has been awarded” to\nthem. Pursuant to that rule, a U. S. sprinter who took first\nplace in the 2016 Summer Olympics’ 100-meter finals could\nvalidly proclaim—today—that she is “an Olympic cham-\npion.” The existence of her win as a historical event triggers\nthe rule’s proper application, because it gives rise to the in-\nference that the athlete remains an Olympic gold medalist\nat present, thereby justifying her continued use of the\n“Olympic champion” title. See </pre><span class=\"citation no-link\">ibid.</span><pre class=\"inline\"> (explaining that the rel-\nevant “connection with the present” here would be “that the\nresultant state still obtains now”).\n  But now imagine that the Olympic Committee stripped\nthis sprinter of her medal after discovering that she used\n——————\n   5 A primary flaw of the dissent’s textual argument is its failure to ap-\n\npreciate that, under either meaning of the present perfect, the event in\nquestion must relate to now. In other words, while the dissent accurately\nobserves that the present-perfect tense can be used in one of two ways,\nsee post, at 4 (opinion of ALITO, J.), it ignores that neither refers to cir-\ncumstances that are wholly in the past. What makes this the present-\nperfect tense is that, in each of its manifestations, there exists a connec-\ntion to the present. See Huddleston, Cambridge Grammar of the English\nLanguage, at 143 (confirming that references “to times wholly before\nnow”—when the present “is explicitly or implicitly excluded”—are\nlargely “incompatible with the present perfect”).\n\f8                    HEWITT v. UNITED STATES\n\n                          Opinion of the Court\n\nperformance-enhancing drugs during the competition. Can\nthat athlete, under the rule, still call herself an Olympic\nchampion? The answer is no. Yes, she had been awarded\nsuch a medal, but it was revoked; the fact that she stood on\nthe podium and was declared the winner in 2016 is inappo-\nsite for purposes of establishing whether she qualifies for\nOlympic-champion bragging rights under the rule today.6\n   When used in this way, the present-perfect tense conveys\nto a listener that the event in question continues to be true\nor valid. The dissent counters that, for purposes of the First\nStep Act, the relevant moment of analysis should not be the\npresent, but rather the statute’s date of enactment. See\npost, at 4–5. But that reframing is inconsistent with nor-\nmal understandings of the present-perfect tense, which by\ndefinition focuses on the present.7 Today, if an event is\nmerely a relic of history because it was voided by a subse-\nquent action, the past-perfect (not the present-perfect)\ntense would usually be the more appropriate verb choice.\nSee B. Garner, Modern English Usage 1082 (5th ed. 2022)\n\n——————\n   6 The dissent does not dispute that a sprinter who is divested of her\n\ngold medal no longer qualifies as an “Olympic champion” under the hy-\npothetical rule. Nor does the dissent contest that, if the Committee\nwanted such a disqualified sprinter to be able to still claim the title, it\ncould phrase the rule in the past-perfect tense to accomplish that result\n(i.e., bestowing the honorific if a gold medal “had been awarded” to the\nathlete). The dissent’s primary response to this hypothetical is, instead,\nto zero in on “[t]he obvious purpose of the hypothetical rule” and to ex-\nplain that “the meaning of language is heavily dependent on context.”\nPost, at 10, n. 3. Part IV of this opinion fully addresses the context of\n§403(b)’s language and Congress’s primary objectives for enacting that\nprovision—both of which support the Court’s conclusion in this case.\n   7 And, notably, there is a relevant connection to the present in the op-\n\neration of §403(b) despite that statute’s express reference to the date of\nthe Act’s enactment: the current occasion of the sentencing of the defend-\nant in question. Sentencing courts read statutes at the moment of their\napplication—which, here, would be the moment of resentencing, not the\nmoment of enactment. From that proper vantage point, petitioners were\nnot subject to a sentence, as any previous sentence had been vacated.\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)            9\n\n                      Opinion of the Court\n\n(explaining that the past-perfect tense “represents an ac-\ntion as completed at some definite time in the past—that is,\nbefore some other past time referred to”); Chicago Manual\nof Style §5.133, at 268 (confirming that the past perfect “re-\nfers to an act, state, or condition that was completed before\nanother specified or implicit past time or past action”). Our\ndisqualified sprinter could thus still boast of her Olympic-\nchampion status if the rule were, instead, that any athlete\nwho “had been awarded” a gold medal was entitled to use\nthat honorific.\n    The fact that adjacent provisions of §403 contain past-\ntense verbs only strengthens the conclusion that §403(b)’s\nuse of the present-perfect tense is meaningful. Cf. Barrett\nv. United States, </pre><span class=\"citation\" data-id=\"9426236\"><a href=\"/opinion/109341/barrett-v-united-states/#217\" aria-description=\"Citation for case: Barrett v. United States\">423 U. S. 212, 217</a></span><pre class=\"inline\"> (1976) (emphasizing\nwhen Congress “used the present perfect tense . . . in con-\ntrast to its use of the present tense” elsewhere in the stat-\nute). Section 404(c), for example, utilizes the simple past\ntense to address a defendant’s prior sentencing. See </pre><span class=\"citation no-link\">132\nStat. 5222</span><pre class=\"inline\"> (“No court shall entertain a motion made under\nthis section to reduce a sentence if the sentence was previ-\nously imposed or previously reduced in accordance with”\nthe relevant amendments (emphasis added)). The past\ntense also features earlier in §403(b) itself. See ibid. (cov-\nering “any offense that was committed before the date of\nenactment of [the] Act” (emphasis added)). But the verb\ntense at issue here (“has been”) is conspicuously different—\nmaking only clearer that a past sentence must have a rele-\nvant connection to the present for purposes of the retroac-\ntivity provision.\n    Indeed, amicus and the dissent’s historical-fact reading\nof §403(b) calls so naturally for the past-perfect tense that\njurists who share this view often employ that tense by de-\nfault. The Fifth Circuit below, for instance, stated that “the\nFirst Step Act applies to defendants for whom ‘a sentence\n. . . ha[d] not been imposed’ as of the enactment date.” 92\nF. 4th, at 310 (alteration in original). Other courts have\n\f10                HEWITT v. UNITED STATES\n\n                       Opinion of the Court\n\nconstrued §403(b) similarly. See, e.g., United States v.\nJackson, </pre><span class=\"citation no-link\">995 F. 3d 522</span><pre class=\"inline\">, 525 (CA6 2021) (noting that “as of\nDecember 21, 2018, a sentence had been imposed” upon the\ndefendant, even though it was later vacated). Congress of\ncourse “could have phrased its requirement in language\nthat looked to the past . . . , but it did not choose this readily\navailable option.” Gwaltney of Smithfield, Ltd. v. Chesa-\npeake Bay Foundation, Inc., </pre><span class=\"citation\" data-id=\"9431144\"><a href=\"/opinion/111966/gwaltney-of-smithfield-ltd-v-chesapeake-bay-foundation-inc/#57\" aria-description=\"Citation for case: Gwaltney of Smithfield, Ltd. v. Chesapeake Bay...\">484 U. S. 49, 57</a></span><pre class=\"inline\"> (1987). The\nnatural inference, then, is that Congress meant what it\nsaid, and, thus, that §403(b) covers only past sentences with\ncontinued legal validity, not those that have been vacated.\n                                B\n   Background principles regarding the legal effect of vaca-\ntur confirm that a sentence has been imposed for §403(b)\npurposes only so long as it remains valid. When interpret-\ning statutes, we “recogniz[e] that ‘Congress legislates\nagainst the backdrop,’ of certain unexpressed presump-\ntions.” Bond v. United States, </pre><span class=\"citation\" data-id=\"2676593\"><a href=\"/opinion/2676593/bond-v-united-states/#857\" aria-description=\"Citation for case: Bond v. United States\">572 U. S. 844, 857</a></span><pre class=\"inline\"> (2014)\n(quoting EEOC v. Arabian American Oil Co., </pre><span class=\"citation\" data-id=\"9432237\"><a href=\"/opinion/112565/equal-employment-opportunity-commission-v-arabian-american-oil-co/#248\" aria-description=\"Citation for case: Equal Employment Opportunity Commission v. Arabian...\">499 U. S. 244,\n248</a></span><pre class=\"inline\"> (1991)). One such presumption is that vacated court\norders are void ab initio and thus lack any prospective legal\neffect. See United States v. Ayres, </pre><span class=\"citation\" data-id=\"88199\"><a href=\"/opinion/88199/united-states-v-ayres/#610\" aria-description=\"Citation for case: United States v. Ayres\">9 Wall. 608, 610</a></span><pre class=\"inline\"> (1870)\n(“[V]acating the former judgment . . . render[s] it null and\nvoid, and the parties are left in the same situation as if no\ntrial had ever taken place in the cause”). By operation of\nlegal fiction, the law acts as though the vacated order never\noccurred.\n   A criminal defendant whose judgment of conviction has\nbeen vacated, for example, is to be treated going forward as\nthough he were never convicted. See Fiswick v. United\nStates, </pre><span class=\"citation\" data-id=\"104336\"><a href=\"/opinion/104336/fiswick-v-united-states/#223\" aria-description=\"Citation for case: Fiswick v. United States\">329 U. S. 211, 223</a></span><pre class=\"inline\"> (1946) (confirming that one whose\nconviction is vacated “stand[s] in the position of any [per-\nson] who has been accused of a crime but not yet shown to\nhave committed it”). Thus, if Congress were to pass a stim-\nulus provision that gives checks to any small-business\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                     11\n\n                           Opinion of the Court\n\nowner who “has not been convicted of fraud,” an owner\nwould not be rendered ineligible on the basis of a fraud con-\nviction that was overturned on appeal. While the owner\nhad been convicted of fraud, that judgment was invalidated\nand therefore became legally inoperable. In other words,\nthat vacated conviction is subsequently treated as no con-\nviction at all. See North Carolina v. Pearce, </pre><span class=\"citation\" data-id=\"9424091\"><a href=\"/opinion/107978/north-carolina-v-pearce/#721\" aria-description=\"Citation for case: North Carolina v. Pearce\">395 U. S. 711,\n721</a></span><pre class=\"inline\"> (1969) (verifying that vacatur causes a conviction to be\n“wholly nullified and the slate wiped clean”).8\n  Section 403(b) reflects this “common-sense” understand-\ning of background vacatur principles. Lewis v. United\nStates, </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#61\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S. 55, 61, n. 5</a></span><pre class=\"inline\"> (1980). Just as defendants\nwith vacated prior felony convictions are not precluded from\npossessing weapons under the federal felon-in-possession\nban, §403(b) retroactivity does not exclude from its ambit\nthose whose prior sentences have been vacated. See ibid.;\n</pre><span class=\"citation no-link\">18 U. S. C. §922</span><pre class=\"inline\">(g)(1); see also Pepper v. United States, </pre><span class=\"citation\" data-id=\"7260396\"><a href=\"/opinion/7342461/pepper-v-united-states/#507\" aria-description=\"Citation for case: Pepper v. United States\">562\nU. S. 476, 507</a></span><pre class=\"inline\"> (2011) (explaining that vacatur of a criminal\nsentence “wipe[s] the slate clean”).\n  By authorizing retroactive application of the First Step\n——————\n  8 The dissent erroneously suggests that, under our precedents, a va-\n\ncated sentence continues to exist as a historical fact and thus retains\nprospective legal effect. See post, at 12–14. But the cases it cites do not\nsupport that contention. In Lewis v. United States, </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S. 55</a></span><pre class=\"inline\"> (1980),\nfor example, we considered whether the invalidity of one’s predicate fel-\nony conviction precludes conviction as a felon in possession of a weapon\nunder federal law. </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#58\" aria-description=\"Citation for case: Lewis v. United States\">Id., at 58</a></span><pre class=\"inline\">. We concluded the federal conviction could\nstand when the defendant’s prior felony conviction had “never been over-\nturned”—i.e., vacated—at the time he possessed the weapon. </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#57\" aria-description=\"Citation for case: Lewis v. United States\">Id., at 57</a></span><pre class=\"inline\">.\nBut we dismissed as “extreme” arguments suggesting that a vacated con-\nviction could have such prospective legal effect. </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#61\" aria-description=\"Citation for case: Lewis v. United States\">Id., at 61, n. 5</a></span><pre class=\"inline\"> (confirm-\ning the “common-sense” notion that “a disability based upon one’s status\nas a convicted felon” ceases as a matter of law as soon as “the conviction\nupon which that status depends has been vacated”). Bravo-Fernandez v.\nUnited States, </pre><span class=\"citation no-link\">580 U. S. 5</span><pre class=\"inline\"> (2016), is similarly unhelpful. That case con-\ncerned issue preclusion and jury findings and does not stand for the prop-\nosition that a vacated order itself retains continuing legal effect in the\nrelevant sense.\n\f12                  HEWITT v. UNITED STATES\n\n                         Opinion of JACKSON, J.\n\nAct’s more lenient penalties on any eligible offender upon\nwhom “a sentence . . . has not been imposed,” the text of\n§403(b) indicates that only past sentences with continued\nvalidity preclude application of the Act’s new penalties. A\njudge would thus correctly conclude at resentencing that, if\nan offender’s past sentence has been vacated, a sentence\n“has not been imposed” upon that offender for purposes of\nthe First Step Act; hence, the court can impose a new sen-\ntence today.\n                             IV\n                              A\n  The context and enactment history of the First Step Act\nand §403(b) further demonstrate that Congress’s choice of\nthe present-perfect tense was not accidental. Rather, Con-\ngress was reacting to sustained criticism of the prior sen-\ntencing scheme, and with §403(b), it intended to execute a\nclean break from the controversial and heavily contested\n“stacking” practice.\n  Sentencing judges had been among the harshest critics.\nBefore the First Step Act was enacted, more than one vet-\neran District Court Judge decried how the “stacking” pun-\nishment for first-time §924(c) offenders was “grossly dispro-\nportionate” and “shockingly harsh given the nature” of the\noffenses and a defendant’s “lack of criminal history.”\nUnited States v. Washington, </pre><span class=\"citation\" data-id=\"2511428\"><a href=\"/opinion/2511428/united-states-v-washington/#1309\" aria-description=\"Citation for case: United States v. Washington\">301 F. Supp. 2d 1306, 1309</a></span><pre class=\"inline\">\n(MD Ala. 2004) (lamenting the requirement of a 40-year\nterm of imprisonment for a 22-year-old first-time offender,\nand remarking that it was “the worst and most unconscion-\nable sentence [the judge] ha[d] given in his 23 years on the\nfederal bench”).9 Judges on the Federal Courts of Appeals\n——————\n  9 See also, e.g., United States v. Holloway, </pre><span class=\"citation\" data-id=\"7228517\"><a href=\"/opinion/7310613/united-states-v-holloway/#312\" aria-description=\"Citation for case: United States v. Holloway\">68 F. Supp. 3d 310, 312</a></span><pre class=\"inline\">\n\n(EDNY 2014) (noting that §924(c) stacking “produce[d] sentences that\nwould be laughable if only there weren’t real people on the receiving end\nof them”); United States v. Angelos, </pre><span class=\"citation\" data-id=\"2572714\"><a href=\"/opinion/2572714/united-states-v-angelos/\" aria-description=\"Citation for case: United States v. Angelos\">345 F. Supp. 2d 1227</a></span><pre class=\"inline\">, 1244–1245,\n1248 (Utah 2004) (assailing being required to give a 24-year-old who had\n\f                     Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                    13\n\n                         Opinion of JACKSON, J.\n\nalso “join[ed] in the litany of criticisms directed towards”\n§924(c)’s penalty regime for requiring the imposition of sen-\ntences that were “ ‘out of this world.’ ” United States v.\nHunter, </pre><span class=\"citation\" data-id=\"9804456\"><a href=\"/opinion/2746012/united-states-v-eric-michelle-hunter/\" aria-description=\"Citation for case: United States v. Eric Michelle Hunter\">770 F. 3d 740</a></span><pre class=\"inline\">, 746–747 (CA8 2014) (Bright, J., con-\ncurring); see also United States v. Hungerford, </pre><span class=\"citation\" data-id=\"9817704\"><a href=\"/opinion/3039168/united-states-v-hungerford/\" aria-description=\"Citation for case: United States v. Hungerford\">465 F. 3d\n1113</a></span><pre class=\"inline\">, 1118–1119 (CA9 2006) (Reinhardt, J., concurring in\njudgment) (deeming “irrational, inhumane, and absurd” the\nmandatory 159-year sentence imposed upon “a 52 year-old\nmentally disturbed woman with no prior criminal record”\nwho had otherwise “led a spotless, law-abiding existence”);\nUnited States v. Smith, </pre><span class=\"citation\" data-id=\"9800172\"><a href=\"/opinion/2681328/united-states-v-smith/#1181\" aria-description=\"Citation for case: United States v. Smith\">756 F. 3d 1179, 1181</a></span><pre class=\"inline\"> (CA10 2014)\n(Gorsuch, J.) (observing that it was “no fanciful possibility”\nthat §924(c) stacking would lead to “prison term[s] of many\ndecades” that were “certain to outlast the defendant’s life\nand the lives of every person now walking the planet”).\n  Meanwhile, other institutional stakeholders raised simi-\nlarly pointed objections to Deal’s stacking system. In its\nannual report to Congress, the United States Sentencing\nCommission criticized how §924(c) stacking had “result[ed]\nin excessively severe and unjust sentences,” particularly in\ncases in which “the offense did not involve any physical\nharm or threat of physical harm to a person.” U. S. Sen-\ntencing Commission, Report to the Congress: Mandatory\nMinimum Penalties in the Federal Criminal Justice System\n359 (Oct. 2011). The United States Judicial Conference ex-\npressed similar concerns.10\n\n——————\npossessed weapons while dealing small amounts of marijuana “more\nthan doubl[e]” the sentence recommended for crimes resulting in “actual\nviolence to victims,” such as “hijack[ing]” an airplane, “detonat[ing] a\nbomb in a public place,” or committing “rap[e]” or “second-degree\nmurde[r]”).\n   10 See, e.g., Hearing before the Over-Criminalization Task Force of\n\n2014 of the House Committee on the Judiciary, 113th Cong., 2d Sess., 41\n(2014) (testimony of the Hon. Irene Keeley, U. S. District Judge, Judicial\nConference of the U. S.) (explaining that §924(c) stacking produced “par-\nticularly egregious” sentences for first-time offenders that ran “contrary\n\f14                   HEWITT v. UNITED STATES\n\n                         Opinion of JACKSON, J.\n\n   The problem, as all seemed to recognize, was not that fed-\neral law permitted judges to impose lengthy sentences with\nrespect to first-time §924(c) offenders—it was that the stat-\nute, as Deal had interpreted it, required it. District judges\ncould not adhere to the statutory command that they give\nsentences that are “sufficient, but not greater than neces-\nsary, to comply with the purposes” of punishment, </pre><span class=\"citation no-link\">18\nU. S. C. §3553</span><pre class=\"inline\">(a), if they were also required to sentence\nfirst-time offenders to §924(c)’s unduly harsh mandatory\nminimum penalties. Additionally problematic was the fact\nthat, while federal law requires sentencing judges to “avoid\nunwarranted sentence disparities among defendants,”\n§3553(a)(6), the variation among prosecutors’ charging\npractices meant that §924(c) stacking was a reality for only\nsome first-time offenders.11\n   With sentencing judges routinely imposing what\namounted to mandatory life sentences on first-time §924(c)\noffenders, in 2018, Congress eventually heeded the public\n——————\nto the interests of justice” and “undermine[d] confidence” in its admin-\nistration).\n   11 The policies of U. S. Attorney’s Offices diverged as to when—or\n\nwhether—they would bring multiple §924(c) counts, a decision over\nwhich judges lack any control. See id., at 45 (testimony of the Hon. Patti\nSaris, Chair, U. S. Sentencing Commission). This produced disparate\nsentencing outcomes for similarly situated offenders across judicial dis-\ntricts. See U. S. Sentencing Commission, Report to the Congress: Man-\ndatory Minimum Penalties in the Federal Criminal Justice System 361–\n362 (Oct. 2011) (attributing the “geographic concentration” associated\nwith §924(c) sentencing “to inconsistencies in the charging of multiple\nviolations of section 924(c)”); see also In re Hernandez, </pre><span class=\"citation\" data-id=\"9876064\"><a href=\"/opinion/4396064/in-re-orestes-hernandez/#1169\" aria-description=\"Citation for case: In Re: Orestes Hernandez\">857 F. 3d 1162,\n1169</a></span><pre class=\"inline\"> (CA11 2017) (Martin, J., concurring in result) (finding “troubling”\nthat the defendant “might never have received this [stacked] sentence if\nhe had been sentenced in another part of the country”). In one case in\nwhich prosecutors stacked additional §924(c) counts after the defendant\nrefused a plea offer, the District Judge specifically lamented the “risk of\nmassive sentencing disparity between identically-situated offenders\nwithin the federal system,” because other U. S. Attorney’s Offices might\nnot have proceeded in that same fashion. United States v. Angelos, </pre><span class=\"citation\" data-id=\"2572714\"><a href=\"/opinion/2572714/united-states-v-angelos/\" aria-description=\"Citation for case: United States v. Angelos\">345\nF. Supp. 2d 1227</a></span><pre class=\"inline\">, 1253–1254 (Utah 2004).\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                    15\n\n                         Opinion of JACKSON, J.\n\noutcry. An “extraordinary political coalition” formed, as\nmembers of Congress worked together to develop “a bipar-\ntisan sentencing and prison reform bill” to address §924(c)\nstacking. 164 Cong. Rec. S7645 (Dec. 17, 2018) (statement\nof Sen. Durbin); see also Brief for Sen. Richard J. Durbin\net al. as Amici Curiae 5–8 (Senators Brief ). The First Step\nAct was the much-anticipated, much-heralded fruit of their\nlabor—and one that many in Congress hoped would yield\nimmediate benefits. See id., at 17.12\n                              B\n   It is noteworthy for present purposes that the statute\nCongress crafted to depart from the much-maligned “stack-\ning” sentencing regime did so in a two-part fashion. First,\n§403(a) eliminated 25-year stacked sentences for first-time\n§924(c) offenders. Second, §403(b) addressed the retroac-\ntivity of the §403(a) benefit in a “ ‘targeted way,’ ” so as to\nensure that judges were no longer constrained to impose 25-\nyear stacked sentences on first-time §924(c) offenders mov-\ning forward. Id., at 15 (quoting 164 Cong. Rec., at S7645\n(statement of Sen. Durbin)).\n   That second part of Congress’s response—the focus of the\ncases before us today—was highly consequential. By dis-\nplacing the background rule that changes to sentencing\nstatutes apply only prospectively (to defendants who com-\nmit their offenses after the law’s effective date), Congress\nmade clear that the First Step Act’s more lenient penalties\nwere to apply to some “ ‘pending’ ” cases, too—i.e., the new\npenalties would be applicable to certain defendants who\nhad committed their offenses before the First Step Act.\n——————\n   12 The dissent agrees that our job is to “interpret what Congress meant”\n\nby the words in §403(b). Post, at 4. Here, Congress’s desire to change\nthe derided, draconian sentencing stacking scheme Deal had created\ncould not be clearer. Thus, far from “march[ing] in the parade of sen-\ntencing reform,” post, at 2, we are merely observing the events and cir-\ncumstances that led Congress to take up the banner of sentencing reform\nitself.\n\f16                HEWITT v. UNITED STATES\n\n                     Opinion of JACKSON, J.\n\nSenators Brief 15 (quoting §403(b), </pre><span class=\"citation no-link\">132 Stat. 5222</span><pre class=\"inline\">). Per\n§403(b), any defendant who still needed to be sentenced as\nof the First Step Act’s effective date would receive the Act’s\nmore lenient penalties. Thus, as a practical matter, judges\nwould no longer have to impose harsh “stacked” sentences\nupon first-time §924(c) offenders.\n   Notably, because §403(b) retroactivity was only partial, it\ndiffered substantially from the full retroactivity Congress\nemployed with respect to other kinds of penalty changes it\ninstituted in the First Step Act. See, e.g., §404(b), </pre><span class=\"citation no-link\">132 Stat.\n5222</span><pre class=\"inline\">; Terry v. United States, </pre><span class=\"citation no-link\">593 U. S. 486</span><pre class=\"inline\">, 491 (2021) (ex-\nplaining that Congress made the First Step Act’s statutory\nchanges to the crack-cocaine minimums fully retroactive,\nand thus “gave courts authority to reduce the sentences” of\npreviously sentenced crack offenders, where applicable).\nCongress certainly had the full-retroactivity option before\nit when it crafted §403; indeed, earlier versions of the Act\nwould have extended §403(a) benefits to at least some\n§924(c) offenders who were already sentenced. See, e.g.,\nSentencing Reform Act of 2015, H. R. 3713, 114th Cong., 2d\nSess., §5(b)(2), pp. 14–16 (2016) (providing for reduced\nterms of imprisonment in “certain past cases” (capitaliza-\ntion and italics deleted)); Sentencing Reform and Correc-\ntions Act of 2017, S. 1917, 115th Cong., 1st Sess., §104(b)(2),\npp. 13–15 (2017) (permitting “sentence reduction” for cer-\ntain “past cases” (capitalization deleted)). But authorizing\nthe reopening of closed cases upends finality and can also\nbe administratively burdensome. See Senators Brief 15\n(noting that Congress forwent full retroactivity to serve “ju-\ndicial economy” and “preserv[e] sentences that were actu-\nally valid and final”). Section 403’s partial retroactivity\navoided these problems, while still advancing Congress’s\naim of changing how first-time §924(c) defendants are sen-\ntenced.\n   In short, §403(b)—a middle-ground solution to the prob-\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)            17\n\n                     Opinion of JACKSON, J.\n\nlem of harsh “stacked” sentences for first-time §924(c) of-\nfenders—reflected a balance of Congress’s policy objectives.\nBy leaving intact §924(c) sentences that judges had already\nimposed, Congress reinforced its interest in finality and\navoided burdening district courts with additional litigation.\nBut it also substantially advanced its goal of returning a\nsignificant amount of sentencing discretion to district court\njudges moving forward, by giving retroactive effect to the\nAct’s more lenient penalties for those first-time §924(c) of-\nfenders who had yet to be sentenced.\n                                V\n   The reading of §403(b) that petitioners and the Govern-\nment promote thus coheres with the text, context, and his-\ntory of that provision. Under this view, First Step Act sen-\ntencing benefits apply to all first-time §924(c) offenders\nsentenced after the Act’s enactment date (whether it is an\ninitial sentencing or a resentencing). This means that\n§403(b)’s retroactivity line falls between those past §924(c)\noffenders with final sentences that are still in effect, on the\none hand, and those who still need to be sentenced for their\n§924(c) offense, on the other. The former are stuck with\ntheir old sentences, for finality reasons, while the latter are\neligible for First Step Act benefits at resentencing, since\nthey have to be sentenced regardless.\n   Under amicus and the dissent’s reading, however, there\nexists a further line of division within the group of offenders\nwho currently lack a sentence—separating those who have\nbeen sentenced previously for the §924(c) offense at issue\nfrom those who have not. For individuals in the former\ncamp, per amicus and the dissent, a judge must return to\nthe superseded sentencing scheme and impose stacked 25-\nyear sentences when such defendants are resentenced.\n   Carving up the yet-to-be-sentenced group of offenders in\nthis way does not reflect Congress’s intent. See Senators\nBrief 17 (a bipartisan group of Senators, explaining that\n\f18               HEWITT v. UNITED STATES\n\n                    Opinion of JACKSON, J.\n\n“[t]he considerations animating the First Step Act’s enact-\nment undermine any suggestion that Congress intention-\nally excluded from Section 403’s reach pre-Act offenders\nwhose sentences are invalid as a matter of law”). Nor does\nit comport with the statutory scheme that Congress en-\nacted, for two primary reasons.\n   First, the text and context of §403(b) do not support dif-\nferentiating between §924(c) offenders on the mere basis of\nthe historical fact of a past sentencing (as we explained in\nPart III, supra), and, frankly, it is not clear what distin-\nguishing between previously sentenced and never-before-\nsentenced offenders would accomplish. The prior imposi-\ntion of a sentence does not bear on finality; if the offender\ncurrently lacks a sentence, then a court will have to resen-\ntence the defendant in any event. And though it would\nmake sense to draw the line as amicus and the dissent do if\nthe prior imposition of a sentence helped judges to more ac-\ncurately identify serious first-time §924(c) offenders—po-\ntentially justifying the harsh and outdated stacked penal-\nties that the First Step Act supplanted—nothing in the\nlegislative record suggests this is so. Stated simply: The\ndistinction between previously sentenced defendants and\nthose who have never been sentenced before seems to make\nno difference in terms of the retroactivity aims of the stat-\nute.\n   By contrast, requiring judges to impose Deal-era stacked\n§924(c) sentences at resentencings runs headlong into the\nanimating aims of the First Step Act. See Miller v. French,\n</pre><span class=\"citation\" data-id=\"9433979\"><a href=\"/opinion/118378/miller-v-french/#341\" aria-description=\"Citation for case: Miller v. French\">530 U. S. 327, 341</a></span><pre class=\"inline\"> (2000) (rejecting an interpretation that\nwould undermine the statute and run “plainly contrary to\nCongress’ intent in enacting” it). Neither amicus nor the\ndissent can explain why Congress would have wanted sen-\ntencing judges, who are presently working to dole out pro-\nportionate plenary sentences under the new regime, to have\nto return to the draconian, pre-Act scheme for offenders\nwho just happen to be facing resentencing, as opposed to\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)           19\n\n                      Opinion of the Court\n\nfirst sentencing. Requiring that kind of reversion prevents\njudges from uniformly moving past Deal, which was the pri-\nmary point of Congress’s enactment of §403.\n   Second, the reading of §403(b) that we adopt today is\nplainly more administrable than the one amicus and the\ndissent offer. Amicus argues that his interpretation is easy\nto apply, because a district judge only needs to know\nwhether a prior sentence had ever been imposed upon the\ndefendant for the relevant offense. But that knowledge is\nnot enough—the sentencing judge would still need to refer-\nence, recall, and apply the superseded “stacking” regime, if\napplicable. And there is a much more straightforward way\nto administer §403(b): From the Act’s enactment date on-\nward, sentencing judges impose the First Step Act’s less-\nened mandatory minimums for any first-time §924(c) of-\nfender—full stop. This reading of §403(b) requires no\nadditional effort on the part of the judge to track down a\ndefendant’s sentencing history or to confirm what manda-\ntory minimums previously governed. And it allows district\njudges to treat all first-time §924(c) defendants who appear\nbefore them for sentencing in an equitable manner that\nminimizes sentencing disparities, consistent with Con-\ngress’s sentencing directives.\n                         *    *    *\n   Under the interpretation of §403(b) we adopt today, all\nfirst-time §924(c) offenders who appear for sentencing after\nthe First Step Act’s enactment date—including those whose\nprevious §924(c) sentences have been vacated and who thus\nneed to be resentenced—are subject to the Act’s revised\npenalties. The Fifth Circuit’s contrary reading of §403(b) is\nreversed, and its judgment in these cases is remanded for\nfurther proceedings.\n                                             It is so ordered.\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)          1\n\n                      ALITO, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n            TONY R. HEWITT, PETITIONER\n23–1002                 v.\n                  UNITED STATES\n\n   COREY DEYON DUFFEY, ET AL., PETITIONERS\n23–1150             v.\n              UNITED STATES\n ON PETITIONS FOR WRITS OF CERTIORARI TO THE UNITED\n   STATES COURT OF APPEALS FOR THE FIFTH CIRCUIT\n        Nos. 23–1002 and 23–1150. Decided June 26, 2025\n\n   JUSTICE ALITO, with whom JUSTICE THOMAS, JUSTICE\nKAVANAUGH, and JUSTICE BARRETT join, dissenting.\n   In the First Step Act of 2018, Congress reduced the\nmandatory-minimum sentence for certain firearm offenses.\nLike all changes to sentencing law, this amendment applies\nprospectively. But Congress also thought it wise to apply\nthe amendment to “Pending Cases.” Of course, “Pending\nCases” does not mean “All Cases,” and Congress limited the\nretroactive reach of the amendment to defendants for whom\n“a sentence for the offense has not been imposed as of [the\nAct’s] date of enactment.” </pre><span class=\"citation no-link\">132 Stat. 5222</span><pre class=\"inline\">. In other words,\nthe amendment applies retroactively only if the defendant\nhad yet to be sentenced when Congress passed the Act in\n2018. Petitioners, who were sentenced in 2010, do not come\nclose to meeting that test.\n   Today, the Court disfigures the Act in order to reach a\ndifferent result. Its interpretation relies on two necessary\npremises. First, the Court insists that what Congress re-\nally meant to say is that the amendment applies retroac-\ntively unless “a legally valid sentence” is in force on the\nAct’s date of enactment. Second, to get around the fact that\npetitioners did have “legally valid” sentences when the Act\n\f2                 HEWITT v. UNITED STATES\n\n                       ALITO, J., dissenting\n\nwas passed, the Court invents a novel “vacatur” principle.\nThe Court tells us that the 2022 vacatur of petitioners’ sen-\ntences rendered those sentences legal nullities from their\ninception. The Court’s interpretation thus unspools the\nAct’s carefully wound retroactivity command to mean that\nany defendant whose sentence is vacated at any time and\nfor any reason may claim the benefit of the Act’s reduced\nmandatory minimum. But nothing in the text or broader\ncontext supports such a boundless interpretation. Indeed,\nthe portions of today’s decision that command the votes of\nonly three Justices give the game away. Animating the\nCourt’s atextual interpretation is a thinly veiled desire to\nmarch in the parade of sentencing reform. But our role is\nto interpret the statute before us, not overhaul criminal\nsentencing.\n                               I\n   Sixteen years ago, a jury convicted petitioners Corey\nDuffey, Tony Hewitt, and Jarvis Ross of multiple </pre><span class=\"citation no-link\">18 U. S. C.\n§924</span><pre class=\"inline\">(c) offenses for use of a firearm in furtherance of a\ncrime of violence. At the time, first-time §924(c) offenders\nlike petitioners could receive, after a single trial, a 5-year\nmandatory-minimum sentence for an initial §924(c) convic-\ntion and a consecutive 25-year mandatory-minimum sen-\ntence for each “second or subsequent” §924(c) conviction.\nSee §§924(c)(1)(A)(i), (c)(1)(C), (c)(1)(D)(ii) (2012 ed.); Deal\nv. United States, </pre><span class=\"citation\" data-id=\"9432802\"><a href=\"/opinion/112860/deal-v-united-states/#137\" aria-description=\"Citation for case: Deal v. United States\">508 U. S. 129, 137</a></span><pre class=\"inline\"> (1993). In 2010, the\nDistrict Court sentenced petitioners under this so-called\nstacking procedure, and after a remand, the District Court\nresentenced petitioners in 2012. Direct review of their con-\nvictions and sentences was complete by 2015. See United\nStates v. Ross, </pre><span class=\"citation\" data-id=\"2641685\"><a href=\"/opinion/2641685/united-states-v-jarvis-ross/#545\" aria-description=\"Citation for case: United States v. Jarvis Ross\">544 Fed. Appx. 544, 545</a></span><pre class=\"inline\"> (CA5 2013) (per cu-\nriam) (dismissing Duffey’s appeal because it presented “no\nnonfrivolous issue for appellate review”); United States v.\nRoss, </pre><span class=\"citation\" data-id=\"2741040\"><a href=\"/opinion/2741040/united-states-v-jarvis-ross/\" aria-description=\"Citation for case: United States v. Jarvis Ross\">582 Fed. Appx. 528</a></span><pre class=\"inline\"> (CA5 2014) (per curiam) (affirm-\ning Hewitt’s and Ross’s sentences); Hewitt v. United States,\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)            3\n\n                      ALITO, J., dissenting\n\n</pre><span class=\"citation no-link\">574 U. S. 1201</span><pre class=\"inline\"> (2015) (denying Hewitt’s petition for a writ\nof certiorari).\n   Petitioners’ sentences had thus long been final when Con-\ngress enacted the First Step Act on December 21, 2018. The\nAct introduced a bevy of sentencing reforms, including an\namendment that eliminated the practice of §924(c) sentence\nstacking. See 132 Stat. 5221–5222. Although it had previ-\nously considered applying this amendment to all §924(c) of-\nfenders (including those with final sentences), see S. 2123,\n114th Cong., 1st Sess., §104(b)(2) (2015) (reported by Com-\nmittee), Congress settled on a far narrower retroactivity\ncommand:\n      “APPLICABILITY TO PENDING CASES.—This section,\n    and the amendments made by this section, shall apply\n    to any offense that was committed before the date of\n    enactment of this Act, if a sentence for the offense has\n    not been imposed as of such date of enactment.” </pre><span class=\"citation no-link\">132\n    Stat. 5222</span><pre class=\"inline\">.\nOn the “date of enactment,” petitioners’ 2012 sentences re-\nmained in full force. As such, petitioners did not move to\nreduce their sentences in the immediate aftermath of the\nAct’s passage.\n  But several strokes of good fortune soon came petitioners’\nway. The year after Congress passed the First Step Act, we\nheld in United States v. Davis, </pre><span class=\"citation no-link\">588 U. S. 445</span><pre class=\"inline\">, 448 (2019),\nthat §924(c)’s residual clause is unconstitutionally vague.\nThen, later that same year, the Fifth Circuit determined\nthat Davis should apply retroactively. See United States v.\nReece, </pre><span class=\"citation no-link\">938 F. 3d 630</span><pre class=\"inline\">, 635 (2019). Seeking to take advantage\nof these fortuitous developments, petitioners successfully\nmoved to set aside some, though not all, of their §924(c) con-\nvictions that were predicated on the residual clause. Alt-\nhough the District Court could have vacated petitioners’\nsentences for only those invalid §924(c) counts, petitioners\ncaught yet another lucky break. The District Court opted\n\f4                 HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\nto vacate their entire sentences and ordered plenary resen-\ntencing on the remaining counts. Petitioners now try to\npush their luck even further, contending that the District\nCourt should apply the First Step Act’s reduced mandatory\nminimum for their remaining §924(c) counts.\n                                II\n  As all agree, petitioners’ argument requires us to inter-\npret what Congress meant when it said “a sentence for the\noffense has not been imposed as of [the Act’s] date of enact-\nment.” What first jumps out about this provision is that\nCongress used the present-perfect tense in the phrase “has\nnot been imposed.” The present-perfect tense “denotes an\nact, state, or condition that” is either (1) “now completed” or\n(2) “continues up to the present.” The Chicago Manual of\nStyle §5.132, p. 268 (17th ed. 2017).\n  Context often indicates whether a speaker is using the\nformer sense of the present-perfect tense (e.g., “he has been\nawarded a trophy”) or the latter sense of the present-perfect\ntense (e.g., “he has trained for a trophy for the last three\nyears”). See B. Garner, The Chicago Guide to Grammar,\nUsage, and Punctuation 97 (2016). Consider the following\nexample. Suppose I ask a man passing by a courthouse,\n“Has a sentence been imposed on John Smith?” He could\nrespond either, “Yes, on July 1” or “Yes, since July 1.” The\nformer response is perhaps the more natural one, and it as-\nsumes I asked for the historical fact of Smith’s sentencing\nin the indefinite past. The latter response is correct (though\nperhaps awkward), and it assumes I asked about the con-\ntinuing legal validity of Smith’s sentence up to the present.\n  The First Step Act’s “grammatical structure conceivably\nleaves some room for either reading,” United States v. Uri-\narte, </pre><span class=\"citation no-link\">975 F. 3d 596</span><pre class=\"inline\">, 607 (CA7 2020) (en banc) (Barrett, J.,\ndissenting), but petitioners lose either way. On one hand,\nthe phrase “a sentence . . . has . . . been imposed as of [the\nAct’s] date of enactment” could refer to the historical fact\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                        5\n\n                            ALITO, J., dissenting\n\nthat a district court imposed a sentence before the Act’s pas-\nsage, regardless of whether that sentence remains legally\nvalid in the future. This “historical-fact interpretation”\nplainly forecloses relief for petitioners because, as no one\ndisputes, the District Court first imposed their sentences\nwell before the Act’s passage.1 On the other hand, “a sen-\ntence . . . has . . . been imposed as of [the Act’s] date of en-\nactment” could mean that a defendant was subject to a le-\ngally valid sentence that continued to be in force on the\nAct’s enactment date. But again, petitioners did have le-\ngally valid sentences “as of [the Act’s] date of enactment,”\nso they lose under this “legal-validity interpretation” of the\nAct too.2\n——————\n   1 The Court dismisses the historical-fact interpretation out of hand be-\n\ncause, as it understands English grammar, the present-perfect tense re-\nquires “a connection to the present.” Ante, at 7, n. 5. But before pro-\nnouncing new rules of grammar, the Court might first consider\nconsulting the authorities it cites. See, e.g., R. Huddleston &amp; G. Pullum,\nThe Cambridge Grammar of the English Language 144 (2002) (noting\nthe “present perfect allows for the inclusion, under restrictive conditions,\nof a past time adjunct”). As these authorities suggest, the present-perfect\ntense allows one to say, for example, “[h]e has got up at five o’clock,” </pre><span class=\"citation no-link\">ibid.</span><pre class=\"inline\">\n(emphasis deleted), or “he has played golf before yesterday.”\n   2 The Act’s requirement that a sentence “has . . . been imposed as of\n\n[the Act’s] date of enactment” provides an essential temporal benchmark\nfor both the historical-fact and the legal-validity interpretation. Re-\nmarkably, however, the Court reads this requirement out of the Act en-\ntirely. The Court insists that sentencing courts should “read” the First\nStep Act at “the moment of resentencing,” without any reference to the\nAct’s enactment date. Ante, at 8, n. 7. But the Court is mistaken. It\nstarts on the right foot, acknowledging the “widely accepted modern leg-\nislative drafting convention that a law should not be read to speak as of\nthe date of enactment.” Carr v. United States, </pre><span class=\"citation\" data-id=\"9435613\"><a href=\"/opinion/147527/carr-v-united-states/#463\" aria-description=\"Citation for case: Carr v. United States\">560 U. S. 438, 463</a></span><pre class=\"inline\"> (2010)\n(ALITO, J., dissenting). This “convention” provides that, “except in unu-\nsual circumstances,” “all laws . . . should be written in the present tense”\nto ensure that a “ ‘legislative provision speaks as of any date on which it\nis read (rather than as of when drafted, enacted, or put into effect).’ ”\n</pre><span class=\"citation\" data-id=\"9435613\"><a href=\"/opinion/147527/carr-v-united-states/\" aria-description=\"Citation for case: Carr v. United States\">Ibid.</a></span><pre class=\"inline\"> (quoting Senate Office of the Legislative Counsel, Legislative Draft-\ning Manual §103(a), p. 4 (1997) (emphasis deleted)). But the First Step\nAct is such an “unusual circumstanc[e]” in which Congress deviated from\n\f6                   HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\n   Realizing the Act’s use of the present-perfect tense alone\ncannot help petitioners, the Court invents a novel “vacatur”\nprinciple to supercharge the legal-validity interpretation.\nThe Court tells us that the First Step Act incorporates the\nbackground “presumption” that “vacated court orders are\nvoid ab initio and thus lack any prospective legal effect.”\nAnte, at 10. This revamped version of the legal-validity in-\nterpretation means that “a sentence . . . has . . . been im-\nposed as of [the Act’s] date of enactment” if a defendant re-\nceives a legally valid sentence before the Act’s passage and\nthat sentence is never, at any future time, vacated. Under\nthis view, the 2022 vacatur of petitioners’ 2012 sentences\nimplies that, “[b]y operation of [a] legal fiction,” their 2012\nsentences “never occurred” and so could not have been le-\ngally valid as of the Act’s enactment date. Ibid.\n   The Court’s vacatur-inflected legal-validity interpreta-\ntion thus rests on two necessary premises. First, the legal-\nvalidity interpretation is superior to the historical-fact in-\nterpretation. Second, the Act incorporates the “vacatur”\nprinciple. If either premise falters, so does the Court’s in-\nterpretation. In my view, there is little doubt that both of\nthe necessary premises fail.\n                              III\n                               A\n  To start, the most plausible reading of the retroactivity\nprovision is that “a sentence . . . has . . . been imposed”\nwhen, as a matter of historical fact, a district court has sen-\ntenced a defendant. Subsequent legal changes—such as the\nvacatur of a previously imposed sentence—do not change\nthe purely historical fact that a defendant was, at a point\nin time, actually sentenced. When the Act asks whether a\nsentence “has . . . been imposed,” it refers to the unchanging\n——————\nthis “convention.” The Act takes the unusual steps of referencing the\ndate on which it was “enacted” and employing the present-perfect tense,\nnot the ordinary present tense.\n\f                   Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)              7\n\n                       ALITO, J., dissenting\n\nhistorical fact of sentencing and whether it occurred before\nthe “date of enactment.”\n   To see why, begin with the word “imposed.” A “sentence\nis imposed” when there is a “pronouncement of judgment.”\nLott v. United States, </pre><span class=\"citation\" data-id=\"9422257\"><a href=\"/opinion/106277/lott-v-united-states/#426\" aria-description=\"Citation for case: Lott v. United States\">367 U. S. 421, 426</a></span><pre class=\"inline\"> (1961); see Young\nv. United States, </pre><span class=\"citation no-link\">943 F. 3d 460</span><pre class=\"inline\">, 463 (CADC 2019) (“[I]n or-\ndinary usage a sentence is ‘imposed’ when the district court\npronounces it”). The Sentencing Reform Act treats the “im-\nposition” of a sentence as the moment when a district court\n“state[s] in open court the reasons for . . . the particular sen-\ntence.” </pre><span class=\"citation no-link\">18 U. S. C. §3553</span><pre class=\"inline\">(c); Black’s Law Dictionary 1470\n(12th ed. 2024) (defining “pronounce” as “announce for-\nmally”). The word “imposed” is thus most naturally under-\nstood to refer to a concrete “action by a district court” that\noccurs at a specific point in time. Uriarte, 975 F. 3d, at 607\n(Barrett, J., dissenting); see also United States v. Carpen-\nter, </pre><span class=\"citation no-link\">80 F. 4th 790</span><pre class=\"inline\">, 791 (CA6 2023) (Kethledge, J., concurring\nin denial of rehearing en banc) (“[T]he act of imposing a sen-\ntence could not possibly ‘continue up to the present’—be-\ncause the imposition of a sentence occurs at a fixed point in\ntime”). A defendant may be sentenced, resentenced, and\nresentenced again, and at each hearing a sentence is “im-\nposed” even if some of those sentences are later set aside as\nlegally invalid.\n   Our cases and other provisions of Title 18 confirm that\nthe word “imposed” marks the historical point at which a\nsentence is pronounced regardless of whether that sentence\nhas continuing legal validity. For example, in the midst of\na discussion about plenary resentencing (a topic of particu-\nlar relevance to these cases), we once noted that “[i]n re-\nmanded cases . . . trial courts have imposed a sentence on\nthe remaining counts longer than the sentence originally\nimposed on those particular counts.” Greenlaw v. United\nStates, </pre><span class=\"citation\" data-id=\"9435180\"><a href=\"/opinion/145784/greenlaw-v-united-states/#253\" aria-description=\"Citation for case: Greenlaw v. United States\">554 U. S. 237, 253</a></span><pre class=\"inline\"> (2008) (emphasis added). In an-\nother case, a joint opinion of the Court noted that the “death\n\f8                 HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\nsentences imposed for armed robbery, however, were va-\ncated.” Gregg v. Georgia, </pre><span class=\"citation\" data-id=\"9426555\"><a href=\"/opinion/109532/gregg-v-georgia/\" aria-description=\"Citation for case: Gregg v. Georgia\">428 U. S. 153</a></span><pre class=\"inline\">, 161–162 (1976)\n(opinion of Stewart, Powell, and Stevens, JJ.) (emphasis\nadded). In both instances, our use of “imposed” signified\nonly that a court had, at some point in time, pronounced a\nsentence. Our use of “imposed” could not possibly be under-\nstood to refer to the legal validity of those later-invalidated\nsentences. Further, in other parts of Title 18, Congress\nuses “imposed” to signify the historical fact of a sentence,\nnot its continuing legal validity. See, e.g., §3742(a)(2) (al-\nlowing a defendant to appeal “an otherwise final sentence\nif the sentence . . . was imposed as a result of an incorrect\napplication of the sentencing guidelines”); §3742(f )(1) (em-\npowering courts of appeals to remand on a finding that “the\nsentence was imposed in violation of law”). I see no reason\nto think Congress intended a different meaning of “im-\nposed” in another provision of Title 18.\n   Additional support for the historical-fact interpretation is\nfound in Congress’s use of the phrase “a sentence.” The\nword “a” is an “indefinite article” that “points to a non-\nspecific object, thing, or person that is not distinguished\nfrom the other members of a class.” B. Garner, Modern\nEnglish Usage 1195 (5th ed. 2022) (Modern English Usage).\n“When used as an indefinite article, ‘a’ means ‘[s]ome unde-\ntermined or unspecified particular.’ ” McFadden v. United\nStates, </pre><span class=\"citation no-link\">576 U. S. 186</span><pre class=\"inline\">, 191 (2015) (quoting Webster’s New\nInternal Dictionary 1 (2d ed. 1954)). In that sense, Con-\ngress’s use of the indefinite article lends a broad construc-\ntion to the word “sentence,” as if to say “any sentence” ever\nimposed, including a later-vacated sentence. In conjunction\nwith the word “imposed,” the phrase “a sentence” thus puts\nthe statutory focus on the existence of any kind of sentence\npronounced in the record, regardless of that sentence’s pre-\nsent legal status.\n   Indeed, contrary to the Court’s suggestion, the word “sen-\ntence” does not ineluctably mean a “legally valid” sentence.\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)             9\n\n                      ALITO, J., dissenting\n\nOur own cases prove the point because we have often found\nit necessary to clarify whether a sentence is valid or invalid.\nSee, e.g., Swarthout v. Cooke, </pre><span class=\"citation\" data-id=\"7259327\"><a href=\"/opinion/7341400/swarthout-v-cooke/#220\" aria-description=\"Citation for case: Swarthout v. Cooke\">562 U. S. 216, 220</a></span><pre class=\"inline\"> (2011) (per\ncuriam) (“There is no right under the Federal Constitution\nto be conditionally released before the expiration of a valid\nsentence” (emphasis added)); Pollard v. United States, </pre><span class=\"citation\" data-id=\"9421375\"><a href=\"/opinion/105450/pollard-v-united-states/#357\" aria-description=\"Citation for case: Pollard v. United States\">352\nU. S. 354, 357, 360</a></span><pre class=\"inline\"> (1957) (“The only sentence that was en-\ntered at the 1952 hearing was the one of probation, admit-\ntedly invalid because of petitioner’s absence” (emphasis\nadded)); Richmond v. Lewis, </pre><span class=\"citation\" data-id=\"9432698\"><a href=\"/opinion/112794/richmond-v-lewis/#43\" aria-description=\"Citation for case: Richmond v. Lewis\">506 U. S. 40, 43</a></span><pre class=\"inline\"> (1992) (“[P]eti-\ntioner’s conviction was found valid but his sentence invalid”\n(emphasis added)); see also Uriarte, 975 F. 3d, at 607 (Bar-\nrett, J., dissenting) (“That is why it is perfectly coherent to\ndescribe the procedural posture of a case by saying, ‘a sen-\ntence was imposed last year, but it has since been vacated\non appeal’ ”). If Congress sought to narrow “a sentence” in\na specialized way to indicate a legally valid sentence, it\ncould have referred to “a final sentence,” “a legally valid\nsentence,” or more prosaically, “the sentence.” Accord,\nUnited States v. Hernandez, </pre><span class=\"citation no-link\">107 F. 4th 965</span><pre class=\"inline\">, 969 (CA11\n2024).\n   Reading the retroactivity provision in context, the phrase\n“a sentence has not been imposed” most straightforwardly\nmeans that a district court has not, as a matter of historical\nfact, sentenced a defendant for his §924(c) offenses before\nthe Act’s “date of enactment.” So how can the Court read\nthe same text to refer to a presently valid sentence, rather\nthan one that was historically “imposed” in the past? See\nante, at 10. Bizarrely, the Court’s analysis begins and ends\nwith Congress’s use of the present-perfect tense. Through\nthe use of a single hypothetical, which does not resemble\nthe structure of the provision actually before us, the Court\ndraws the conclusion that “the present-perfect tense con-\nveys to a listener that the event in question continues to be\ntrue or valid.” Ante, at 8. But, as I have explained, the\n\f10                    HEWITT v. UNITED STATES\n\n                           ALITO, J., dissenting\n\npresent-perfect tense is, as a general matter, capable of sup-\nporting either the historical-fact or legal-validity interpre-\ntation. The surrounding context and the specific words\nCongress employed indicate how the present-perfect tense\nmay support one interpretation or the other. As to the ac-\ntual words in the retroactivity provision (“imposed,” “a sen-\ntence”), the Court’s textual analysis in Part III–A is silent.3\n——————\n   3 The Court’s legal-validity interpretation also rests on the mistaken\n\npremise that the past-perfect tense best captures the historical-fact in-\nterpretation. The Court claims “if an event is merely a relic of history\nbecause it was voided by a subsequent action, the past-perfect (not the\npresent-perfect) tense would usually be the more appropriate verb\nchoice.” Ante, at 8. I hope readers do not look to this Court as an author-\nity on English grammar because this broad pronouncement is badly mis-\ntaken. As support for its grammatical rule, the Court offers a hypothet-\nical: suppose a U. S. Olympic Committee rule says that “athletes may\ncall themselves Olympic champions if a gold medal ‘has been awarded’\nto them.” Ante, at 7. If the Olympic gold medalist is stripped of her\nmedal, however, the Court claims she can no longer call herself an\n“Olympic champion” under the rule. To enable our athlete to still call\nherself an Olympic champion based on her now-stripped medal, the\nCourt tells us “the past-perfect” tense would be “more appropriate” (e.g.,\n“she had been awarded such a medal”). Ante, at 8–9. That is highly\ndebatable.\n   The only lesson taught by the Court’s example is that the meaning of\nlanguage is heavily dependent on context. The obvious purpose of the\nhypothetical rule is to restrict the class of individuals who are entitled to\nthe honor of calling themselves Olympic champions, and the Court pre-\nsumes that the athlete in question lost her medal because she engaged\nin improper conduct, e.g., taking performance-enhancing drugs. But sup-\npose the medal was taken away for an illegitimate reason. Some histo-\nrians think that Jim Thorpe, a legendary Native American athlete who\ndominated the 1912 Olympics, was stripped of his medals at least in part\nbecause of racism. See B. Crawford, All American: The Rise and Fall of\nJim Thorpe 209–210 (2005); J. Elfers, The Tour To End All Tours: the\nStory of Major League Baseball’s 1913–1914 World Tour 18 (2003). That\nwas not completely undone until 2022, long after Thorpe died. See V.\nMather &amp; T. Panja, Jim Thorpe Is Restored as Sole Winner of 1912 Olym-\npic Gold Medals, N. Y. Times, July 15, 2022. Suppose Thorpe had been\nasked: “Have you ever been awarded an Olympic medal?” Would he have\nbeen a liar if he answered “yes”? The Court seems to think so.\n\f                     Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                    11\n\n                          ALITO, J., dissenting\n\nThe Court’s failure to defend the legal-validity interpreta-\ntion is thus an independently fatal blow to its holding.\n                                B\n   Assuming the Court had proved up the legal-validity in-\nterpretation, it would still need to establish its “vacatur”\nprinciple. That is, it would still need to prove not only that\nthe Act is concerned with a sentence’s continuing legal va-\nlidity up to the “date of enactment,” but also that the Act\nhinges on the continuing validity of a sentence after the\ndate of enactment. The Court can prove as much only by\ninventing a “legal fiction” that a vacated sentence “never\noccurred.” Ante, at 10. But one need only scratch the sur-\nface of this purported “legal fiction” to understand how thor-\noughly unpersuasive it is.\n   As a preliminary matter, the Court’s “vacatur” principle\ndoes not exist. The Court assures us that there is a well-\nestablished principle in the criminal law that “vacated\ncourt orders are void ab initio and thus lack any prospective\nlegal effect.” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\"> It derives this rule by over-reading a few\ncreative turns of phrase in our cases. See ante, at 11 (citing\nNorth Carolina v. Pearce, </pre><span class=\"citation\" data-id=\"9424091\"><a href=\"/opinion/107978/north-carolina-v-pearce/#721\" aria-description=\"Citation for case: North Carolina v. Pearce\">395 U. S. 711, 721</a></span><pre class=\"inline\"> (1969) (stating\nvacatur causes a conviction to be “ ‘wholly nullified and the\nslate wiped clean’ ”); Pepper v. United States, </pre><span class=\"citation\" data-id=\"7260396\"><a href=\"/opinion/7342461/pepper-v-united-states/#507\" aria-description=\"Citation for case: Pepper v. United States\">562 U. S. 476,\n507</a></span><pre class=\"inline\"> (2011) (noting vacatur “ ‘wipe[s] the slate clean’ ”)). But\na more careful reading of our precedents and other provi-\nsions in Title 18 indicates that vacatur does not erase the\nhistorical fact of a previously imposed conviction or sen-\ntence. Further, even if the “vacatur” principle exists, the\n——————\n   Indeed, the Court offers no answer to the argument that the present-\nperfect tense may be properly used to refer to a past event that was later\nundone. Instead, the Court promises readers that an answer will come\nin Part IV of its opinion—i.e., the portions in which only three Justices\njoin. See ante, at 8, n. 6. But this promise goes unfulfilled. Part IV\ncontains no deus ex machina to salvage the Court’s interpretation; ra-\nther, Part IV throws a celebration for the First Step Act, perhaps hoping\nreaders lose sight of the text behind all the confetti.\n\f12                  HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\nAct’s retroactivity provision does not incorporate it.\n                                1\n    Our precedents foreclose the Court’s “vacatur” principle.\nTake, for example, one of the cases the Court cites, Lewis v.\nUnited States, </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S. 55</a></span><pre class=\"inline\"> (1980). See ante, at 11. There,\nthe defendant challenged his conviction under a federal\nstatute prohibiting “ ‘[a]ny person who . . . has been con-\nvicted by a court of the United States or of a State’ ” from\n“ ‘receiv[ing], possess[ing], or transport[ing] . . . any fire-\narm.’ ” </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#56\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S., at 56</a></span><pre class=\"inline\">, and n. 1 (quoting </pre><span class=\"citation no-link\">18 U. S. C.\n§1202</span><pre class=\"inline\">(a)(1) (1970 ed.)). The defendant argued that his\npredicate state conviction was invalid because he lacked\ncounsel and that, as such, he could not be convicted as a\nfelon in possession under the federal statute. We assumed\nthat the predicate state conviction was subject to invalida-\ntion (i.e., vacatur), see </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#58\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S., at 58</a></span><pre class=\"inline\">, but we nevertheless\nupheld the felon-in-possession conviction. We reasoned\nthat the statute’s “sweeping” language, which is phrased in\nthe present-perfect tense just like the First Step Act, fo-\ncused on “the fact of a [predicate] felony conviction.” </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#60\" aria-description=\"Citation for case: Lewis v. United States\">Id., at\n60</a></span><pre class=\"inline\">. At the time of his federal offense, the defendant’s state\nconviction was extant and thus disabled him from firearm\npossession. Congress made “[n]o exception” for “a person\nwhose outstanding [predicate] conviction ultimately might\nturn out to be invalid for any reason.” </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#62\" aria-description=\"Citation for case: Lewis v. United States\">Id., at 62</a></span><pre class=\"inline\">. So a sub-\nsequent invalidation of his state predicate conviction due to\nhis lack of counsel would not render that conviction “invalid\nfor all purposes.” </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#67\" aria-description=\"Citation for case: Lewis v. United States\">Id., at 67</a></span><pre class=\"inline\">. Lewis thus powerfully refutes\nthe Court’s vacatur principle. If vacatur of the defendant’s\npredicate conviction implied the conviction “never\noccurred,” as the Court today insists, then his felon-in-\npossession conviction could not stand. Ante, at 10. But that\nis the very argument Lewis foreclosed.4\n\n——————\n 4 In responding to Lewis, the Court accidentally fires on its own posi-\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                      13\n\n                           ALITO, J., dissenting\n\n   Although it supports the petitioners in this appeal, the\nUnited States also concedes (albeit sheepishly in a footnote)\nthat the Court’s “general background legal principle that\nvacatur makes a sentence void from the start for all pur-\nposes” is “incorrect.” Brief for United States 27, n. 4 (inter-\nnal quotation marks and alterations omitted). As it\nacknowledges, lower courts routinely follow Lewis and up-\nhold convictions despite the later vacatur of predicate of-\nfenses. See, e.g., Burrell v. United States, </pre><span class=\"citation\" data-id=\"787801\"><a href=\"/opinion/787801/andrew-burrell-v-united-states/\" aria-description=\"Citation for case: Andrew Burrell v. United States\">384 F. 3d 22</a></span><pre class=\"inline\">, 27–\n28 (CA2 2004) (“[I]t is the mere fact of [a prior] conviction\nat the time of the charged possession, not the reliability of\nthe conviction, that establishes the §922(g)(1) predicate”\n(internal quotation marks omitted)); United States v. Rob-\nerson, </pre><span class=\"citation\" data-id=\"9799691\"><a href=\"/opinion/2675328/united-states-v-roberson/#522\" aria-description=\"Citation for case: United States v. Roberson\">752 F. 3d 517, 522</a></span><pre class=\"inline\"> (CA1 2014) (upholding a convic-\ntion for failure to register as a sex offender even though the\npredicate sex offense was later vacated).\n   Moreover, as the United States also acknowledges,\nLewis’s logic crosses into the constitutional context. Con-\nsider Bravo-Fernandez v. United States, </pre><span class=\"citation no-link\">580 U. S. 5</span><pre class=\"inline\"> (2016),\nin which we considered the application of issue preclusion\nunder the Double Jeopardy Clause when a jury returns in-\nconsistent verdicts. It is well established that if a jury con-\nvicts on one count but acquits on another count involving\nthe same conduct, the acquittal has no issue preclusive ef-\nfect. See </pre><span class=\"citation no-link\">id., at 13</span><pre class=\"inline\">. Likewise, if a jury acquits on one count\nbut fails to reach agreement on another count, the acquittal\nhas such an effect. See </pre><span class=\"citation no-link\">id.,</span><pre class=\"inline\"> at 13–14. In Bravo-Fernandez,\na jury convicted on one count but acquitted on others that\n——————\ntion. The Court justifies Lewis’s holding by explaining that “the defend-\nant’s prior felony conviction had ‘never been overturned’—i.e., vacated—\nat the time he possessed the weapon.” Ante, at 11, n. 8 (quoting Lewis v.\nUnited States, </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/#57\" aria-description=\"Citation for case: Lewis v. United States\">445 U. S. 55, 57</a></span><pre class=\"inline\"> (1980)). But that is precisely the point.\nLewis afforded “prospective legal effect” to the defendant’s vacated con-\nviction by refusing to ignore the historical fact of his predicate conviction\neven after the vacatur. I see no way to reconcile that reasoning with the\nCourt’s rule that a vacated sentence never “retains prospective legal ef-\nfect.” </pre><span class=\"citation\" data-id=\"110213\"><a href=\"/opinion/110213/lewis-v-united-states/\" aria-description=\"Citation for case: Lewis v. United States\">Ibid.</a></span><pre class=\"inline\">\n\f14                  HEWITT v. UNITED STATES\n\n                         ALITO, J., dissenting\n\nwere claimed to involve the same conduct. The conviction,\nhowever, was vacated due to “an unrelated legal error,” and\nthe defendant argued that the Court should treat the con-\nviction as if it had never occurred and that the acquittal had\nissue preclusive effect barring reprosecution. Id., at 9. We\nrejected this argument, holding that the conviction’s later\ninvalidation did not “erase” its historical existence for the\npurposes of issue preclusion because the vacatur did not\n“bear on the factual determinations actually and neces-\nsarily made by the jury.” Id., at 21 (internal quotation\nmarks omitted). Bravo-Fernandez thus treated the histori-\ncal fact of a later-vacated conviction as legally relevant,\nwhich is irreconcilable with the Court’s “vacatur” principle.\n   The only “ ‘unexpressed presumptio[n]’ ” I can derive from\nour cases and those from the courts of appeals is the oppo-\nsite of the one the Court advances today. Ante, at 10 (quot-\ning Bond v. United States, </pre><span class=\"citation\" data-id=\"2676593\"><a href=\"/opinion/2676593/bond-v-united-states/#857\" aria-description=\"Citation for case: Bond v. United States\">572 U. S. 844, 857</a></span><pre class=\"inline\"> (2014)).\n                               2\n   Congress too has rejected the Court’s “vacatur” principle.\nIn the Sentencing Reform Act, Congress “se[t] forth a spe-\ncial . . . background principle” that is incompatible with the\n“vacatur” rule invented today. Dorsey v. United States, </pre><span class=\"citation\" data-id=\"9500747\"><a href=\"/opinion/802791/dorsey-v-united-states/#275\" aria-description=\"Citation for case: Dorsey v. United States\">567\nU. S. 260, 275</a></span><pre class=\"inline\"> (2012) (emphasis deleted).5 That is, after a\nsentence is vacated, a district court during resentencing\nmust apply the Sentencing Guidelines that “were in effect\non the date of the previous sentencing of the defendant\nprior to the appeal.” </pre><span class=\"citation no-link\">18 U. S. C. §3742</span><pre class=\"inline\">(g)(1). The vacatur\nof an initial sentence thus does not “wipe the slate clean” in\nrelation to the Guidelines range. Contra, Pepper, 562 U. S.,\nat 507. Petitioners try to write off this provision as a devi-\nation from the background presumption that vacatur voids\n——————\n  5 In Dorsey, </pre><span class=\"citation\" data-id=\"9500747\"><a href=\"/opinion/802791/dorsey-v-united-states/#275\" aria-description=\"Citation for case: Dorsey v. United States\">567 U. S., at 275</a></span><pre class=\"inline\">, we referred to </pre><span class=\"citation no-link\">18 U. S. C.\n\n§3553</span><pre class=\"inline\">(a)(4)(A)(ii) as establishing the relevant “background principle.”\nThat provision incorporates by reference the anti-vacatur rule of\n§3742(g).\n\f                      Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                     15\n\n                           ALITO, J., dissenting\n\na sentence ab initio. See Brief for Petitioner Hewitt 24;\nBrief for Petitioner Duffey et al. 47. But §3742(g)(1)’s anti-\nvacatur rule cannot be described as a minor exception to an\notherwise widespread principle. The rule does not appear\nin some “little-used backwater” of the Sentencing Reform\nAct. West Virginia v. EPA, </pre><span class=\"citation no-link\">597 U. S. 697</span><pre class=\"inline\">, 730 (2022). Ra-\nther, it is incorporated into the default procedures that ap-\nply in every criminal sentencing.6 See §§3553(a)(4)(A)(ii),\n(a)(5)(B).\n    In short, the Court’s failure to “sho[w] that its own rule\n. . . existed as a background matter when Congress enacted”\nthe First Step Act is fatal to its position. Coinbase, Inc. v.\nBielski, </pre><span class=\"citation\" data-id=\"10516266\"><a href=\"/opinion/10049666/coinbase-inc-v-bielski/\" aria-description=\"Citation for case: Coinbase, Inc. v. Bielski\">599 U. S. 736</a></span><pre class=\"inline\">, 753–754 (2023) (JACKSON, J., dis-\nsenting).\n                               3\n  Even assuming the “vacatur” principle is not a figment of\nthe Court’s imagination, it lacks any foothold in the Act’s\ntext. “When called on to resolve a dispute over a statute’s\nmeaning, this Court normally seeks to afford the law’s\nterms their ordinary meaning at the time Congress adopted\nthem.” Niz-Chavez v. Garland, </pre><span class=\"citation no-link\">593 U. S. 155</span><pre class=\"inline\">, 160 (2021).\nOf course, we sometimes look to principles beyond the four\ncorners of a statute to understand the background against\nwhich Congress legislated. But we typically do so in dis-\ncrete situations. For example, we look to background\ncommon-law principles to fill in obvious gaps in statutes,\nsuch as a missing mens rea element in a criminal statute.\nSee, e.g., Staples v. United States, </pre><span class=\"citation\" data-id=\"9527058\"><a href=\"/opinion/1087954/staples-v-united-states/#619\" aria-description=\"Citation for case: Staples v. United States\">511 U. S. 600, 619</a></span><pre class=\"inline\"> (1994)\n\n——————\n  6 The portion of the opinion in which only three Justices join expresses\n\nconcern that, under the historical-fact interpretation, district judges will\nstruggle “to reference, recall, and apply the superseded ‘stacking’ re-\ngime.” Ante, at 19. But I have far more faith in district judges’ ability to\nenforce older sentencing regimes. Indeed, district judges’ familiarity\nwith </pre><span class=\"citation no-link\">18 U. S. C. §3742</span><pre class=\"inline\">(g), which routinely requires them to apply obso-\nlete Sentencing Guidelines in the present, is proof positive.\n\f16                HEWITT v. UNITED STATES\n\n                       ALITO, J., dissenting\n\n(mens rea); Agency Holding Corp. v. Malley-Duff &amp; Associ-\nates, Inc., </pre><span class=\"citation\" data-id=\"9431073\"><a href=\"/opinion/111937/agency-holding-corp-v-malley-duff-associates-inc/#150\" aria-description=\"Citation for case: Agency Holding Corp. v. Malley-Duff &amp; Associates, Inc.\">483 U. S. 143, 150</a></span><pre class=\"inline\"> (1987) (statutes of limitations);\nMarx v. General Revenue Corp., </pre><span class=\"citation\" data-id=\"9502823\"><a href=\"/opinion/821305/marx-v-general-revenue-corp/#382\" aria-description=\"Citation for case: Marx v. General Revenue Corp.\">568 U. S. 371, 382</a></span><pre class=\"inline\"> (2013)\n(attorney’s fees and costs). Or we import extra-textual\nmeaning when Congress employs a “term of art that had an\nestablished meaning under” a relevant “backdrop.” Stewart\nv. Dutra Constr. Co., </pre><span class=\"citation\" data-id=\"137747\"><a href=\"/opinion/137747/stewart-v-dutra-construction-co/#487\" aria-description=\"Citation for case: Stewart v. Dutra Construction Co.\">543 U. S. 481, 487</a></span><pre class=\"inline\"> (2005).\n   The First Step Act fits neither mold, and the Court makes\nno effort in Part III–B to analyze how its “vacatur” principle\nmaps on to the text. The Court points to no obvious gap in\nthe Act’s retroactivity provision that could be filled with\n“recognized” “background principles of construction.”\nBond, </pre><span class=\"citation\" data-id=\"2676593\"><a href=\"/opinion/2676593/bond-v-united-states/#857\" aria-description=\"Citation for case: Bond v. United States\">572 U. S., at 857</a></span><pre class=\"inline\">. Nor does the Court suggest that\nthe utterly ordinary words in the Act’s retroactivity provi-\nsion carry some specialized meaning related to vacatur. “In\nthe absence of some strong contrary indication” of special-\nized meaning, we must “ ‘assume that the ordinary mean-\ning’ ” of words like “sentence,” which captures both extant\nand vacated sentences, “controls.” Monsalvo Velázquez v.\nBondi, </pre><span class=\"citation no-link\">604 U. S. ___</span><pre class=\"inline\">, ___ (2025) (ALITO, J., dissenting) (slip\nop., at 4); see Part III–A, supra.\n                               C\n   The superiority of the historical-fact interpretation and\nthe nonexistence of the Court’s “vacatur” principle are in-\ndependent reasons to reject the Court’s holding. But even\nif the matter were close, two more factors counsel against\nthe Court’s rule.\n   First, the retroactivity provision’s title—“APPLICABILITY\nTO PENDING CASES”—advises against the Court’s boundless\ninterpretation. “[T]he title of a statute and the heading of\na section are tools available for the resolution of a doubt\nabout the meaning of a statute.” Dubin v. United States,\n</pre><span class=\"citation\" data-id=\"10516278\"><a href=\"/opinion/10049678/dubin-v-united-states/\" aria-description=\"Citation for case: Dubin v. United States\">599 U. S. 110</a></span><pre class=\"inline\">, 120–121 (2023) (internal quotation marks\nomitted); see also Yates v. United States, </pre><span class=\"citation no-link\">574 U. S. 528</span><pre class=\"inline\">, 552\n(2015) (ALITO, J., concurring in judgment) (“Titles can be\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)            17\n\n                      ALITO, J., dissenting\n\nuseful devices to resolve doubt about the meaning of a stat-\nute” (internal quotation marks omitted)). Here, the phrase\n“Pending Cases” suggests Congress was concerned with the\nfinite population of defendants who, on the date of the First\nStep Act’s enactment, lacked an initial sentence for §924(c)\noffenses. See Black’s Law Dictionary, at 1366 (defining\n“pending” as “[r]emaining undecided; awaiting decision”);\nModern English Usage 813 (defining “pending” as “await-\ning an outcome”). But the Court’s “vacatur” principle would\nobliterate that closed set and refashion the retroactivity\nprovision as an open-ended entitlement for any defendant\nconvicted of multiple §924(c) offenses whose sentence is va-\ncated at any time and for any reason. That means, as the\nUnited States concedes, the “universe” of “Pending Cases”\nwould “increase,” for example, “anytime this Court issues a\ndecision that affects the validity of 924(c) sentences.” Tr. of\nOral Arg. 49. If Congress intended the retroactivity provi-\nsion to benefit such an amorphous population that may for-\never grow in size, I seriously doubt it would have labeled\nthe Act’s retroactivity provision with the phrase “Pending\nCases.”\n   Second, the presumption against retroactivity further\nweighs against the Court’s unnecessarily broad interpreta-\ntion. The Federal Saving Statute sets forth “an important\nbackground principle of interpretation” that “a new crimi-\nnal statute that ‘repeal[s]’ an older criminal statute shall\nnot change the penalties ‘incurred’ under that older statute\n‘unless the repealing Act shall so expressly provide.’ ”\nDorsey, </pre><span class=\"citation\" data-id=\"9500747\"><a href=\"/opinion/802791/dorsey-v-united-states/#272\" aria-description=\"Citation for case: Dorsey v. United States\">567 U. S., at 272</a></span><pre class=\"inline\">, 274 (quoting </pre><span class=\"citation no-link\">1 U. S. C. §109</span><pre class=\"inline\">). Ac-\ncordingly, Congress may give retroactive effect to new re-\nductions in criminal penalties, but it must do so with “plain\nimport” or “fair implication.” </pre><span class=\"citation\" data-id=\"9500747\"><a href=\"/opinion/802791/dorsey-v-united-states/#275\" aria-description=\"Citation for case: Dorsey v. United States\">567 U. S., at 275</a></span><pre class=\"inline\"> (internal\nquotation marks omitted). Here, the First Step Act pro-\nvides a clear intent to rebut the presumption against retro-\nactivity as to offenders for whom a sentence “has not been\nimposed.” Although I believe the scope of that retroactivity\n\f18               HEWITT v. UNITED STATES\n\n                      ALITO, J., dissenting\n\ncommand is sufficiently clear for the reasons I have already\ngiven, to the extent there is any ambiguity about how far\nthe Act’s retroactivity command should go, the presumption\nputs a thumb on the scale against construing the retroac-\ntivity command to its broadest extent as the Court does to-\nday.\n                               IV\n   After the Court is through with the text and nonexistent\nprinciples of vacatur, three Justices continue on for pages,\nsparing no effort, to extol the “much-anticipated, much-\nheralded” First Step Act. Ante, at 15. But what is the point\nof all this lauding? Perhaps realizing the weakness of their\ntextual argument, the three Justices think it wise to spruce\nup the opinion. They attempt to do so by asserting that\nwhen a “ ‘bipartisan’ ” “supermajority” of Congress passes\n“landmark” legislation, it intends to go big, down to the very\nlast subsection (or here, application note to a subsection).\nAnte, at 3; ante, at 15 (opinion of JACKSON, J., joined by\nSOTOMAYOR and KAGAN, JJ.). So I gather they would have\nus broadly construe every atom of the “landmark” First\nStep Act in a way that furthers Congress’s supposedly\ngrand ambition to turn the page on “harsh” sentencing\npractices. Ante, at 16.\n   There is no “landmark” canon of construction requiring\nthe Court to construe important legislation to its furthest\npossible implication. “ ‘[N]o legislation pursues its purposes\nat all costs.’ ” American Express Co. v. Italian Colors Res-\ntaurant, </pre><span class=\"citation\" data-id=\"9515841\"><a href=\"/opinion/903973/american-express-co-v-italian-colors-restaurant/#234\" aria-description=\"Citation for case: American Express Co. v. Italian Colors Restaurant\">570 U. S. 228, 234</a></span><pre class=\"inline\"> (2013) (quoting Rodriguez v.\nUnited States, </pre><span class=\"citation\" data-id=\"111840\"><a href=\"/opinion/111840/rodriguez-v-united-states/\" aria-description=\"Citation for case: Rodriguez v. United States\">480 U. S. 522</a></span><pre class=\"inline\">, 525–526 (1987) (per curiam)).\nIndeed, just last Term we rejected the same sort of “land-\nmark” argument when interpreting a different provision of\nthe First Step Act. See Pulsifer v. United States, </pre><span class=\"citation\" data-id=\"11066695\"><a href=\"/opinion/10600107/pulsifer-v-united-states/\" aria-description=\"Citation for case: Pulsifer v. United States\">601 U. S.\n124</a></span><pre class=\"inline\">, 151–152 (2024). Experience shows that more often\nthan not, “landmark” legislation reflects the necessary log-\n\f                    Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)                  19\n\n                         ALITO, J., dissenting\n\nrolling of the legislative process, which prizes political com-\npromise over statutory clarity. That reality cautions\nagainst the precise move the Court makes today: an infer-\nence that Congress hid in an “ancillary” and intentionally\ncircumscribed provision a retroactivity command that\nwould “alter the fundamental details” of how §924(c) sen-\ntencing should work for all time. Whitman v. American\nTrucking Assns., Inc., </pre><span class=\"citation\" data-id=\"9434047\"><a href=\"/opinion/118410/whitman-v-american-trucking-assns-inc/#468\" aria-description=\"Citation for case: Whitman v. American Trucking Assns., Inc.\">531 U. S. 457, 468</a></span><pre class=\"inline\"> (2001).\n   The three-Justice opinion rattles off the public criticisms\nthat supposedly spurred Congress to reform the practice of\n§924(c) sentence “stacking.” But this discussion is beside\nthe point. Nothing in this multi-page discussion sheds light\non how Members of Congress understood the retroactivity\nprovision before us.\n   Carried away with its enthusiasm for the changes ef-\nfected by the First Step Act, the three Justices bestow an\nentirely undeserved windfall on the actual petitioners in\nthese cases. Due to the especially violent nature of their\nrobberies,7 petitioners were convicted of more than a dozen\n§924(c) offenses, about half of which were not predicated on\n§924(c)’s residual clause.\n   In 2019 we decided Davis and provided a basis to set\naside petitioners’ §924(c) convictions under the residual\nclause, but Davis did nothing to disturb petitioners’ other\n§924(c) convictions and associated mandatory-minimum\nsentences. In cases “involv[ing] multicount indictments\nand a successful attack by a defendant on some but not all\n——————\n  7 Dubbed the “Scarecrow Bandits” due to their plaid-shirt and floppy-\n\nhat disguises, petitioners and their confederates “violently robbed” a\nstring of banks in the Dallas-Fort Worth area around 2008. </pre><span class=\"citation no-link\">2009 WL\n2356156</span><pre class=\"inline\">, *1 (ND Tex. July 30, 2009); see FBI, Scarecrow Bandit Leader\nSentenced to 355 Years in Federal Prison on Bank Robbery and Firearms\nConvictions (May 5, 2010). During the robberies, the Scarecrow Bandits\nheld bank employees and customers at gunpoint and physically as-\nsaulted them with firearms and stun guns. See </pre><span class=\"citation no-link\">2009 WL 2356156</span><pre class=\"inline\">, *1.\nIn total, the conspiracy stole more than $350,000 before authorities\ncaught up with them. See Brief for United States 7.\n\f20                   HEWITT v. UNITED STATES\n\n                           ALITO, J., dissenting\n\nof the counts of conviction,” a court, “in such instances, may\nvacate the entire sentence on all counts” and “reconfigure\nthe sentencing plan” in toto. Greenlaw, </pre><span class=\"citation\" data-id=\"9435180\"><a href=\"/opinion/145784/greenlaw-v-united-states/#253\" aria-description=\"Citation for case: Greenlaw v. United States\">554 U. S., at 253</a></span><pre class=\"inline\">\n(emphasis added).8 But, as petitioners’ counsel conceded,\ncourts are under “no obligation” to follow this convention\nand may instead choose to vacate only those parts of the\nsentence related to an intervening change in law. Tr. of\nOral Arg. 15. Nor does this strike me as a case in which full\nvacatur was warranted. Section 924(c) convictions must\nrun consecutively “with any other term of imprisonment.”\n§924(c)(1)(D)(ii). So §924(c) sentences are presumably eas-\nier to identify and extract from a defendant’s total term of\nimprisonment, often obviating the need for a plenary resen-\ntencing. The likely unnecessary vacatur of each petitioner’s\nentire sentence was thus a stroke of good fortune that\nopened the door to petitioners’ First Step Act claims.9 The\nlower courts (correctly) rejected those efforts, but petition-\ners have found a sympathetic audience in this Court. The\n——————\n   8 The chief reason for vacating perfectly valid convictions in such cases\n\nis to allow the sentencing court to consider whether the sentence previ-\nously imposed on a valid count provides sufficient punishment for the\ndefendant’s conduct. See Greenlaw, 554 U. S., at 253–254. Suppose a\ndefendant is convicted of two offenses, each with a 5-year mandatory\nminimum. The sentencing judge, thinking that the appropriate punish-\nment for the defendant’s criminal conduct is 10 years’ imprisonment, im-\nposes a 5-year term of imprisonment on both counts and runs the counts\nconsecutively. If one of the counts of conviction is reversed and the case\nis remanded, the sentencing judge may wish to enlarge the initial 5-year\nsentence on the remaining count to 10 years’ imprisonment. So the de-\nfendant “ultimately may gain nothing from his limited success on ap-\npeal.” Id., at 254. It is therefore ironic that the unnecessary vacatur of\npetitioners’ valid convictions has given them a benefit.\n   9 The District Court’s willingness to vacate petitioners’ entire sen-\n\ntences appears to have been informed by the position of the United\nStates, which “agreed” with petitioners that the “sentences on all re-\nmaining counts should be vacated.” Agreed Order in No. 3:08–cr–167\n(ND Tex., Nov. 2, 2021), ECF Doc. 700, p. 2 (Ross); see Agreed Order in\nNo. 3:08–cr–167 (June 14, 2021), ECF Doc. 672, p. 2 (Duffey); Agreed Or-\nder in No. 3:08–cr–167 (Aug. 19, 2021), ECF Doc. 683, p. 2 (Hewitt).\n\f                  Cite as: </pre><span class=\"citation no-link\">606 U. S. ____</span><pre class=\"inline\"> (2025)           21\n\n                      ALITO, J., dissenting\n\nthree Justices attribute today’s outcome to grand congres-\nsional design coming to fruition, but in reality, petitioners’\nchange in fortune can be attributed only to the happen-\nstance of legal developments with not the faintest relation-\nship to the First Step Act.\n                         *     *    *\n   The Court ignores Congress’s intention to afford only lim-\nited retroactive relief to certain offenders under the First\nStep Act. Instead, the Court embraces an interpretation\nthat has no limiting principle and affords petitioners a\nwindfall. That is an indefensible result based on indefensi-\nble reasoning. I cannot agree with the Court’s decision, so\nI must respectfully dissent.\n\f</pre>", "extracted_by_ocr": false, "ordering_key": null, "main_version": null, "opinions_cited": ["https://www.courtlistener.com/api/rest/v4/opinions/88199/", "https://www.courtlistener.com/api/rest/v4/opinions/96405/", "https://www.courtlistener.com/api/rest/v4/opinions/104336/", "https://www.courtlistener.com/api/rest/v4/opinions/110213/", "https://www.courtlistener.com/api/rest/v4/opinions/111840/", "https://www.courtlistener.com/api/rest/v4/opinions/137747/", "https://www.courtlistener.com/api/rest/v4/opinions/620153/", "https://www.courtlistener.com/api/rest/v4/opinions/787801/", "https://www.courtlistener.com/api/rest/v4/opinions/2511428/", "https://www.courtlistener.com/api/rest/v4/opinions/2572714/", "https://www.courtlistener.com/api/rest/v4/opinions/2641685/", "https://www.courtlistener.com/api/rest/v4/opinions/2676593/", "https://www.courtlistener.com/api/rest/v4/opinions/2741040/", "https://www.courtlistener.com/api/rest/v4/opinions/7228517/", "https://www.courtlistener.com/api/rest/v4/opinions/7259327/", "https://www.courtlistener.com/api/rest/v4/opinions/7260396/", "https://www.courtlistener.com/api/rest/v4/opinions/9421375/", "https://www.courtlistener.com/api/rest/v4/opinions/9422257/", "https://www.courtlistener.com/api/rest/v4/opinions/9424091/", "https://www.courtlistener.com/api/rest/v4/opinions/9426236/", "https://www.courtlistener.com/api/rest/v4/opinions/9426555/", "https://www.courtlistener.com/api/rest/v4/opinions/9431073/", "https://www.courtlistener.com/api/rest/v4/opinions/9431144/", "https://www.courtlistener.com/api/rest/v4/opinions/9432237/", "https://www.courtlistener.com/api/rest/v4/opinions/9432497/", "https://www.courtlistener.com/api/rest/v4/opinions/9432698/", "https://www.courtlistener.com/api/rest/v4/opinions/9432802/", "https://www.courtlistener.com/api/rest/v4/opinions/9433979/", "https://www.courtlistener.com/api/rest/v4/opinions/9434047/", "https://www.courtlistener.com/api/rest/v4/opinions/9435180/", "https://www.courtlistener.com/api/rest/v4/opinions/9435613/", "https://www.courtlistener.com/api/rest/v4/opinions/9500747/", "https://www.courtlistener.com/api/rest/v4/opinions/9502823/", "https://www.courtlistener.com/api/rest/v4/opinions/9515841/", "https://www.courtlistener.com/api/rest/v4/opinions/9527058/", "https://www.courtlistener.com/api/rest/v4/opinions/9799691/", "https://www.courtlistener.com/api/rest/v4/opinions/9800172/", "https://www.courtlistener.com/api/rest/v4/opinions/9804456/", "https://www.courtlistener.com/api/rest/v4/opinions/9817704/", "https://www.courtlistener.com/api/rest/v4/opinions/9876064/", "https://www.courtlistener.com/api/rest/v4/opinions/10516266/", "https://www.courtlistener.com/api/rest/v4/opinions/10516278/", "https://www.courtlistener.com/api/rest/v4/opinions/11066695/"]}