{"resource_uri": "https://www.courtlistener.com/api/rest/v4/opinions/9889200/", "id": 9889200, "absolute_url": "/opinion/4766664/trump-v-vance/", "cluster_id": 4766664, "cluster": "https://www.courtlistener.com/api/rest/v4/clusters/4766664/", "author_id": null, "author": null, "joined_by": [], "date_created": "2023-10-06T13:26:57.297375-07:00", "date_modified": "2025-06-04T10:25:28.171501-07:00", "author_str": "Thomas", "per_curiam": false, "joined_by_str": "", "type": "040dissent", "sha1": "", "page_count": null, "download_url": null, "local_path": null, "plain_text": "", "html": "", "html_lawbox": "", "html_columbia": "", "html_anon_2020": "", "xml_harvard": "<opinion type=\"dissent\">\n<author id=\"p-83\">Justice THOMAS, dissenting.</author>\n<p id=\"p-84\">Respondent Cyrus Vance, Jr., the district attorney for the County of New York, served a grand jury subpoena on the President's personal accounting firm. The subpoena, which is nearly identical to a subpoena issued by a congressional Committee, requests nearly 10 years of the President's personal financial records. <em>Ante</em> , at 2420, and n. 2. In response to this troublingly broad request, the President, in his personal capacity, sought a declaration in federal court \" 'that the subpoena is invalid and unenforceable' \" and an injunction preventing respondent \" 'from taking any action to enforce the subpoena.' \" <em>Ante</em> , at 2420. The District Court denied the President's motion for a preliminary <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2434\" href=\"#p2434\" id=\"p2434\">*2434</a>injunction, and the Second Circuit affirmed in relevant part. <em>Ante</em> , at 2420 - 2421.</p>\n<p id=\"p-85\">The President argues that he is absolutely immune from the issuance of any subpoena, but that if the Court disagrees, we should remand so that the District Court can develop a record about this particular subpoena. I agree with the majority that the President is not entitled to absolute immunity from <em>issuance</em> of the subpoena. But he may be entitled to relief against its <em>enforcement</em> . I therefore agree with the President that the proper course is to vacate and remand. If the President can show that \"his duties as chief magistrate demand his whole time for national objects,\" <em>United States v. Burr</em> , <extracted-citation case-ids=\"6579548\" index=\"162\" url=\"https://cite.case.law/f-cas/25/30/#p33\">25 F.Cas. 30</extracted-citation>, 34 (No. 14,692d) (CC Va. 1807) (Marshall, C. J.), he is entitled to relief from enforcement of the subpoena.</p>\n<p id=\"p-86\">I</p>\n<p id=\"p-87\">The President first argues that he has absolute immunity from the issuance of grand jury subpoenas during his term in office. This Court has recognized absolute immunity for the President from \"damages liability predicated on his official acts.\" <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"163\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, 749, <extracted-citation case-ids=\"6194478\" index=\"164\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"165\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982). But we have rejected absolute immunity from damages actions for a President's nonofficial conduct, <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"166\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. 681</extracted-citation>, 684, <extracted-citation case-ids=\"11652833\" index=\"167\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"168\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997), and we have never addressed the question of immunity from a grand jury subpoena.</p>\n<p id=\"p-88\">I agree with the majority that the President does not have absolute immunity from the issuance of a grand jury subpoena. Unlike the majority, however, I do not reach this conclusion based on a primarily functionalist analysis. Instead, I reach it based on the text of the Constitution, which, as understood by the ratifying public and incorporated into an early circuit opinion by Chief Justice Marshall, does not support the President's claim of absolute immunity.<footnotemark>1</footnotemark></p>\n<p id=\"p-89\">A</p>\n<p id=\"p-90\">1</p>\n<p id=\"p-91\">The text of the Constitution explicitly addresses the privileges of some federal officials, but it does not afford the President absolute immunity. Members of Congress are \"privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same,\" except for \"Treason, Felony and Breach of the Peace.\" Art. I, § 6, cl. 1. The Constitution further specifies that, \"for any Speech or Debate in either House, they shall not be questioned in any other Place.\" <em><extracted-citation case-ids=\"11652833\" index=\"169\" url=\"https://cite.case.law/us/520/681/#p704\">Ibid.</extracted-citation></em> By contrast, the text of the Constitution contains no explicit grant of absolute immunity from legal process for the President. As a Federalist essayist noted during ratification, the President's \"person is not so much protected as that of a member of the House of Representatives\" because he is subject to the issuance of judicial process \"like any other man in the ordinary course of law.\" An American Citizen I (Sept. 26, 1787), in 2 Documentary History of the Ratification of the Constitution 141 (M. Jansen ed. 1976) (emphasis deleted).</p>\n<p id=\"p-92\">Prominent defenders of the Constitution confirmed the lack of absolute Presidential immunity. James Wilson, a signer of the Constitution and future Justice of this Court, explained to his fellow Pennsylvanians that \"far from being above the laws, [the President] is amenable to them in his <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2435\" href=\"#p2435\" id=\"p2435\">*2435</a>private character as a citizen, and in his public character by <em>impeachment</em> .\" 2 Debates on the Constitution 480 (J. Elliot ed. 1891) (emphasis in original). James Iredell, another future Justice, observed in the North Carolina ratifying convention that \"[i]f [the President] commits any crime, he is punishable by the laws of his country.\" 4 <em><extracted-citation case-ids=\"11652833\" index=\"170\" url=\"https://cite.case.law/us/520/681/#p704\">id.</extracted-citation></em> , at 109. A fellow North Carolinian similarly argued that, \"[w]ere it possible to suppose that the President should give wrong instructions to his deputies, ... citizens ... would have redress in the ordinary courts of common law.\" <em><extracted-citation case-ids=\"11652833\" index=\"171\" url=\"https://cite.case.law/us/520/681/#p704\">Id.</extracted-citation></em> , at 47; see also Americanus No. 2, in 19 Documentary History of the Ratification of the Constitution 288-289 (J. Kaminski &amp; G. Saladino eds. 2003); Americanus No. 4, in <em><extracted-citation case-ids=\"11652833\" index=\"172\" url=\"https://cite.case.law/us/520/681/#p704\">id.</extracted-citation></em> , at 359.</p>\n<p id=\"p-93\">2</p>\n<p id=\"p-94\">The sole authority that the President cites from the drafting or ratification process is The Federalist No. 69, but it provides him no real support. Alexander Hamilton stated that \"[t]he President of the United States would be liable to be impeached, tried, and upon conviction of treason, bribery, or other high crimes or misdemeanors, removed from office; and would afterwards be liable to prosecution and punishment in the ordinary course of law.\" The Federalist No. 69, p. 416 (C. Rossiter ed. 1961). Hamilton did not say that the President was temporarily immune from judicial process. Moreover, he made this comment to reassure readers that the President was \"amenable to personal punishment and disgrace.\" <em><extracted-citation case-ids=\"11652833\" index=\"173\" url=\"https://cite.case.law/us/520/681/#p704\">Id.</extracted-citation></em> , at 422. For the President, this is at best ambiguous evidence that cannot overcome the clear evidence discussed above.</p>\n<p id=\"p-95\">The President further relies on a private letter written by President Jefferson. In the letter, Jefferson worried that the Executive would lose his independence \"if he were subject to the <em>commands</em> of the [judiciary], &amp; to imprisonment for disobedience; if the several courts could bandy him from pillar to post, keep him constantly trudging from north to south &amp; east to west, and withdraw him entirely from his constitutional duties.\" 10 Works of Thomas Jefferson 404 n. (P. Ford ed. 1905) (emphasis in original). But President Jefferson never squarely argued for absolute immunity. Yoo, The First Claim: The Burr Trial, <em>United States v. Nixon</em> , and Presidential Power, <extracted-citation index=\"174\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\">83 Minn. L. Rev. 1435</extracted-citation>, 1450 (1999). And, the concern Jefferson had about demands on the President's time is addressed by the standard that Chief Justice Marshall articulated in <em>Burr</em> . See <em>infra</em> , at 2426 - 2427.</p>\n<p id=\"p-96\">The President also quotes the views of Vice President John Adams and then-Senator Oliver Ellsworth in 1789. The record of the conversation we have from a fellow Senator's diary is brief. Adams or Ellsworth (or perhaps both) stated that \"you could only impeach [the President], and no other process whatever lay against him.\" Journal of William Maclay 167 (E. Maclay ed. 1890). The only reason given was that it would \"stop the whole machine of Government.\" <em><extracted-citation index=\"175\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\">Ibid.</extracted-citation></em> Senator Philip Schuyler joined the conversation and gave his own reason: \" 'I think the President [is] a kind of sacred person.' \" <em><extracted-citation index=\"176\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\">Ibid.</extracted-citation></em> Schuyler's theory clearly has no basis in the Constitution, and the view held by Adams and Ellsworth seems to be grounds for relief from enforcement rather than a basis for absolute immunity from issuance of a subpoena.</p>\n<p id=\"p-97\">B</p>\n<p id=\"p-98\">This original understanding is reflected in an early circuit decision by Chief Justice Marshall, on which the majority partially relies. In 1805, disgraced former Vice President Aaron Burr began a murky series of negotiations to raise a volunteer army in the Western Territories.</p>\n<p id=\"p-99\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2436\" href=\"#p2436\" id=\"p2436\">*2436</a><em>Ante</em> , at 2421 - 2422. One of his contacts, General James Wilkinson, was not only commander of the Army and Governor of Louisiana, but also a Spanish spy. <em>Ante</em> , at 2421, n. 4; Yoo, <em>supra</em> , at 1440. After Burr set out with his army-perhaps to attack Spanish forces or perhaps to separate Western Territories from the United States-Wilkinson wrote to President Jefferson and accused Burr of the latter. <em>Ante</em> , at 2421; Yoo, <em>supra</em> , at 1440. Burr was arrested for treason and brought before a grand jury in Richmond, where Chief Justice Marshall presided.</p>\n<p id=\"p-100\">During the grand jury proceedings, Burr moved for a <em>subpoena duces tecum</em> ordering President Jefferson to produce the correspondence concerning Burr. <em>Burr</em> , 25 F.Cas. at 30. Chief Justice Marshall pre-emptively rejected any notion of absolute immunity, despite the fact that the Government did not so much as suggest it in court. He distinguished the President from the British monarch, who did have immunity, calling it an \"essentia[l] ... difference\" in our system that the President \"is elected from the mass of the people, and, on the expiration of the time for which he is elected, returns to the mass of the people again.\" <em>Id.</em> , at 34. Thus, the President was more like a state governor or a member of the British cabinet than a king. Chief Justice Marshall found no authority suggesting that these officials were immune from judicial process. <em>Ibid.</em> ; see also <em>ante</em> , at 2422 - 2423.</p>\n<p id=\"p-101\">Based on the evidence of original meaning and Chief Justice Marshall's early interpretation in <em>Burr</em> , the better reading of the text of the Constitution is that the President has no absolute immunity from the issuance of a grand jury subpoena.</p>\n<p id=\"p-102\">II</p>\n<p id=\"p-103\">In addition to contesting the issuance of the subpoena, the President also seeks injunctive and declaratory relief against its enforcement. The majority recognizes that the President can seek relief from enforcement, but it does not vacate and remand for the lower courts to address this question. I would do so and instruct them to apply the standard articulated by Chief Justice Marshall in <em>Burr</em> : If the President is unable to comply because of his official duties, then he is entitled to injunctive and declaratory relief.</p>\n<p id=\"p-104\">A</p>\n<p id=\"p-105\">In <em>Burr</em> , after explaining that the President was not absolutely immune from issuance of a subpoena, Chief Justice Marshall proceeded to explain that the President might be excused from the enforcement of one. As he put it, \"[t]he guard, furnished to this high officer, to protect him from being harassed by vexatious and unnecessary subpoenas, is to be looked for in the conduct of a court <em>after those subpoenas have issued</em> ; not in any circumstance which is to precede their being issued.\" 25 F.Cas. at 34 (emphasis added). Chief Justice Marshall set out the pertinent standard: To avoid enforcement of the subpoena, the President must \"sho[w]\" that \"his duties as chief magistrate demand his whole time for national objects.\" <em>Ibid.</em><footnotemark>2</footnotemark></p>\n<p id=\"p-106\">Although <em>Burr</em> involved a federal subpoena, the same principle applies to a state subpoena. The ability of the President to <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2437\" href=\"#p2437\" id=\"p2437\">*2437</a>discharge his duties until his term expires or he is removed from office by the Senate is \"integral to the structure of the Constitution.\" <em>Franchise Tax Bd. of Cal. v. Hyatt</em> , 587 U. S. ----, ----, <extracted-citation case-ids=\"12619240\" index=\"177\" url=\"https://cite.case.law/s-ct/139/1485/#p1498\">139 S.Ct. 1485</extracted-citation>, 1498, <extracted-citation index=\"178\" url=\"https://cite.case.law/citations/?q=203%20L.%20Ed.%202d%20768\">203 L.Ed.2d 768</extracted-citation> (2019). The Constitution is the \"supreme Law of the Land,\" Art. VI, cl. 2, so a state court can no more enforce a subpoena when national concerns demand the President's entire time than a federal court can. Accordingly, a federal court may provide injunctive and declaratory relief to stay enforcement of a state subpoena when the President meets the <em>Burr</em> standard.</p>\n<p id=\"p-107\">B</p>\n<p id=\"p-108\">The <em>Burr</em> standard places the burden on the President but also requires courts to take pains to respect the demands on the President's time. The Constitution vests the President with extensive powers and responsibilities, and courts are poorly situated to conduct a searching review of the President's assertion that he is unable to comply.</p>\n<p id=\"p-109\">1</p>\n<p id=\"p-110\">The President has vast responsibilities both abroad and at home. The Founders gave the President \"primary responsibility-along with the necessary power-to protect the national security and to conduct the Nation's foreign relations.\" <em>Hamdi v. Rumsfeld</em> , <extracted-citation case-ids=\"5864651\" index=\"179\" url=\"https://cite.case.law/us/542/507/#p580\">542 U.S. 507</extracted-citation>, 580, <extracted-citation case-ids=\"5864651\" index=\"180\" url=\"https://cite.case.law/us/542/507/#p580\">124 S.Ct. 2633</extracted-citation>, <extracted-citation case-ids=\"5864651\" index=\"181\" url=\"https://cite.case.law/us/542/507/#p580\">159 L.Ed.2d 578</extracted-citation> (2004) (THOMAS, J., dissenting). The Constitution \"expressly identifies certain foreign affairs powers and vests them\" in his office. <em>Zivotofsky v. Kerry</em> , <extracted-citation index=\"182\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\">576 U.S. 1</extracted-citation>, 32, <extracted-citation case-ids=\"12590142\" index=\"183\" url=\"https://cite.case.law/s-ct/135/2076/\">135 S.Ct. 2076</extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"184\" url=\"https://cite.case.law/s-ct/135/2076/\">192 L.Ed.2d 83</extracted-citation> (2015) (THOMAS, J., concurring in judgment in part and dissenting in part). He is \"Commander in Chief of the Army and Navy of the United States, and of the Militia of the several States, when called into the actual Service of the United States.\" Art. II, § 2, cl. 1. He has \"Power, by and with the Advice and Consent of the Senate, to make Treaties.\" Cl. 2. He has the power to \"nominate, and by and with the Advice and Consent of the Senate [to] appoint Ambassadors [and] other public Ministers and Consuls.\" <em><extracted-citation case-ids=\"12590142\" index=\"185\" url=\"https://cite.case.law/s-ct/135/2076/\">Ibid.</extracted-citation></em> He has the power to fill vacancies that arise during a Senate recess until \"the End of [the Senate's] next Session.\" Cl. 3. And he is responsible for \"receiv[ing] Ambassadors and other public Ministers\" from foreign countries. § 3.</p>\n<p id=\"p-111\">The President also has residual powers granted by Article II's Vesting Clause. \"By omitting the words 'herein granted' in [the Vesting Clause of] Article II, the Constitution indicates that the 'executive Power' vested in the President is not confined to those powers expressly identified in the document.\" <em>Zivotofsky</em> , <extracted-citation index=\"186\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\">576 U.S. at 34-35</extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"187\" url=\"https://cite.case.law/s-ct/135/2076/\">135 S.Ct. 2076</extracted-citation> (opinion of THOMAS, J.). Rather, the Constitution \"vests the residual foreign affairs powers of the Federal Government-<em>i.e.</em> , those not specifically enumerated in the Constitution-in the President.\" <em><extracted-citation case-ids=\"12590142\" index=\"188\" url=\"https://cite.case.law/s-ct/135/2076/\">Id.</extracted-citation></em> , at 33, <extracted-citation case-ids=\"12590142\" index=\"189\" url=\"https://cite.case.law/s-ct/135/2076/\">135 S.Ct. 2076</extracted-citation>. Evidence from both the founding and the early years of the Constitution confirms that the residual foreign affairs powers of the Government were part of the \"executive Power.\" <em>Id.,</em> at 35-40, <extracted-citation case-ids=\"12590142\" index=\"190\" url=\"https://cite.case.law/s-ct/135/2076/\">135 S.Ct. 2076</extracted-citation>.</p>\n<p id=\"p-112\">The President has extensive domestic responsibilities as well. He is given \"[t]he executive Power,\" Art. II, § 1, cl. 1, and is directed to \"take Care that the Laws be faithfully executed,\" § 3. \"The vesting of the executive power in the President was essentially a grant of the power to execute the laws.\" <em>Myers v. United States</em> , <extracted-citation case-ids=\"1501270\" index=\"191\" url=\"https://cite.case.law/us/272/52/#p117\">272 U.S. 52</extracted-citation>, 117, <extracted-citation case-ids=\"1501270\" index=\"192\" url=\"https://cite.case.law/us/272/52/#p117\">47 S.Ct. 21</extracted-citation>, <extracted-citation case-ids=\"1501270\" index=\"193\" url=\"https://cite.case.law/us/272/52/#p117\">71 L.Ed. 160</extracted-citation> (1926). Even under a proper understanding of the scope of federal power, the President could not possibly execute all of the laws himself. The President must accordingly appoint subordinates \"to act for <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2438\" href=\"#p2438\" id=\"p2438\">*2438</a>him under his direction in the execution of the laws.\" <em><extracted-citation case-ids=\"1501270\" index=\"194\" url=\"https://cite.case.law/us/272/52/#p117\">Ibid.</extracted-citation></em> Once officers are selected, the President must \"supervise and guide their construction of the statutes under which they act in order to secure that unitary and uniform execution of the laws which Article II of the Constitution evidently contemplated in vesting general executive power in the President alone.\" <em><extracted-citation case-ids=\"1501270\" index=\"195\" url=\"https://cite.case.law/us/272/52/#p117\">Id.</extracted-citation></em> , at 135, <extracted-citation case-ids=\"1501270\" index=\"196\" url=\"https://cite.case.law/us/272/52/#p117\">47 S.Ct. 21</extracted-citation>. And, of course, the President has the power to remove officers as he sees fit. <em><extracted-citation case-ids=\"1501270\" index=\"197\" url=\"https://cite.case.law/us/272/52/#p117\">Id.</extracted-citation></em> , at 176, <extracted-citation case-ids=\"1501270\" index=\"198\" url=\"https://cite.case.law/us/272/52/#p117\">47 S.Ct. 21</extracted-citation> ; see also <em>Seila Law LLC v. Consumer Financial Protection Bureau</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626479\" index=\"199\" url=\"https://cite.case.law/s-ct/140/2183/\">140 S.Ct. 2183</extracted-citation>, 2211 - 18, --- L.Ed.2d ---- (2020) (THOMAS, J., concurring in part and dissenting in part).</p>\n<p id=\"p-113\">In addition, the President has several specifically enumerated domestic powers. He has the \"Power to Grant Reprieves and Pardons for Offenses against the United States, except in Cases of Impeachment.\" Art. II, § 2, cl. 1. He also has the power to \"nominate, and by and with the Advice and Consent of the Senate [to] appoint ... Judges of the supreme Court, and all other Officers of the United States, whose Appointments are not herein otherwise provided for, and which shall be established by Law.\" Cl. 2. And he must \"give to the Congress Information of the State of the Union, and recommend to their Consideration such Measures as he shall judge necessary and expedient.\" § 3.</p>\n<p id=\"p-114\">The founding generation debated whether it was prudent to vest so many powers in a single person. Supporters of ratification responded that the design of the Presidency was necessary to the success of the Constitution. As Alexander Hamilton wrote:</p>\n<blockquote id=\"p-115\">\"Energy in the executive is a leading character in the definition of good government. It is essential to the protection of the community against foreign attacks; it is not less essential to the steady administration of the laws; to the protection of property against those irregular and high-handed combinations which sometimes interrupt the ordinary course of justice; to the security of liberty against the enterprises and assaults of ambition, of faction, and of anarchy.... A feeble Executive implies a feeble execution of the government. A feeble execution is but another phrase for a bad execution; and a government ill executed, whatever it may be in theory, must be, in practice, a bad government.\" The Federalist No. 70, at 423.</blockquote>\n<p id=\"p-116\">In sum, the demands on the President's time and the importance of his tasks are extraordinary, and the office of the President cannot be delegated to subordinates. A subpoena imposes both demands on the President's limited time and a mental burden, even when the President is not directly engaged in complying. This understanding of the Presidency should guide courts in deciding whether to enforce a subpoena for the President's documents.</p>\n<p id=\"p-117\">2</p>\n<p id=\"p-118\">Courts must also recognize their own limitations. When the President asserts that matters of foreign affairs or national defense preclude his compliance with a subpoena, the Judiciary will rarely have a basis for rejecting that assertion. Judges \"simply lack the relevant information and expertise to second-guess determinations made by the President based on information properly withheld.\" <em>Hamdi</em> , 542 U.S. at 583, <extracted-citation case-ids=\"5864651\" index=\"200\" url=\"https://cite.case.law/us/542/507/#p580\">124 S.Ct. 2633</extracted-citation> (THOMAS, J., dissenting).</p>\n<p id=\"p-119\">\"[E]ven if the courts could compel the Executive to produce the necessary information\" to understand the demands on his time, decisions about that information \"are simply not amenable to judicial determination because '[t]hey are delicate, complex, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2439\" href=\"#p2439\" id=\"p2439\">*2439</a>and involve large elements of prophecy.' \" <em><extracted-citation case-ids=\"5864651\" index=\"201\" url=\"https://cite.case.law/us/542/507/#p580\">Ibid.</extracted-citation></em> (quoting <em>Chicago &amp; Southern Air Lines, Inc. v. Waterman S. S. Corp.</em> , <extracted-citation case-ids=\"6157296\" index=\"202\" url=\"https://cite.case.law/us/333/103/#p111\">333 U.S. 103</extracted-citation>, 111, <extracted-citation case-ids=\"6157296\" index=\"203\" url=\"https://cite.case.law/us/333/103/#p111\">68 S.Ct. 431</extracted-citation>, <extracted-citation index=\"204\" url=\"https://cite.case.law/citations/?q=92%20L.%20Ed.%20568\">92 L.Ed. 568</extracted-citation> (1948) ). The President has at his disposal enormous amounts of classified intelligence regarding the Government's concerns around the globe. His decisionmaking is further informed by experience in matters of foreign affairs, national defense, and intelligence that judges almost always will not have. And his decisionmaking takes into account the full spectrum of the Government's operations, not just the matters directly related to a particular case. Even with perfect information, courts lack the institutional competence to engage in a searching review of the President's reasons for not complying with a subpoena.</p>\n<p id=\"p-120\">Here, too, Chief Justice Marshall was correct. A court should \"fee[l] many, perhaps, peculiar motives for manifesting as guarded a respect for the chief magistrate of the Union as is compatible with its official duties.\" <em>Burr</em> , 25 F.Cas. at 37. Courts should have the same \"circumspection\" as Chief Justice Marshall before \"tak[ing] any step which would in any manner relate to that high personage.\" <em>Id.</em> , at 35.<footnotemark>3</footnotemark></p>\n<p id=\"p-121\">* * *</p>\n<p id=\"p-122\">I agree with the majority that the President has no absolute immunity from the issuance of this subpoena. The President also sought relief from enforcement of the subpoena, however, and he asked this Court to allow further proceedings on that question if we rejected his claim of absolute immunity. The Court inexplicably fails to address this request, although its decision leaves the President free to renew his request for an injunction against enforcement immediately on remand.</p>\n<p id=\"p-123\">I would vacate and remand to allow the District Court to determine whether enforcement of this subpoena should be enjoined because the President's \"duties as chief magistrate demand his whole time for national objects.\" <em>Id.</em> , at 34. Accordingly, I respectfully dissent.</p>\n<footnote label=\"1\">\n<p id=\"p-203\">See, <em>e.g.</em> , <em>American Ins. Assn. v. Garamendi</em> , <extracted-citation case-ids=\"8898031\" index=\"205\" url=\"https://cite.case.law/us/539/396/#p415\">539 U.S. 396</extracted-citation>, 415, <extracted-citation case-ids=\"8898031\" index=\"206\" url=\"https://cite.case.law/us/539/396/#p415\">123 S.Ct. 2374</extracted-citation>, <extracted-citation case-ids=\"8898031\" index=\"207\" url=\"https://cite.case.law/us/539/396/#p415\">156 L.Ed.2d 376</extracted-citation> (2003) ; <em>Dames &amp; Moore v. Regan</em> , <extracted-citation case-ids=\"11723350\" index=\"208\" url=\"https://cite.case.law/us/453/654/#p679\">453 U.S. 654</extracted-citation>, 679-683, <extracted-citation case-ids=\"11723350\" index=\"209\" url=\"https://cite.case.law/us/453/654/#p679\">101 S.Ct. 2972</extracted-citation>, <extracted-citation case-ids=\"11723350\" index=\"210\" url=\"https://cite.case.law/us/453/654/#p679\">69 L.Ed.2d 918</extracted-citation> (1981) ; <em>United States v. Pink</em> , <extracted-citation case-ids=\"374717\" index=\"211\" url=\"https://cite.case.law/us/315/203/#p229\">315 U.S. 203</extracted-citation>, 229-230, <extracted-citation case-ids=\"374717\" index=\"212\" url=\"https://cite.case.law/us/315/203/#p229\">62 S.Ct. 552</extracted-citation>, <extracted-citation case-ids=\"374717\" index=\"213\" url=\"https://cite.case.law/us/315/203/#p229\">86 L.Ed. 796</extracted-citation> (1942) ; <em>United States v. Belmont</em> , <extracted-citation case-ids=\"547737\" index=\"214\" url=\"https://cite.case.law/us/301/324/#p332\">301 U.S. 324</extracted-citation>, 330-331, <extracted-citation case-ids=\"547737\" index=\"215\" url=\"https://cite.case.law/us/301/324/#p332\">57 S.Ct. 758</extracted-citation>, <extracted-citation case-ids=\"547737\" index=\"216\" url=\"https://cite.case.law/us/301/324/#p332\">81 L.Ed. 1134</extracted-citation> (1937).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-204\">Foreign Assistance Act of 1961, <extracted-citation index=\"217\" url=\"https://cite.case.law/citations/?q=22%20U.S.C.%20%C2%A7%202318\">22 U.S.C. § 2318</extracted-citation>(a)(1) (permitting the President to order \"the drawdown of defense articles from the stocks of the Department of Defense\" in the event of \"an unforeseen emergency ... which requires immediate military assistance to a foreign country or international organization\"); National Emergencies Act, <extracted-citation index=\"218\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%201621\">50 U.S.C. § 1621</extracted-citation> (authorizing the President to declare a national emergency and activate over 100 statutory emergency powers); International Emergency Economic Powers Act, <extracted-citation index=\"219\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%201701\">50 U.S.C. § 1701</extracted-citation>(a) (granting Presidential emergency power \"to deal with any unusual and extraordinary threat, which has its source in whole or substantial part outside the United States, to the national security, foreign policy, or economy of the United States\"); Trading with the Enemy Act, <extracted-citation index=\"220\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%204305\">50 U.S.C. § 4305</extracted-citation>(b)(1)(B) (authorizing the President, \"[d]uring the time of war,\" to prohibit \"transactions involvin[g] any property in which any foreign country or a national thereof has any interest,\" among other things); Trade Expansion Act of 1962, <extracted-citation index=\"221\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%201862\">19 U.S.C. § 1862</extracted-citation>(c)(3)(A) (authorizing \"actions as the President deems necessary to adjust the imports of \" certain articles of trade \"so that such imports will not threaten to impair the national security\"); Trade Act of 1974, <extracted-citation index=\"222\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%202132\">19 U.S.C. § 2132</extracted-citation>(a) (authorizing the President, among other things, to impose temporary duty surcharges or quotas in order to address \"large and serious United States balance-of-payments deficits,\" \"an imminent and significant depreciation of the dollar in foreign exchange markets,\" or \"to cooperate with other countries in correcting an international balance-of-payments disequilibrium\"), § 2133(a) (authorizing the President, whenever a specified event \"increases or imposes any duty or other import restriction,\" to \"enter into trade agreements with foreign countries or instrumentalities for the purpose of granting new concessions as compensation in order to maintain the general level of reciprocal and mutually advantageous concessions\" and to take actions \"to carry out any such agreement\"), § 2411(a) (mandating the U. S. Trade Representative, subject to the President's direction, to modify tariff rates if \"the rights of the United States under any trade agreement are being denied\" or if a foreign country's actions are \"unjustifiable and burde[n] or restric[t] United States commerce\"), § 2461 (authorizing the President to \"provide duty-free treatment for any eligible article from any beneficiary developing country\"); Bipartisan Congressional Trade Priorities and Accountability Act of 2015, <extracted-citation index=\"223\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%C2%A7%204201\">19 U.S.C. §§ 4201</extracted-citation> -4210 (most recent delegation of trade-promotion authority, authorizing the President to negotiate and enter trade agreements); Immigration and Nationality Act of 1952, <extracted-citation index=\"224\" url=\"https://cite.case.law/citations/?q=8%20U.S.C.%20%C2%A7%201182\">8 U.S.C. § 1182</extracted-citation>(f) (authorizing the President, \"for such period as he shall deem necessary,\" to \"suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate,\" \"[w]henever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States\").</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-205\">See Letter from G. Bush to Congressional Leaders on Temporary Transfer of the Powers and Duties of President of the United States (June 29, 2002), www.presidency.ucsb.edu/node/213575; Letter from G. Bush to Congressional Leaders on the Temporary Transfer of the Powers and Duties of the President of the United States (July 21, 2007), www.presidency.ucsb.edu/node/276172; see also Stolberg, For a Short While Today, It Will Be President Cheney, N. Y. Times, July 21, 2007, p. A11, col. 1.</p>\n</footnote>\n</opinion>", "html_with_citations": "<opinion type=\"dissent\">\n<author id=\"p-83\">Justice THOMAS, dissenting.</author>\n<p id=\"p-84\">Respondent Cyrus Vance, Jr., the district attorney for the County of New York, served a grand jury subpoena on the President's personal accounting firm. The subpoena, which is nearly identical to a subpoena issued by a congressional Committee, requests nearly 10 years of the President's personal financial records. <em>Ante</em> , at 2420, and n. 2. In response to this troublingly broad request, the President, in his personal capacity, sought a declaration in federal court \" 'that the subpoena is invalid and unenforceable' \" and an injunction preventing respondent \" 'from taking any action to enforce the subpoena.' \" <em>Ante</em> , at 2420. The District Court denied the President's motion for a preliminary <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2434\" href=\"#p2434\" id=\"p2434\">*2434</a>injunction, and the Second Circuit affirmed in relevant part. <em>Ante</em> , at 2420 - 2421.</p>\n<p id=\"p-85\">The President argues that he is absolutely immune from the issuance of any subpoena, but that if the Court disagrees, we should remand so that the District Court can develop a record about this particular subpoena. I agree with the majority that the President is not entitled to absolute immunity from <em>issuance</em> of the subpoena. But he may be entitled to relief against its <em>enforcement</em> . I therefore agree with the President that the proper course is to vacate and remand. If the President can show that \"his duties as chief magistrate demand his whole time for national objects,\" <em>United States v. Burr</em> , <extracted-citation case-ids=\"6579548\" index=\"162\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. 30</a></span></extracted-citation>, 34 (No. 14,692d) (CC Va. 1807) (Marshall, C. J.), he is entitled to relief from enforcement of the subpoena.</p>\n<p id=\"p-86\">I</p>\n<p id=\"p-87\">The President first argues that he has absolute immunity from the issuance of grand jury subpoenas during his term in office. This Court has recognized absolute immunity for the President from \"damages liability predicated on his official acts.\" <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"163\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, 749, <extracted-citation case-ids=\"6194478\" index=\"164\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"165\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982). But we have rejected absolute immunity from damages actions for a President's nonofficial conduct, <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"166\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. 681</a></span></extracted-citation>, 684, <extracted-citation case-ids=\"11652833\" index=\"167\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"168\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997), and we have never addressed the question of immunity from a grand jury subpoena.</p>\n<p id=\"p-88\">I agree with the majority that the President does not have absolute immunity from the issuance of a grand jury subpoena. Unlike the majority, however, I do not reach this conclusion based on a primarily functionalist analysis. Instead, I reach it based on the text of the Constitution, which, as understood by the ratifying public and incorporated into an early circuit opinion by Chief Justice Marshall, does not support the President's claim of absolute immunity.<footnotemark>1</footnotemark></p>\n<p id=\"p-89\">A</p>\n<p id=\"p-90\">1</p>\n<p id=\"p-91\">The text of the Constitution explicitly addresses the privileges of some federal officials, but it does not afford the President absolute immunity. Members of Congress are \"privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same,\" except for \"Treason, Felony and Breach of the Peace.\" Art. I, § 6, cl. 1. The Constitution further specifies that, \"for any Speech or Debate in either House, they shall not be questioned in any other Place.\" <em><extracted-citation case-ids=\"11652833\" index=\"169\" url=\"https://cite.case.law/us/520/681/#p704\">Ibid.</extracted-citation></em> By contrast, the text of the Constitution contains no explicit grant of absolute immunity from legal process for the President. As a Federalist essayist noted during ratification, the President's \"person is not so much protected as that of a member of the House of Representatives\" because he is subject to the issuance of judicial process \"like any other man in the ordinary course of law.\" An American Citizen I (Sept. 26, 1787), in 2 Documentary History of the Ratification of the Constitution 141 (M. Jansen ed. 1976) (emphasis deleted).</p>\n<p id=\"p-92\">Prominent defenders of the Constitution confirmed the lack of absolute Presidential immunity. James Wilson, a signer of the Constitution and future Justice of this Court, explained to his fellow Pennsylvanians that \"far from being above the laws, [the President] is amenable to them in his <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2435\" href=\"#p2435\" id=\"p2435\">*2435</a>private character as a citizen, and in his public character by <em>impeachment</em> .\" 2 Debates on the Constitution 480 (J. Elliot ed. 1891) (emphasis in original). James Iredell, another future Justice, observed in the North Carolina ratifying convention that \"[i]f [the President] commits any crime, he is punishable by the laws of his country.\" 4 <em><extracted-citation case-ids=\"11652833\" index=\"170\" url=\"https://cite.case.law/us/520/681/#p704\">id.</extracted-citation></em> , at 109. A fellow North Carolinian similarly argued that, \"[w]ere it possible to suppose that the President should give wrong instructions to his deputies, ... citizens ... would have redress in the ordinary courts of common law.\" <em><extracted-citation case-ids=\"11652833\" index=\"171\" url=\"https://cite.case.law/us/520/681/#p704\">Id.</extracted-citation></em> , at 47; see also Americanus No. 2, in 19 Documentary History of the Ratification of the Constitution 288-289 (J. Kaminski &amp; G. Saladino eds. 2003); Americanus No. 4, in <em><extracted-citation case-ids=\"11652833\" index=\"172\" url=\"https://cite.case.law/us/520/681/#p704\">id.</extracted-citation></em> , at 359.</p>\n<p id=\"p-93\">2</p>\n<p id=\"p-94\">The sole authority that the President cites from the drafting or ratification process is The Federalist No. 69, but it provides him no real support. Alexander Hamilton stated that \"[t]he President of the United States would be liable to be impeached, tried, and upon conviction of treason, bribery, or other high crimes or misdemeanors, removed from office; and would afterwards be liable to prosecution and punishment in the ordinary course of law.\" The Federalist No. 69, p. 416 (C. Rossiter ed. 1961). Hamilton did not say that the President was temporarily immune from judicial process. Moreover, he made this comment to reassure readers that the President was \"amenable to personal punishment and disgrace.\" <em><extracted-citation case-ids=\"11652833\" index=\"173\" url=\"https://cite.case.law/us/520/681/#p704\">Id.</extracted-citation></em> , at 422. For the President, this is at best ambiguous evidence that cannot overcome the clear evidence discussed above.</p>\n<p id=\"p-95\">The President further relies on a private letter written by President Jefferson. In the letter, Jefferson worried that the Executive would lose his independence \"if he were subject to the <em>commands</em> of the [judiciary], &amp; to imprisonment for disobedience; if the several courts could bandy him from pillar to post, keep him constantly trudging from north to south &amp; east to west, and withdraw him entirely from his constitutional duties.\" 10 Works of Thomas Jefferson 404 n. (P. Ford ed. 1905) (emphasis in original). But President Jefferson never squarely argued for absolute immunity. Yoo, The First Claim: The Burr Trial, <em>United States v. Nixon</em> , and Presidential Power, <extracted-citation index=\"174\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\"><span class=\"citation no-link\">83 Minn. L. Rev. 1435</span></extracted-citation>, 1450 (1999). And, the concern Jefferson had about demands on the President's time is addressed by the standard that Chief Justice Marshall articulated in <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> . See <em>infra</em> , at 2426 - 2427.</p>\n<p id=\"p-96\">The President also quotes the views of Vice President John Adams and then-Senator Oliver Ellsworth in 1789. The record of the conversation we have from a fellow Senator's diary is brief. Adams or Ellsworth (or perhaps both) stated that \"you could only impeach [the President], and no other process whatever lay against him.\" Journal of William Maclay 167 (E. Maclay ed. 1890). The only reason given was that it would \"stop the whole machine of Government.\" <em><extracted-citation index=\"175\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> Senator Philip Schuyler joined the conversation and gave his own reason: \" 'I think the President [is] a kind of sacred person.' \" <em><extracted-citation index=\"176\" url=\"https://cite.case.law/citations/?q=83%20Minn.%20L.%20Rev.%201435\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> Schuyler's theory clearly has no basis in the Constitution, and the view held by Adams and Ellsworth seems to be grounds for relief from enforcement rather than a basis for absolute immunity from issuance of a subpoena.</p>\n<p id=\"p-97\">B</p>\n<p id=\"p-98\">This original understanding is reflected in an early circuit decision by Chief Justice Marshall, on which the majority partially relies. In 1805, disgraced former Vice President Aaron Burr began a murky series of negotiations to raise a volunteer army in the Western Territories.</p>\n<p id=\"p-99\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2436\" href=\"#p2436\" id=\"p2436\">*2436</a><em>Ante</em> , at 2421 - 2422. One of his contacts, General James Wilkinson, was not only commander of the Army and Governor of Louisiana, but also a Spanish spy. <em>Ante</em> , at 2421, n. 4; Yoo, <em>supra</em> , at 1440. After Burr set out with his army-perhaps to attack Spanish forces or perhaps to separate Western Territories from the United States-Wilkinson wrote to President Jefferson and accused Burr of the latter. <em>Ante</em> , at 2421; Yoo, <em>supra</em> , at 1440. Burr was arrested for treason and brought before a grand jury in Richmond, where Chief Justice Marshall presided.</p>\n<p id=\"p-100\">During the grand jury proceedings, Burr moved for a <em>subpoena duces tecum</em> ordering President Jefferson to produce the correspondence concerning Burr. <em>Burr</em> , <span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/#30\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. at 30</a></span>. Chief Justice Marshall pre-emptively rejected any notion of absolute immunity, despite the fact that the Government did not so much as suggest it in court. He distinguished the President from the British monarch, who did have immunity, calling it an \"essentia[l] ... difference\" in our system that the President \"is elected from the mass of the people, and, on the expiration of the time for which he is elected, returns to the mass of the people again.\" <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></em> , at 34. Thus, the President was more like a state governor or a member of the British cabinet than a king. Chief Justice Marshall found no authority suggesting that these officials were immune from judicial process. <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></em> ; see also <em>ante</em> , at 2422 - 2423.</p>\n<p id=\"p-101\">Based on the evidence of original meaning and Chief Justice Marshall's early interpretation in <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> , the better reading of the text of the Constitution is that the President has no absolute immunity from the issuance of a grand jury subpoena.</p>\n<p id=\"p-102\">II</p>\n<p id=\"p-103\">In addition to contesting the issuance of the subpoena, the President also seeks injunctive and declaratory relief against its enforcement. The majority recognizes that the President can seek relief from enforcement, but it does not vacate and remand for the lower courts to address this question. I would do so and instruct them to apply the standard articulated by Chief Justice Marshall in <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> : If the President is unable to comply because of his official duties, then he is entitled to injunctive and declaratory relief.</p>\n<p id=\"p-104\">A</p>\n<p id=\"p-105\">In <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> , after explaining that the President was not absolutely immune from issuance of a subpoena, Chief Justice Marshall proceeded to explain that the President might be excused from the enforcement of one. As he put it, \"[t]he guard, furnished to this high officer, to protect him from being harassed by vexatious and unnecessary subpoenas, is to be looked for in the conduct of a court <em>after those subpoenas have issued</em> ; not in any circumstance which is to precede their being issued.\" <span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/#34\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. at 34</a></span> (emphasis added). Chief Justice Marshall set out the pertinent standard: To avoid enforcement of the subpoena, the President must \"sho[w]\" that \"his duties as chief magistrate demand his whole time for national objects.\" <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></em><footnotemark>2</footnotemark></p>\n<p id=\"p-106\">Although <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> involved a federal subpoena, the same principle applies to a state subpoena. The ability of the President to <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2437\" href=\"#p2437\" id=\"p2437\">*2437</a>discharge his duties until his term expires or he is removed from office by the Senate is \"integral to the structure of the Constitution.\" <em>Franchise Tax Bd. of Cal. v. Hyatt</em> , 587 U. S. ----, ----, <extracted-citation case-ids=\"12619240\" index=\"177\" url=\"https://cite.case.law/s-ct/139/1485/#p1498\"><span class=\"citation\" data-id=\"4396209\"><a href=\"/opinion/4618956/franchise-tax-bd-of-cal-v-hyatt/\" aria-description=\"Citation for case: Franchise Tax Bd. of Cal. v. Hyatt\">139 S.Ct. 1485</a></span></extracted-citation>, 1498, <extracted-citation index=\"178\" url=\"https://cite.case.law/citations/?q=203%20L.%20Ed.%202d%20768\"><span class=\"citation\" data-id=\"4396209\"><a href=\"/opinion/4618956/franchise-tax-bd-of-cal-v-hyatt/\" aria-description=\"Citation for case: Franchise Tax Bd. of Cal. v. Hyatt\">203 L.Ed.2d 768</a></span></extracted-citation> (2019). The Constitution is the \"supreme Law of the Land,\" Art. VI, cl. 2, so a state court can no more enforce a subpoena when national concerns demand the President's entire time than a federal court can. Accordingly, a federal court may provide injunctive and declaratory relief to stay enforcement of a state subpoena when the President meets the <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> standard.</p>\n<p id=\"p-107\">B</p>\n<p id=\"p-108\">The <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Burr</a></span></em> standard places the burden on the President but also requires courts to take pains to respect the demands on the President's time. The Constitution vests the President with extensive powers and responsibilities, and courts are poorly situated to conduct a searching review of the President's assertion that he is unable to comply.</p>\n<p id=\"p-109\">1</p>\n<p id=\"p-110\">The President has vast responsibilities both abroad and at home. The Founders gave the President \"primary responsibility-along with the necessary power-to protect the national security and to conduct the Nation's foreign relations.\" <em>Hamdi v. Rumsfeld</em> , <extracted-citation case-ids=\"5864651\" index=\"179\" url=\"https://cite.case.law/us/542/507/#p580\"><span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">542 U.S. 507</a></span></extracted-citation>, 580, <extracted-citation case-ids=\"5864651\" index=\"180\" url=\"https://cite.case.law/us/542/507/#p580\"><span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">124 S.Ct. 2633</a></span></extracted-citation>, <extracted-citation case-ids=\"5864651\" index=\"181\" url=\"https://cite.case.law/us/542/507/#p580\"><span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">159 L.Ed.2d 578</a></span></extracted-citation> (2004) (THOMAS, J., dissenting). The Constitution \"expressly identifies certain foreign affairs powers and vests them\" in his office. <em>Zivotofsky v. Kerry</em> , <extracted-citation index=\"182\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\"><span class=\"citation no-link\">576 U.S. 1</span></extracted-citation>, 32, <extracted-citation case-ids=\"12590142\" index=\"183\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">135 S.Ct. 2076</a></span></extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"184\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">192 L.Ed.2d 83</a></span></extracted-citation> (2015) (THOMAS, J., concurring in judgment in part and dissenting in part). He is \"Commander in Chief of the Army and Navy of the United States, and of the Militia of the several States, when called into the actual Service of the United States.\" Art. II, § 2, cl. 1. He has \"Power, by and with the Advice and Consent of the Senate, to make Treaties.\" Cl. 2. He has the power to \"nominate, and by and with the Advice and Consent of the Senate [to] appoint Ambassadors [and] other public Ministers and Consuls.\" <em><extracted-citation case-ids=\"12590142\" index=\"185\" url=\"https://cite.case.law/s-ct/135/2076/\">Ibid.</extracted-citation></em> He has the power to fill vacancies that arise during a Senate recess until \"the End of [the Senate's] next Session.\" Cl. 3. And he is responsible for \"receiv[ing] Ambassadors and other public Ministers\" from foreign countries. § 3.</p>\n<p id=\"p-111\">The President also has residual powers granted by Article II's Vesting Clause. \"By omitting the words 'herein granted' in [the Vesting Clause of] Article II, the Constitution indicates that the 'executive Power' vested in the President is not confined to those powers expressly identified in the document.\" <em>Zivotofsky</em> , <extracted-citation index=\"186\" url=\"https://cite.case.law/citations/?q=576%20U.S.%201\">576 U.S. at 34-35</extracted-citation>, <extracted-citation case-ids=\"12590142\" index=\"187\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">135 S.Ct. 2076</a></span></extracted-citation> (opinion of THOMAS, J.). Rather, the Constitution \"vests the residual foreign affairs powers of the Federal Government-<em>i.e.</em> , those not specifically enumerated in the Constitution-in the President.\" <em><extracted-citation case-ids=\"12590142\" index=\"188\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">Id.</a></span></extracted-citation></em> , at 33, <extracted-citation case-ids=\"12590142\" index=\"189\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">135 S.Ct. 2076</a></span></extracted-citation>. Evidence from both the founding and the early years of the Constitution confirms that the residual foreign affairs powers of the Government were part of the \"executive Power.\" <em>Id.,</em> at 35-40, <extracted-citation case-ids=\"12590142\" index=\"190\" url=\"https://cite.case.law/s-ct/135/2076/\"><span class=\"citation\" data-id=\"9808243\"><a href=\"/opinion/2808294/zivotofsky-v-kerry/\" aria-description=\"Citation for case: Zivotofsky v. Kerry\">135 S.Ct. 2076</a></span></extracted-citation>.</p>\n<p id=\"p-112\">The President has extensive domestic responsibilities as well. He is given \"[t]he executive Power,\" Art. II, § 1, cl. 1, and is directed to \"take Care that the Laws be faithfully executed,\" § 3. \"The vesting of the executive power in the President was essentially a grant of the power to execute the laws.\" <em>Myers v. United States</em> , <extracted-citation case-ids=\"1501270\" index=\"191\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">272 U.S. 52</a></span></extracted-citation>, 117, <extracted-citation case-ids=\"1501270\" index=\"192\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">47 S.Ct. 21</a></span></extracted-citation>, <extracted-citation case-ids=\"1501270\" index=\"193\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">71 L.Ed. 160</a></span></extracted-citation> (1926). Even under a proper understanding of the scope of federal power, the President could not possibly execute all of the laws himself. The President must accordingly appoint subordinates \"to act for <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2438\" href=\"#p2438\" id=\"p2438\">*2438</a>him under his direction in the execution of the laws.\" <em><extracted-citation case-ids=\"1501270\" index=\"194\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">Ibid.</a></span></extracted-citation></em> Once officers are selected, the President must \"supervise and guide their construction of the statutes under which they act in order to secure that unitary and uniform execution of the laws which Article II of the Constitution evidently contemplated in vesting general executive power in the President alone.\" <em><extracted-citation case-ids=\"1501270\" index=\"195\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">Id.</a></span></extracted-citation></em> , at 135, <extracted-citation case-ids=\"1501270\" index=\"196\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">47 S.Ct. 21</a></span></extracted-citation>. And, of course, the President has the power to remove officers as he sees fit. <em><extracted-citation case-ids=\"1501270\" index=\"197\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">Id.</a></span></extracted-citation></em> , at 176, <extracted-citation case-ids=\"1501270\" index=\"198\" url=\"https://cite.case.law/us/272/52/#p117\"><span class=\"citation\" data-id=\"9418565\"><a href=\"/opinion/100926/myers-v-united-states/\" aria-description=\"Citation for case: Myers v. United States\">47 S.Ct. 21</a></span></extracted-citation> ; see also <em>Seila Law LLC v. Consumer Financial Protection Bureau</em> , --- U.S. ----, ---- - ----, <extracted-citation case-ids=\"12626479\" index=\"199\" url=\"https://cite.case.law/s-ct/140/2183/\"><span class=\"citation\" data-id=\"4544798\"><a href=\"/opinion/4764451/seila-law-llc-v-consumer-financial-protection-bureau/\" aria-description=\"Citation for case: Seila Law LLC v. Consumer Financial Protection Bureau\">140 S.Ct. 2183</a></span></extracted-citation>, 2211 - 18, --- L.Ed.2d ---- (2020) (THOMAS, J., concurring in part and dissenting in part).</p>\n<p id=\"p-113\">In addition, the President has several specifically enumerated domestic powers. He has the \"Power to Grant Reprieves and Pardons for Offenses against the United States, except in Cases of Impeachment.\" Art. II, § 2, cl. 1. He also has the power to \"nominate, and by and with the Advice and Consent of the Senate [to] appoint ... Judges of the supreme Court, and all other Officers of the United States, whose Appointments are not herein otherwise provided for, and which shall be established by Law.\" Cl. 2. And he must \"give to the Congress Information of the State of the Union, and recommend to their Consideration such Measures as he shall judge necessary and expedient.\" § 3.</p>\n<p id=\"p-114\">The founding generation debated whether it was prudent to vest so many powers in a single person. Supporters of ratification responded that the design of the Presidency was necessary to the success of the Constitution. As Alexander Hamilton wrote:</p>\n<blockquote id=\"p-115\">\"Energy in the executive is a leading character in the definition of good government. It is essential to the protection of the community against foreign attacks; it is not less essential to the steady administration of the laws; to the protection of property against those irregular and high-handed combinations which sometimes interrupt the ordinary course of justice; to the security of liberty against the enterprises and assaults of ambition, of faction, and of anarchy.... A feeble Executive implies a feeble execution of the government. A feeble execution is but another phrase for a bad execution; and a government ill executed, whatever it may be in theory, must be, in practice, a bad government.\" The Federalist No. 70, at 423.</blockquote>\n<p id=\"p-116\">In sum, the demands on the President's time and the importance of his tasks are extraordinary, and the office of the President cannot be delegated to subordinates. A subpoena imposes both demands on the President's limited time and a mental burden, even when the President is not directly engaged in complying. This understanding of the Presidency should guide courts in deciding whether to enforce a subpoena for the President's documents.</p>\n<p id=\"p-117\">2</p>\n<p id=\"p-118\">Courts must also recognize their own limitations. When the President asserts that matters of foreign affairs or national defense preclude his compliance with a subpoena, the Judiciary will rarely have a basis for rejecting that assertion. Judges \"simply lack the relevant information and expertise to second-guess determinations made by the President based on information properly withheld.\" <em>Hamdi</em> , <span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/#583\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">542 U.S. at 583</a></span>, <extracted-citation case-ids=\"5864651\" index=\"200\" url=\"https://cite.case.law/us/542/507/#p580\"><span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">124 S.Ct. 2633</a></span></extracted-citation> (THOMAS, J., dissenting).</p>\n<p id=\"p-119\">\"[E]ven if the courts could compel the Executive to produce the necessary information\" to understand the demands on his time, decisions about that information \"are simply not amenable to judicial determination because '[t]hey are delicate, complex, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2439\" href=\"#p2439\" id=\"p2439\">*2439</a>and involve large elements of prophecy.' \" <em><extracted-citation case-ids=\"5864651\" index=\"201\" url=\"https://cite.case.law/us/542/507/#p580\"><span class=\"citation\" data-id=\"9842193\"><a href=\"/opinion/137001/hamdi-v-rumsfeld/\" aria-description=\"Citation for case: Hamdi v. Rumsfeld\">Ibid.</a></span></extracted-citation></em> (quoting <em>Chicago &amp; Southern Air Lines, Inc. v. Waterman S. S. Corp.</em> , <extracted-citation case-ids=\"6157296\" index=\"202\" url=\"https://cite.case.law/us/333/103/#p111\"><span class=\"citation\" data-id=\"9420099\"><a href=\"/opinion/104510/chicago-southern-air-lines-inc-v-waterman-steamship-corp/\" aria-description=\"Citation for case: Chicago &amp; Southern Air Lines, Inc. v. Waterman Steamship...\">333 U.S. 103</a></span></extracted-citation>, 111, <extracted-citation case-ids=\"6157296\" index=\"203\" url=\"https://cite.case.law/us/333/103/#p111\"><span class=\"citation\" data-id=\"9420099\"><a href=\"/opinion/104510/chicago-southern-air-lines-inc-v-waterman-steamship-corp/\" aria-description=\"Citation for case: Chicago &amp; Southern Air Lines, Inc. v. Waterman Steamship...\">68 S.Ct. 431</a></span></extracted-citation>, <extracted-citation index=\"204\" url=\"https://cite.case.law/citations/?q=92%20L.%20Ed.%20568\"><span class=\"citation no-link\">92 L.Ed. 568</span></extracted-citation> (1948) ). The President has at his disposal enormous amounts of classified intelligence regarding the Government's concerns around the globe. His decisionmaking is further informed by experience in matters of foreign affairs, national defense, and intelligence that judges almost always will not have. And his decisionmaking takes into account the full spectrum of the Government's operations, not just the matters directly related to a particular case. Even with perfect information, courts lack the institutional competence to engage in a searching review of the President's reasons for not complying with a subpoena.</p>\n<p id=\"p-120\">Here, too, Chief Justice Marshall was correct. A court should \"fee[l] many, perhaps, peculiar motives for manifesting as guarded a respect for the chief magistrate of the Union as is compatible with its official duties.\" <em>Burr</em> , <span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/#37\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. at 37</a></span>. Courts should have the same \"circumspection\" as Chief Justice Marshall before \"tak[ing] any step which would in any manner relate to that high personage.\" <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></em> , at 35.<footnotemark>3</footnotemark></p>\n<p id=\"p-121\">* * *</p>\n<p id=\"p-122\">I agree with the majority that the President has no absolute immunity from the issuance of this subpoena. The President also sought relief from enforcement of the subpoena, however, and he asked this Court to allow further proceedings on that question if we rejected his claim of absolute immunity. The Court inexplicably fails to address this request, although its decision leaves the President free to renew his request for an injunction against enforcement immediately on remand.</p>\n<p id=\"p-123\">I would vacate and remand to allow the District Court to determine whether enforcement of this subpoena should be enjoined because the President's \"duties as chief magistrate demand his whole time for national objects.\" <em><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></em> , at 34. Accordingly, I respectfully dissent.</p>\n<footnote label=\"1\">\n<p id=\"p-203\">See, <em>e.g.</em> , <em>American Ins. Assn. v. Garamendi</em> , <extracted-citation case-ids=\"8898031\" index=\"205\" url=\"https://cite.case.law/us/539/396/#p415\"><span class=\"citation\" data-id=\"9434497\"><a href=\"/opinion/130156/american-ins-assn-v-garamendi/\" aria-description=\"Citation for case: American Ins. Assn. v. Garamendi\">539 U.S. 396</a></span></extracted-citation>, 415, <extracted-citation case-ids=\"8898031\" index=\"206\" url=\"https://cite.case.law/us/539/396/#p415\"><span class=\"citation\" data-id=\"9434497\"><a href=\"/opinion/130156/american-ins-assn-v-garamendi/\" aria-description=\"Citation for case: American Ins. Assn. v. Garamendi\">123 S.Ct. 2374</a></span></extracted-citation>, <extracted-citation case-ids=\"8898031\" index=\"207\" url=\"https://cite.case.law/us/539/396/#p415\"><span class=\"citation\" data-id=\"9434497\"><a href=\"/opinion/130156/american-ins-assn-v-garamendi/\" aria-description=\"Citation for case: American Ins. Assn. v. Garamendi\">156 L.Ed.2d 376</a></span></extracted-citation> (2003) ; <em>Dames &amp; Moore v. Regan</em> , <extracted-citation case-ids=\"11723350\" index=\"208\" url=\"https://cite.case.law/us/453/654/#p679\"><span class=\"citation\" data-id=\"9428506\"><a href=\"/opinion/110564/dames-moore-v-regan/\" aria-description=\"Citation for case: Dames &amp; Moore v. Regan\">453 U.S. 654</a></span></extracted-citation>, 679-683, <extracted-citation case-ids=\"11723350\" index=\"209\" url=\"https://cite.case.law/us/453/654/#p679\"><span class=\"citation\" data-id=\"9428506\"><a href=\"/opinion/110564/dames-moore-v-regan/\" aria-description=\"Citation for case: Dames &amp; Moore v. Regan\">101 S.Ct. 2972</a></span></extracted-citation>, <extracted-citation case-ids=\"11723350\" index=\"210\" url=\"https://cite.case.law/us/453/654/#p679\"><span class=\"citation\" data-id=\"9428506\"><a href=\"/opinion/110564/dames-moore-v-regan/\" aria-description=\"Citation for case: Dames &amp; Moore v. Regan\">69 L.Ed.2d 918</a></span></extracted-citation> (1981) ; <em>United States v. Pink</em> , <extracted-citation case-ids=\"374717\" index=\"211\" url=\"https://cite.case.law/us/315/203/#p229\"><span class=\"citation\" data-id=\"9419200\"><a href=\"/opinion/103609/united-states-v-pink/\" aria-description=\"Citation for case: United States v. Pink\">315 U.S. 203</a></span></extracted-citation>, 229-230, <extracted-citation case-ids=\"374717\" index=\"212\" url=\"https://cite.case.law/us/315/203/#p229\"><span class=\"citation\" data-id=\"9419200\"><a href=\"/opinion/103609/united-states-v-pink/\" aria-description=\"Citation for case: United States v. Pink\">62 S.Ct. 552</a></span></extracted-citation>, <extracted-citation case-ids=\"374717\" index=\"213\" url=\"https://cite.case.law/us/315/203/#p229\"><span class=\"citation\" data-id=\"9419200\"><a href=\"/opinion/103609/united-states-v-pink/\" aria-description=\"Citation for case: United States v. Pink\">86 L.Ed. 796</a></span></extracted-citation> (1942) ; <em>United States v. Belmont</em> , <extracted-citation case-ids=\"547737\" index=\"214\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">301 U.S. 324</a></span></extracted-citation>, 330-331, <extracted-citation case-ids=\"547737\" index=\"215\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">57 S.Ct. 758</a></span></extracted-citation>, <extracted-citation case-ids=\"547737\" index=\"216\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">81 L.Ed. 1134</a></span></extracted-citation> (1937).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-204\">Foreign Assistance Act of 1961, <extracted-citation index=\"217\" url=\"https://cite.case.law/citations/?q=22%20U.S.C.%20%C2%A7%202318\"><span class=\"citation no-link\">22 U.S.C. § 2318</span></extracted-citation>(a)(1) (permitting the President to order \"the drawdown of defense articles from the stocks of the Department of Defense\" in the event of \"an unforeseen emergency ... which requires immediate military assistance to a foreign country or international organization\"); National Emergencies Act, <extracted-citation index=\"218\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%201621\"><span class=\"citation no-link\">50 U.S.C. § 1621</span></extracted-citation> (authorizing the President to declare a national emergency and activate over 100 statutory emergency powers); International Emergency Economic Powers Act, <extracted-citation index=\"219\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%201701\"><span class=\"citation no-link\">50 U.S.C. § 1701</span></extracted-citation>(a) (granting Presidential emergency power \"to deal with any unusual and extraordinary threat, which has its source in whole or substantial part outside the United States, to the national security, foreign policy, or economy of the United States\"); Trading with the Enemy Act, <extracted-citation index=\"220\" url=\"https://cite.case.law/citations/?q=50%20U.S.C.%20%C2%A7%204305\"><span class=\"citation no-link\">50 U.S.C. § 4305</span></extracted-citation>(b)(1)(B) (authorizing the President, \"[d]uring the time of war,\" to prohibit \"transactions involvin[g] any property in which any foreign country or a national thereof has any interest,\" among other things); Trade Expansion Act of 1962, <extracted-citation index=\"221\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%201862\"><span class=\"citation no-link\">19 U.S.C. § 1862</span></extracted-citation>(c)(3)(A) (authorizing \"actions as the President deems necessary to adjust the imports of \" certain articles of trade \"so that such imports will not threaten to impair the national security\"); Trade Act of 1974, <extracted-citation index=\"222\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%202132\"><span class=\"citation no-link\">19 U.S.C. § 2132</span></extracted-citation>(a) (authorizing the President, among other things, to impose temporary duty surcharges or quotas in order to address \"large and serious United States balance-of-payments deficits,\" \"an imminent and significant depreciation of the dollar in foreign exchange markets,\" or \"to cooperate with other countries in correcting an international balance-of-payments disequilibrium\"), § 2133(a) (authorizing the President, whenever a specified event \"increases or imposes any duty or other import restriction,\" to \"enter into trade agreements with foreign countries or instrumentalities for the purpose of granting new concessions as compensation in order to maintain the general level of reciprocal and mutually advantageous concessions\" and to take actions \"to carry out any such agreement\"), § 2411(a) (mandating the U. S. Trade Representative, subject to the President's direction, to modify tariff rates if \"the rights of the United States under any trade agreement are being denied\" or if a foreign country's actions are \"unjustifiable and burde[n] or restric[t] United States commerce\"), § 2461 (authorizing the President to \"provide duty-free treatment for any eligible article from any beneficiary developing country\"); Bipartisan Congressional Trade Priorities and Accountability Act of 2015, <extracted-citation index=\"223\" url=\"https://cite.case.law/citations/?q=19%20U.S.C.%20%C2%A7%C2%A7%204201\"><span class=\"citation no-link\">19 U.S.C. §§ 4201</span></extracted-citation> -4210 (most recent delegation of trade-promotion authority, authorizing the President to negotiate and enter trade agreements); Immigration and Nationality Act of 1952, <extracted-citation index=\"224\" url=\"https://cite.case.law/citations/?q=8%20U.S.C.%20%C2%A7%201182\"><span class=\"citation no-link\">8 U.S.C. § 1182</span></extracted-citation>(f) (authorizing the President, \"for such period as he shall deem necessary,\" to \"suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate,\" \"[w]henever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States\").</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-205\">See Letter from G. Bush to Congressional Leaders on Temporary Transfer of the Powers and Duties of President of the United States (June 29, 2002), www.presidency.ucsb.edu/node/213575; Letter from G. Bush to Congressional Leaders on the Temporary Transfer of the Powers and Duties of the President of the United States (July 21, 2007), www.presidency.ucsb.edu/node/276172; see also Stolberg, For a Short While Today, It Will Be President Cheney, N. Y. Times, July 21, 2007, p. A11, col. 1.</p>\n</footnote>\n</opinion>", "extracted_by_ocr": false, "ordering_key": 2, "main_version": null, "opinions_cited": ["https://www.courtlistener.com/api/rest/v4/opinions/4396209/", "https://www.courtlistener.com/api/rest/v4/opinions/4544798/", "https://www.courtlistener.com/api/rest/v4/opinions/8638362/", "https://www.courtlistener.com/api/rest/v4/opinions/9418565/", "https://www.courtlistener.com/api/rest/v4/opinions/9418915/", "https://www.courtlistener.com/api/rest/v4/opinions/9419200/", "https://www.courtlistener.com/api/rest/v4/opinions/9420099/", "https://www.courtlistener.com/api/rest/v4/opinions/9428506/", "https://www.courtlistener.com/api/rest/v4/opinions/9428860/", "https://www.courtlistener.com/api/rest/v4/opinions/9433464/", "https://www.courtlistener.com/api/rest/v4/opinions/9434497/", "https://www.courtlistener.com/api/rest/v4/opinions/9808243/", "https://www.courtlistener.com/api/rest/v4/opinions/9842193/"]}