{"resource_uri": "https://www.courtlistener.com/api/rest/v4/opinions/9889199/", "id": 9889199, "absolute_url": "/opinion/4766664/trump-v-vance/", "cluster_id": 4766664, "cluster": "https://www.courtlistener.com/api/rest/v4/clusters/4766664/", "author_id": null, "author": null, "joined_by": [], "date_created": "2023-10-06T13:26:57.287521-07:00", "date_modified": "2025-06-04T10:25:26.384394-07:00", "author_str": "Roberts", "per_curiam": false, "joined_by_str": "", "type": "020lead", "sha1": "", "page_count": null, "download_url": null, "local_path": null, "plain_text": "", "html": "", "html_lawbox": "", "html_columbia": "", "html_anon_2020": "", "xml_harvard": "<opinion type=\"majority\">\n<author id=\"p-10\">Chief Justice ROBERTS delivered the opinion of the Court.</author>\n<p id=\"p-11\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2420\" href=\"#p2420\" id=\"p2420\">*2420</a>In our judicial system, \"the public has a right to every man's evidence.\"<footnotemark>1</footnotemark> Since the earliest days of the Republic, \"every man\" has included the President of the United States. Beginning with Jefferson and carrying on through Clinton, Presidents have uniformly testified or produced documents in criminal proceedings when called upon by federal courts. This case involves-so far as we and the parties can tell-the first <em>state</em> criminal subpoena directed to a President. The President contends that the subpoena is unenforceable. We granted certiorari to decide whether Article II and the Supremacy Clause categorically preclude, or require a heightened standard for, the issuance of a state criminal subpoena to a sitting President.</p>\n<p id=\"p-12\">I</p>\n<p id=\"p-13\">In the summer of 2018, the New York County District Attorney's Office opened an investigation into what it opaquely describes as \"business transactions involving multiple individuals whose conduct may have violated state law.\" Brief for Respondent Vance 2. A year later, the office-acting on behalf of a grand jury-served a subpoena <em>duces tecum</em> (essentially a request to produce evidence) on Mazars USA, LLP, the personal accounting firm of President Donald J. Trump. The subpoena directed Mazars to produce financial records relating to the President and business organizations affiliated with him, including \"[t]ax returns and related schedules,\" from \"2011 to the present.\" App. to Pet. for Cert. 119a.<footnotemark>2</footnotemark></p>\n<p id=\"p-14\">The President, acting in his personal capacity, sued the district attorney and Mazars in Federal District Court to enjoin enforcement of the subpoena. He argued that, under Article II and the Supremacy Clause, a sitting President enjoys absolute immunity from state criminal process. He asked the court to issue a \"declaratory judgment that the subpoena is invalid and unenforceable while the President is in office\" and to permanently enjoin the district attorney \"from taking any action to enforce the subpoena.\" Amended Complaint in No. 1:19-cv-8694 (SDNY, Sept. 25, 2019), p. 19. Mazars, concluding that the dispute was between the President and the district attorney, took no position on the legal issues raised by the President.</p>\n<p id=\"p-15\">The District Court abstained from exercising jurisdiction and dismissed the case based on <em>Younger v. Harris</em> , <extracted-citation case-ids=\"11711728\" index=\"0\" url=\"https://cite.case.law/us/401/37/\">401 U. S. 37</extracted-citation>, <extracted-citation case-ids=\"11711728\" index=\"1\" url=\"https://cite.case.law/us/401/37/\">91 S.Ct. 746</extracted-citation>, <extracted-citation case-ids=\"11711728\" index=\"2\" url=\"https://cite.case.law/us/401/37/\">27 L.Ed.2d 669</extracted-citation> (1971), which generally precludes federal courts from intervening in ongoing state criminal <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2421\" href=\"#p2421\" id=\"p2421\">*2421</a>prosecutions. <extracted-citation index=\"3\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\">395 F.Supp.3d 283</extracted-citation>, 290 (SDNY 2019). In an alternative holding, the court ruled that the President was not entitled to injunctive relief. <em><extracted-citation index=\"4\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\">Ibid.</extracted-citation></em></p>\n<p id=\"p-16\">The Second Circuit met the District Court halfway. As to the dismissal, the Court of Appeals held that <em>Younger</em> abstention was inappropriate because that doctrine's core justification-\"preventing friction\" between States and the Federal Government-is diminished when state and federal actors are already in conflict, as the district attorney and the President were. <extracted-citation index=\"5\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\">941 F.3d 631</extracted-citation>, 637, 639 (2019).</p>\n<p id=\"p-17\">On the merits, the Court of Appeals agreed with the District Court's denial of a preliminary injunction. Drawing on the 200-year history of Presidents being subject to federal judicial process, the Court of Appeals concluded that \"presidential immunity does not bar the enforcement of a state grand jury subpoena directing a third party to produce non-privileged material, even when the subject matter under investigation pertains to the President.\" <em><extracted-citation index=\"6\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\">Id.</extracted-citation></em> , at 640. It also rejected the argument raised by the United States as <em>amicus curiae</em> that a state grand jury subpoena must satisfy a heightened showing of need. The court reasoned that the proposed test, derived from cases addressing privileged Executive Branch communications, \"ha[d] little bearing on a subpoena\" seeking \"information relating solely to the President in his private capacity and disconnected from the discharge of his constitutional obligations.\" <em><extracted-citation index=\"7\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\">Id.,</extracted-citation></em><extracted-citation index=\"7\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\"> at 645-646</extracted-citation>.</p>\n<p id=\"p-18\">We granted certiorari. 589 U. S. ----, <extracted-citation case-ids=\"12629966,12629967,12629968,12629969,12629970\" index=\"8\" url=\"https://cite.case.law/s-ct/140/659/\">140 S.Ct. 659</extracted-citation>, <extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"9\" url=\"https://cite.case.law/l-ed-2d/205/418/\">205 L.Ed.2d 418</extracted-citation> (2019).</p>\n<p id=\"p-19\">II</p>\n<p id=\"p-20\">In the summer of 1807, all eyes were on Richmond, Virginia. Aaron Burr, the former Vice President, was on trial for treason.<footnotemark>3</footnotemark> Fallen from political grace after his fatal duel with Alexander Hamilton, and with a murder charge pending in New Jersey, Burr followed the path of many down-and-out Americans of his day-he headed West in search of new opportunity. But Burr was a man with outsized ambitions. Together with General James Wilkinson, the Governor of the Louisiana Territory, he hatched a plan to establish a new territory in Mexico, then controlled by Spain.<footnotemark>4</footnotemark> Both men anticipated that war between the United States and Spain was imminent, and when it broke out they intended to invade Spanish territory at the head of a private army.</p>\n<p id=\"p-21\">But while Burr was rallying allies to his cause, tensions with Spain eased and rumors began to swirl that Burr was conspiring to detach States by the Allegheny Mountains from the Union. Wary of being exposed as the principal co-conspirator, Wilkinson took steps to ensure that any blame would fall on Burr. He sent a series of letters to President Jefferson accusing Burr of plotting to attack New Orleans and revolutionize the Louisiana Territory.</p>\n<p id=\"p-22\">Jefferson, who despised his former running mate Burr for trying to steal the 1800 presidential election from him, was predisposed to credit Wilkinson's version of events. The President sent a special message to Congress identifying Burr as the <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2422\" href=\"#p2422\" id=\"p2422\">*2422</a>\"prime mover\" in a plot \"against the peace and safety of the Union.\" 16 Annals of Cong. 39-40 (1807). According to Jefferson, Burr contemplated either the \"severance of the Union\" or an attack on Spanish territory. <em><extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"10\" url=\"https://cite.case.law/l-ed-2d/205/418/\">Id.</extracted-citation></em> , at 41. Jefferson acknowledged that his sources contained a \"mixture of rumors, conjectures, and suspicions\" but, citing Wilkinson's letters, he assured Congress that Burr's guilt was \"beyond question.\" <em><extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"11\" url=\"https://cite.case.law/l-ed-2d/205/418/\">Id.</extracted-citation></em> , at 39-40.</p>\n<p id=\"p-23\">The trial that followed was \"the greatest spectacle in the short history of the republic,\" complete with a Founder-studded cast. N. Isenberg, Fallen Founder: The Life of Aaron Burr 351 (2007). People flocked to Richmond to watch, massing in tents and covered wagons along the banks of the James River, nearly doubling the town's population of 5,000. Burr's defense team included Edmund Randolph and Luther Martin, both former delegates at the Constitutional Convention and renowned advocates. Chief Justice John Marshall, who had recently squared off with the Jefferson administration in <em>Marbury v. Madison</em> , <extracted-citation case-ids=\"6760011,6759998,12121622\" index=\"12\" url=\"https://cite.case.law/cranch/1/137/\">1 Cranch 137</extracted-citation>, <extracted-citation case-ids=\"12121622\" index=\"13\" url=\"https://cite.case.law/us/5/137/\">2 L.Ed. 60</extracted-citation> (1803), presided as Circuit Justice for Virginia. Meanwhile Jefferson, intent on conviction, orchestrated the prosecution from afar, dedicating Cabinet meetings to the case, peppering the prosecutors with directions, and spending nearly $100,000 from the Treasury on the five-month proceedings.</p>\n<p id=\"p-24\">In the lead-up to trial, Burr, taking aim at his accusers, moved for a subpoena <em>duces tecum</em> directed at Jefferson. The draft subpoena required the President to produce an October 21, 1806 letter from Wilkinson and accompanying documents, which Jefferson had referenced in his message to Congress. The prosecution opposed the request, arguing that a President could not be subjected to such a subpoena and that the letter might contain state secrets. Following four days of argument, Marshall announced his ruling to a packed chamber.</p>\n<p id=\"p-25\">The President, Marshall declared, does not \"stand exempt from the general provisions of the constitution\" or, in particular, the Sixth Amendment's guarantee that those accused have compulsory process for obtaining witnesses for their defense. <em>United States v. Burr</em> , <extracted-citation case-ids=\"6579548\" index=\"14\" url=\"https://cite.case.law/f-cas/25/30/#p33\">25 F.Cas. 30</extracted-citation>, 33-34 (No. 14,692d) (CC Va. 1807). At common law the \"single reservation\" to the duty to testify in response to a subpoena was \"the case of the king,\" whose \"dignity\" was seen as \"incompatible\" with appearing \"under the process of the court.\" <em><extracted-citation case-ids=\"6579548\" index=\"15\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Id.</extracted-citation></em> , at 34. But, as Marshall explained, a king is born to power and can \"do no wrong.\" <em><extracted-citation case-ids=\"6579548\" index=\"16\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em> The President, by contrast, is \"of the people\" and subject to the law. <em><extracted-citation case-ids=\"6579548\" index=\"17\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em> According to Marshall, the sole argument for exempting the President from testimonial obligations was that his \"duties as chief magistrate demand his whole time for national objects.\" <em><extracted-citation case-ids=\"6579548\" index=\"18\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em> But, in Marshall's assessment, those demands were \"not unremitting.\" <em><extracted-citation case-ids=\"6579548\" index=\"19\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em> And should the President's duties preclude his attendance at a particular time and place, a court could work that out upon return of the subpoena. <em><extracted-citation case-ids=\"6579548\" index=\"20\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em></p>\n<p id=\"p-26\">Marshall also rejected the prosecution's argument that the President was immune from a subpoena <em>duces tecum</em> because executive papers might contain state secrets. \"A subpoena duces tecum,\" he said, \"may issue to any person to whom an ordinary subpoena may issue.\" <em><extracted-citation case-ids=\"6579548\" index=\"21\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Ibid.</extracted-citation></em> As he explained, no \"fair construction\" of the Constitution supported the conclusion that the right \"to compel the attendance of witnesses[ ] does not extend\" to requiring those witnesses to \"bring[ ] with them such papers as may be material in the defence.\" <em><extracted-citation case-ids=\"6579548\" index=\"22\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Id.</extracted-citation></em> , at 35. And, as a matter of basic fairness, permitting such information to be withheld would \"tarnish the reputation of the court.\" <em><extracted-citation case-ids=\"6579548\" index=\"23\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Id.</extracted-citation></em> , at 37. As for \"the propriety <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2423\" href=\"#p2423\" id=\"p2423\">*2423</a>of introducing any papers,\" that would \"depend on the character of the paper, not on the character of the person who holds it.\" <em><extracted-citation case-ids=\"6579548\" index=\"24\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Id.</extracted-citation></em> , at 34. Marshall acknowledged that the papers sought by Burr could contain information \"the disclosure of which would endanger the public safety,\" but stated that, again, such concerns would have \"due consideration\" upon the return of the subpoena. <em><extracted-citation case-ids=\"6579548\" index=\"25\" url=\"https://cite.case.law/f-cas/25/30/#p33\">Id.</extracted-citation></em> , at 37.</p>\n<p id=\"p-27\">While the arguments unfolded, Jefferson, who had received word of the motion, wrote to the prosecutor indicating that he would-subject to the prerogative to decide which executive communications should be withheld-\"furnish on all occasions, whatever the purposes of justice may require.\" Letter from T. Jefferson to G. Hay (June 12, 1807), in 10 Works of Thomas Jefferson 398, n. (P. Ford ed. 1905). His \"personal attendance,\" however, was out of the question, for it \"would leave the nation without\" the \"sole branch which the constitution requires to be always in function.\" Letter from T. Jefferson to G. Hay (June 17, 1807), in <em><extracted-citation case-ids=\"6579548\" index=\"26\" url=\"https://cite.case.law/f-cas/25/30/#p33\">id.</extracted-citation></em> , at 400-401, n.</p>\n<p id=\"p-28\">Before Burr received the subpoenaed documents, Marshall rejected the prosecution's core legal theory for treason and Burr was accordingly acquitted. Jefferson, however, was not done. Committed to salvaging a conviction, he directed the prosecutors to proceed with a misdemeanor (yes, misdemeanor) charge for inciting war against Spain. Burr then renewed his request for Wilkinson's October 21 letter, which he later received a copy of, and subpoenaed a second letter, dated November 12, 1806, which the prosecutor claimed was privileged. Acknowledging that the President may withhold information to protect public safety, Marshall instructed that Jefferson should \"state the particular reasons\" for withholding the letter. <em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"27\" url=\"https://cite.case.law/f-cas/25/187/#p192\">25 F.Cas. 187</extracted-citation>, 192, (No. 14694) (CC Va. 1807). The court, paying \"all proper respect\" to those reasons, would then decide whether to compel disclosure. <em><extracted-citation case-ids=\"6580056\" index=\"28\" url=\"https://cite.case.law/f-cas/25/187/#p192\">Ibid.</extracted-citation></em> But that decision was averted when the misdemeanor trial was cut short after it became clear that the prosecution lacked the evidence to convict.</p>\n<p id=\"p-29\">In the two centuries since the Burr trial, successive Presidents have accepted Marshall's ruling that the Chief Executive is subject to subpoena. In 1818, President Monroe received a subpoena to testify in a court-martial against one of his appointees. See Rotunda, Presidents and Ex-Presidents as Witnesses: A Brief Historical Footnote, 1975 U. Ill. L. Forum 1, 5. His Attorney General, William Wirt-who had served as a prosecutor during Burr's trial-advised Monroe that, per Marshall's ruling, a subpoena to testify may \"be properly awarded to the President.\" <em><extracted-citation case-ids=\"6580056\" index=\"29\" url=\"https://cite.case.law/f-cas/25/187/#p192\">Id.</extracted-citation></em> , at 5-6. Monroe offered to sit for a deposition and ultimately submitted answers to written interrogatories.</p>\n<p id=\"p-30\">Following Monroe's lead, his successors have uniformly agreed to testify when called in criminal proceedings, provided they could do so at a time and place of their choosing. In 1875, President Grant submitted to a three-hour deposition in the criminal prosecution of a political appointee embroiled in a network of tax-evading whiskey distillers. See 1 R. Rotunda &amp; J. Nowak, Constitutional Law § 7.1(b)(ii), p. 996 (5th ed. 2012) (Rotunda &amp; Nowak). A century later, President Ford's attempted assassin subpoenaed him to testify in her defense. See <em>United States v. Fromme</em> , <extracted-citation case-ids=\"3839654\" index=\"30\" url=\"https://cite.case.law/f-supp/405/578/\">405 F.Supp. 578</extracted-citation> (ED Cal. 1975). Ford obliged-from a safe distance-in the first videotaped deposition of a President. President Carter testified via the same means in the trial of two local officials who, while Carter was Governor of Georgia, had offered to contribute to his campaign in exchange for advance warning of any state gambling raids. See Carter's Testimony, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2424\" href=\"#p2424\" id=\"p2424\">*2424</a>on Videotape, Is Given to Georgia Gambling Trial, N. Y. Times, Apr. 20, 1978, p. A20 (Carter recounted that he \"rejected the proposition instantly.\"). Two years later, Carter gave videotaped testimony to a federal grand jury investigating whether a fugitive financier had entreated the White House to quash his extradition proceedings. See Rotunda &amp; Nowak § 7.1(b)(vi), at 997. President Clinton testified three times, twice via deposition pursuant to subpoenas in federal criminal trials of associates implicated during the Whitewater investigation, and once by video for a grand jury investigating possible perjury. See <em><extracted-citation case-ids=\"3839654\" index=\"31\" url=\"https://cite.case.law/f-supp/405/578/\">id.</extracted-citation></em> , § 7.1(c)(viii), at 1007-1008.</p>\n<p id=\"p-31\">The bookend to Marshall's ruling came in 1974 when the question he never had to decide-whether to compel the disclosure of official communications over the objection of the President-came to a head. That spring, the Special Prosecutor appointed to investigate the break-in of the Democratic National Committee Headquarters at the Watergate complex filed an indictment charging seven defendants associated with President Nixon and naming Nixon as an unindicted co-conspirator. As the case moved toward trial, the Special Prosecutor secured a subpoena <em>duces tecum</em> directing Nixon to produce, among other things, tape recordings of Oval Office meetings. Nixon moved to quash the subpoena, claiming that the Constitution provides an absolute privilege of confidentiality to all presidential communications. This Court rejected that argument in <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"32\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"33\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"34\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974), a decision we later described as \"unequivocally and emphatically endors[ing] Marshall's\" holding that Presidents are subject to subpoena. <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"35\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. 681</extracted-citation>, 704, <extracted-citation case-ids=\"11652833\" index=\"36\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"37\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997).</p>\n<p id=\"p-32\">The <em>Nixon</em> Court readily acknowledged the importance of preserving the confidentiality of communications \"between high Government officials and those who advise and assist them.\" <extracted-citation case-ids=\"6174416\" index=\"38\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 705</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"39\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>. \"Human experience,\" the Court explained, \"teaches that those who expect public dissemination of their remarks may well temper candor with a concern for appearances and for their own interests to the detriment of the decisionmaking process.\" <em><extracted-citation case-ids=\"6174416\" index=\"40\" url=\"https://cite.case.law/us/418/683/\">Ibid.</extracted-citation></em> Confidentiality thus promoted the \"public interest in candid, objective, and even blunt or harsh opinions in Presidential decisionmaking.\" <em><extracted-citation case-ids=\"6174416\" index=\"41\" url=\"https://cite.case.law/us/418/683/\">Id.</extracted-citation></em> , at 708, <extracted-citation case-ids=\"6174416\" index=\"42\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>.</p>\n<p id=\"p-33\">But, like Marshall two centuries prior, the Court recognized the countervailing interests at stake. Invoking the common law maxim that \"the public has a right to every man's evidence,\" the Court observed that the public interest in fair and accurate judicial proceedings is at its height in the criminal setting, where our common commitment to justice demands that \"guilt shall not escape\" nor \"innocence suffer.\" <em><extracted-citation case-ids=\"6174416\" index=\"43\" url=\"https://cite.case.law/us/418/683/\">Id.</extracted-citation></em> , at 709, <extracted-citation case-ids=\"6174416\" index=\"44\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> (internal quotation marks and alteration omitted). Because these dual aims would be \"defeated if judgments\" were \"founded on a partial or speculative presentation of the facts,\" the <em>Nixon</em> Court recognized that it was \"imperative\" that \"compulsory process be available for the production of evidence needed either by the prosecution or the defense.\" <em><extracted-citation case-ids=\"6174416\" index=\"45\" url=\"https://cite.case.law/us/418/683/\">Ibid.</extracted-citation></em></p>\n<p id=\"p-34\">The Court thus concluded that the President's \"generalized assertion of privilege must yield to the demonstrated, specific need for evidence in a pending criminal trial.\" <em><extracted-citation case-ids=\"6174416\" index=\"46\" url=\"https://cite.case.law/us/418/683/\">Id.</extracted-citation></em> , at 713, <extracted-citation case-ids=\"6174416\" index=\"47\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>. Two weeks later, President Nixon dutifully released the tapes.</p>\n<p id=\"p-35\">III</p>\n<p id=\"p-36\">The history surveyed above all involved <em>federal</em> criminal proceedings. Here we are confronted for the first time with a subpoena <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2425\" href=\"#p2425\" id=\"p2425\">*2425</a>issued to the President by a local grand jury operating under the supervision of a <em>state</em> court.<footnotemark>5</footnotemark></p>\n<p id=\"p-37\">In the President's view, that distinction makes all the difference. He argues that the Supremacy Clause gives a sitting President absolute immunity from state criminal subpoenas because compliance with those subpoenas would categorically impair a President's performance of his Article II functions. The Solicitor General, arguing on behalf of the United States, agrees with much of the President's reasoning but does not commit to his bottom line. Instead, the Solicitor General urges us to resolve this case by holding that a state grand jury subpoena for a sitting President's personal records must, at the very least, \"satisfy a heightened standard of need,\" which the Solicitor General contends was not met here. Brief for United States as <em>Amicus Curiae</em> 26, 29.</p>\n<p id=\"p-38\">A</p>\n<p id=\"p-39\">We begin with the question of absolute immunity. No one doubts that Article II guarantees the independence of the Executive Branch. As the head of that branch, the President \"occupies a unique position in the constitutional scheme.\" <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"48\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, 749, <extracted-citation case-ids=\"6194478\" index=\"49\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"50\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982). His duties, which range from faithfully executing the laws to commanding the Armed Forces, are of unrivaled gravity and breadth. Quite appropriately, those duties come with protections that safeguard the President's ability to perform his vital functions. See, <em>e.g.</em> , <em><extracted-citation case-ids=\"6194478\" index=\"51\" url=\"https://cite.case.law/us/457/731/#p749\">ibid.</extracted-citation></em> (concluding that the President enjoys \"absolute immunity from damages liability predicated on his official acts\"); <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"52\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 708</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"53\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> (recognizing that presidential communications are presumptively privileged).</p>\n<p id=\"p-40\">In addition, the Constitution guarantees \"the entire independence of the General Government from any control by the respective States.\" <em>Farmers and Mechanics Sav. Bank of Minneapolis v. Minnesota</em> , <extracted-citation case-ids=\"3672318\" index=\"54\" url=\"https://cite.case.law/us/232/516/#p521\">232 U.S. 516</extracted-citation>, 521, <extracted-citation case-ids=\"3672318\" index=\"55\" url=\"https://cite.case.law/us/232/516/#p521\">34 S.Ct. 354</extracted-citation>, <extracted-citation case-ids=\"3672318\" index=\"56\" url=\"https://cite.case.law/us/232/516/#p521\">58 L.Ed. 706</extracted-citation> (1914). As we have often repeated, \"States have no power ... to retard, impede, burden, or in any manner control the operations of the constitutional laws enacted by Congress.\" <em>McCulloch v. Maryland</em> , <extracted-citation case-ids=\"4702\" index=\"57\" url=\"https://cite.case.law/us/17/316/#p436\">4 Wheat. 316</extracted-citation>, 436, <extracted-citation case-ids=\"4702\" index=\"58\" url=\"https://cite.case.law/us/17/316/#p436\">4 L.Ed. 579</extracted-citation> (1819). It follows that States also lack the power to impede the President's execution of those laws.</p>\n<p id=\"p-41\">Marshall's ruling in <em>Burr</em> , entrenched by 200 years of practice and our decision in <em>Nixon</em> , confirms that <em>federal</em> criminal subpoenas do not \"rise to the level of constitutionally forbidden impairment of the Executive's ability to perform its constitutionally mandated functions.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"59\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 702-703</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"60\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. But the President, joined in part by the Solicitor General, argues that <em>state</em> criminal subpoenas pose a unique threat of impairment and thus demand greater protection. To be clear, the President does not contend here that <em>this</em> subpoena, in particular, is impermissibly burdensome. Instead he makes a <em>categorical</em> argument about the burdens generally associated with state criminal subpoenas, focusing on three: diversion, stigma, and harassment. We address each in turn.</p>\n<p id=\"p-42\">1</p>\n<p id=\"p-43\">The President's primary contention, which the Solicitor General supports, is that complying with state criminal subpoenas <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2426\" href=\"#p2426\" id=\"p2426\">*2426</a>would necessarily divert the Chief Executive from his duties. He grounds that concern in <em>Nixon</em> v. <em>Fitzgerald</em> , which recognized a President's \"absolute immunity from damages liability predicated on his official acts.\" <extracted-citation case-ids=\"6194478\" index=\"61\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. at 749</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"62\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>. In explaining the basis for that immunity, this Court observed that the prospect of such liability could \"distract a President from his public duties, to the detriment of not only the President and his office but also the Nation that the Presidency was designed to serve.\" <em><extracted-citation case-ids=\"6194478\" index=\"63\" url=\"https://cite.case.law/us/457/731/#p749\">Id.</extracted-citation></em> , at 753, <extracted-citation case-ids=\"6194478\" index=\"64\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>. The President contends that the diversion occasioned by a state criminal subpoena imposes an equally intolerable burden on a President's ability to perform his Article II functions.</p>\n<p id=\"p-44\">But <em>Fitzgerald</em> did not hold that distraction was sufficient to confer absolute immunity. We instead drew a careful analogy to the common law absolute immunity of judges and prosecutors, concluding that a President, like those officials, must \"deal fearlessly and impartially with the duties of his office\"-not be made \"unduly cautious in the discharge of [those] duties\" by the prospect of civil liability for official acts. <em><extracted-citation case-ids=\"6194478\" index=\"65\" url=\"https://cite.case.law/us/457/731/#p749\">Id.</extracted-citation></em> , at 751-752, and n. 32, <extracted-citation case-ids=\"6194478\" index=\"66\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation> (internal quotation marks omitted). Indeed, we expressly rejected immunity based on distraction alone 15 years later in <em>Clinton</em> v. <em>Jones</em> . There, President Clinton argued that the risk of being \"distracted by the need to participate in litigation\" entitled a sitting President to absolute immunity from civil liability, not just for official acts, as in <em>Fitzgerald</em> , but for private conduct as well. <extracted-citation case-ids=\"11652833\" index=\"67\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 694, n. 19</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"68\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. We disagreed with that rationale, explaining that the \"dominant concern\" in <em>Fitzgerald</em> was not mere distraction but the distortion of the Executive's \"decisionmaking process\" with respect to official acts that would stem from \"worry as to the possibility of damages.\" <extracted-citation case-ids=\"11652833\" index=\"69\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 694, n. 19</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"70\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. The Court recognized that Presidents constantly face myriad demands on their attention, \"some private, some political, and some as a result of official duty.\" <em>Id</em> ., at 705, n. 40, <extracted-citation case-ids=\"11652833\" index=\"71\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. But, the Court concluded, \"[w]hile such distractions may be vexing to those subjected to them, they do not ordinarily implicate constitutional ... concerns.\" <em><extracted-citation case-ids=\"11652833\" index=\"72\" url=\"https://cite.case.law/us/520/681/#p704\">Ibid.</extracted-citation></em></p>\n<p id=\"p-45\">The same is true of criminal subpoenas. Just as a \"properly managed\" civil suit is generally \"unlikely to occupy any substantial amount of \" a President's time or attention, <em><extracted-citation case-ids=\"11652833\" index=\"73\" url=\"https://cite.case.law/us/520/681/#p704\">id.,</extracted-citation></em><extracted-citation case-ids=\"11652833\" index=\"73\" url=\"https://cite.case.law/us/520/681/#p704\"> at 702</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"74\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, two centuries of experience confirm that a properly tailored criminal subpoena will not normally hamper the performance of the President's constitutional duties. If anything, we expect that in the mine run of cases, where a President is subpoenaed during a proceeding targeting someone else, as Jefferson was, the burden on a President will ordinarily be lighter than the burden of defending against a civil suit.</p>\n<p id=\"p-46\">The President, however, believes the district attorney is investigating him and his businesses. In such a situation, he contends, the \"toll that criminal process ... exacts from the President is even heavier\" than the distraction at issue in <em>Fitzgerald</em> and <em>Clinton</em> , because \"criminal litigation\" poses unique burdens on the President's time and will generate a \"considerable if not overwhelming degree of mental preoccupation.\" Brief for Petitioner 16-18, 30 (internal quotation marks omitted).</p>\n<p id=\"p-47\">But the President is not seeking immunity from the diversion occasioned by the prospect of future criminal <em>liability</em> . Instead he concedes-consistent with the position of the Department of Justice-that state grand juries are free to investigate a sitting President with an eye toward charging him after the completion of <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2427\" href=\"#p2427\" id=\"p2427\">*2427</a>his term. See Reply Brief 19 (citing Memorandum from Randolph D. Moss, Assistant Atty. Gen., Office of Legal Counsel, to the Atty. Gen.: A Sitting President's Amenability to Indictment and Criminal Prosecution, <extracted-citation index=\"75\" url=\"https://cite.case.law/citations/?q=24%20Op.%20O.L.C.%20222\">24 Op. OLC 222</extracted-citation>, 257, n. 36 (Oct. 16, 2000)). The President's objection therefore must be limited to the <em>additional</em> distraction caused by the subpoena itself. But that argument runs up against the 200 years of precedent establishing that Presidents, and their official communications, are subject to judicial process, see <em>Burr</em> , 25 F.Cas. at 34, even when the President is under investigation, see <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"76\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 706</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"77\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>.</p>\n<p id=\"p-48\">2</p>\n<p id=\"p-49\">The President next claims that the stigma of being subpoenaed will undermine his leadership at home and abroad. Notably, the Solicitor General does not endorse this argument, perhaps because we have twice denied absolute immunity claims by Presidents in cases involving allegations of serious misconduct. See <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"78\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 685</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"79\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation> ; <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"80\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 687</extracted-citation>,<extracted-citation case-ids=\"6174416\" index=\"81\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>. But even if a tarnished reputation were a cognizable impairment, there is nothing inherently stigmatizing about a President performing \"the citizen's normal duty of ... furnishing information relevant\" to a criminal investigation. <em>Branzburg v. Hayes</em> , <extracted-citation case-ids=\"1782792\" index=\"82\" url=\"https://cite.case.law/us/408/665/#p691\">408 U.S. 665</extracted-citation>, 691, <extracted-citation case-ids=\"1782792\" index=\"83\" url=\"https://cite.case.law/us/408/665/#p691\">92 S.Ct. 2646</extracted-citation>, <extracted-citation case-ids=\"1782792\" index=\"84\" url=\"https://cite.case.law/us/408/665/#p691\">33 L.Ed.2d 626</extracted-citation> (1972). Nor can we accept that the risk of association with persons or activities under criminal investigation can absolve a President of such an important public duty. Prior Presidents have weathered these associations in federal cases, <em>supra</em> , at 2422 - 2425, and there is no reason to think any attendant notoriety is necessarily greater in state court proceedings.</p>\n<p id=\"p-50\">To be sure, the consequences for a President's public standing will likely increase if he is the one under investigation. But, again, the President concedes that such investigations are permitted under Article II and the Supremacy Clause, and receipt of a subpoena would not seem to categorically magnify the harm to the President's reputation.</p>\n<p id=\"p-51\">Additionally, while the current suit has cast the Mazars subpoena into the spotlight, longstanding rules of grand jury secrecy aim to prevent the very stigma the President anticipates. See S. Beale et al., Grand Jury Law and Practice § 5:1, p. 5-3 (2d ed. 2018) (\"[T]he federal system and most states have adopted statutes or court rules\" that \"impose sharp restrictions on the extent to which matters occurring before a grand jury may be divulged\" to outside persons.). Of course, disclosure restrictions are not perfect. See <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"85\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 687, n. 4</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"86\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> (observing that news media reporting made the protective order shielding the fact that the President had been named as an unindicted co-conspirator \"no longer meaningful\"). But those who make unauthorized disclosures regarding a grand jury subpoena do so at their peril. See, <em>e.g.</em> , N. Y. Penal Law Ann. § 215.70 (West 2010) (designating unlawful grand jury disclosure as a felony).</p>\n<p id=\"p-52\">3</p>\n<p id=\"p-53\">Finally, the President and the Solicitor General warn that subjecting Presidents to state criminal subpoenas will make them \"easily identifiable target[s]\" for harassment. <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"87\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. at 753</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"88\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>. But we rejected a nearly identical argument in <em>Clinton</em> , where then-President Clinton argued that permitting civil liability for unofficial acts would \"generate a large volume of politically motivated harassing and frivolous litigation.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"89\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 708</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"90\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. The President and the Solicitor General nevertheless argue that state criminal subpoenas <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2428\" href=\"#p2428\" id=\"p2428\">*2428</a>pose a heightened risk and could undermine the President's ability to \"deal fearlessly and impartially\" with the States. <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"91\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. at 752</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"92\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation> (internal quotation marks omitted). They caution that, while federal prosecutors are accountable to and removable by the President, the 2,300 district attorneys in this country are responsive to local constituencies, local interests, and local prejudices, and might \"use criminal process to register their dissatisfaction with\" the President. Brief for Petitioner 16. What is more, we are told, the state courts supervising local grand juries may not exhibit the same respect that federal courts show to the President as a coordinate branch of Government.</p>\n<p id=\"p-54\">We recognize, as does the district attorney, that harassing subpoenas could, under certain circumstances, threaten the independence or effectiveness of the Executive. See Tr. of Oral Arg. 73. Even so, in <em>Clinton</em> we found that the risk of harassment was not \"serious\" because federal courts have the tools to deter and, where necessary, dismiss vexatious civil suits. <extracted-citation case-ids=\"11652833\" index=\"93\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 708</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"94\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. And, while we cannot ignore the possibility that state prosecutors may have political motivations, see <em>post,</em> at 2447 - 2448 (ALITO, J., dissenting), here again the law already seeks to protect against the predicted abuse.</p>\n<p id=\"p-55\">First, grand juries are prohibited from engaging in \"arbitrary fishing expeditions\" and initiating investigations \"out of malice or an intent to harass.\" <em>United States v. R. Enterprises, Inc.</em> , <extracted-citation case-ids=\"6224097\" index=\"95\" url=\"https://cite.case.law/us/498/292/#p299\">498 U.S. 292</extracted-citation>, 299, <extracted-citation case-ids=\"6224097\" index=\"96\" url=\"https://cite.case.law/us/498/292/#p299\">111 S.Ct. 722</extracted-citation>, <extracted-citation case-ids=\"6224097\" index=\"97\" url=\"https://cite.case.law/us/498/292/#p299\">112 L.Ed.2d 795</extracted-citation> (1991). See also, <em>e.g.</em> , <em>Virag v. Hynes</em> , <extracted-citation case-ids=\"2341761\" index=\"98\" url=\"https://cite.case.law/ny2d/54/437/#p442\">54 N.Y.2d 437</extracted-citation>, 442-443, <extracted-citation index=\"99\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\">446 N.Y.S.2d 196</extracted-citation>, <extracted-citation index=\"100\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\">430 N.E.2d 1249</extracted-citation>, 1252 (1981) (recognizing that grand jury subpoenas can be \"challenged by an affirmative showing of impropriety,\" including \"bad faith\" (internal quotation marks omitted)). These protections, as the district attorney himself puts it, \"apply with special force to a President, in light of the office's unique position as the head of the Executive Branch.\" Brief for Respondent Vance 43. And, in the event of such harassment, a President would be entitled to the protection of federal courts. The policy against federal interference in state criminal proceedings, while strong, allows \"intervention in those cases where the District Court properly finds that the state proceeding is motivated by a desire to harass or is conducted in bad faith.\" <em>Huffman v. Pursue, Ltd.</em> , <extracted-citation case-ids=\"11644301\" index=\"101\" url=\"https://cite.case.law/us/420/592/#p611\">420 U.S. 592</extracted-citation>, 611, <extracted-citation case-ids=\"11644301\" index=\"102\" url=\"https://cite.case.law/us/420/592/#p611\">95 S.Ct. 1200</extracted-citation>, <extracted-citation case-ids=\"11644301\" index=\"103\" url=\"https://cite.case.law/us/420/592/#p611\">43 L.Ed.2d 482</extracted-citation> (1975).</p>\n<p id=\"p-56\">Second, contrary to Justice ALITO's characterization, our holding does not allow States to \"run roughshod over the functioning of [the Executive B]ranch.\" <em>Post,</em> at 2451. The Supremacy Clause prohibits state judges and prosecutors from interfering with a President's official duties. See, <em>e.g.,</em> <em>Tennessee v. Davis</em> , <extracted-citation case-ids=\"4666\" index=\"104\" url=\"https://cite.case.law/us/100/257/#p263\">100 U.S. 257</extracted-citation>, 263, <extracted-citation case-ids=\"4666\" index=\"105\" url=\"https://cite.case.law/us/100/257/#p263\">25 L.Ed. 648</extracted-citation> (1880) (\"No State government can ... obstruct [the] authorized officers\" of the Federal Government.). Any effort to manipulate a President's policy decisions or to \"retaliat[e]\" against a President for official acts through issuance of a subpoena, Brief for Respondent Vance 15, 43, would thus be an unconstitutional attempt to \"influence\" a superior sovereign \"exempt\" from such obstacles, see <em>McCulloch</em> , <extracted-citation case-ids=\"4702\" index=\"106\" url=\"https://cite.case.law/us/17/316/#p436\">4 Wheat. at 427</extracted-citation>. We generally \"assume[ ] that state courts and prosecutors will observe constitutional limitations.\" <em>Dombrowski v. Pfister</em> , <extracted-citation case-ids=\"1525344\" index=\"107\" url=\"https://cite.case.law/us/380/479/#p484\">380 U.S. 479</extracted-citation>, 484, <extracted-citation case-ids=\"1525344\" index=\"108\" url=\"https://cite.case.law/us/380/479/#p484\">85 S.Ct. 1116</extracted-citation>, <extracted-citation case-ids=\"1525344\" index=\"109\" url=\"https://cite.case.law/us/380/479/#p484\">14 L.Ed.2d 22</extracted-citation> (1965). Failing that, federal law allows a President to challenge any allegedly unconstitutional influence in a federal forum, as the President has done here. See <extracted-citation index=\"110\" url=\"https://cite.case.law/citations/?q=42%20U.S.C.%20%C2%A7%201983\">42 U.S.C. § 1983</extracted-citation> ; <em>Ex parte Young</em> , <extracted-citation case-ids=\"8288600\" index=\"111\" url=\"https://cite.case.law/us/209/123/#p155\">209 U.S. 123</extracted-citation>, 155-156, <extracted-citation case-ids=\"8288600\" index=\"112\" url=\"https://cite.case.law/us/209/123/#p155\">28 S.Ct. 441</extracted-citation>, <extracted-citation case-ids=\"8288600\" index=\"113\" url=\"https://cite.case.law/us/209/123/#p155\">52 L.Ed. 714</extracted-citation> (1908) (holding that federal courts may <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2429\" href=\"#p2429\" id=\"p2429\">*2429</a>enjoin state officials to conform their conduct to federal law).</p>\n<p id=\"p-57\">Given these safeguards and the Court's precedents, we cannot conclude that absolute immunity is necessary or appropriate under Article II or the Supremacy Clause. Our dissenting colleagues agree. Justice THOMAS reaches the same conclusion based on the original understanding of the Constitution reflected in Marshall's decision in <em>Burr</em> . <em>Post,</em> at 2434, 2435 - 2436. And Justice ALITO, also persuaded by <em>Burr</em> , \"agree[s]\" that \"not all\" state criminal subpoenas for a President's records \"should be barred.\" <em>Post,</em> at 2448. On that point the Court is unanimous.</p>\n<p id=\"p-58\">B</p>\n<p id=\"p-59\">We next consider whether a state grand jury subpoena seeking a President's private papers must satisfy a heightened need standard. The Solicitor General would require a threshold showing that the evidence sought is \"critical\" for \"specific charging decisions\" and that the subpoena is a \"last resort,\" meaning the evidence is \"not available from any other source\" and is needed \"now, rather than at the end of the President's term.\" Brief for United States as <em>Amicus Curiae</em> 29, 32 (internal quotation marks and alteration omitted). Justice ALITO, largely embracing those criteria, agrees that a state criminal subpoena to a President \"should not be allowed unless a heightened standard is met.\" <em>Post,</em> at 2448 - 2449 (asking whether the information is \"critical\" and \"necessary ... now\").</p>\n<p id=\"p-60\">We disagree, for three reasons. First, such a heightened standard would extend protection designed for official documents to the President's private papers. As the Solicitor General and Justice ALITO acknowledge, their proposed test is derived from executive privilege cases that trace back to <em>Burr</em> . Brief for United States as <em>Amicus Curiae</em> 26-28; <em>post,</em> at 2448 - 2449. There, Marshall explained that if Jefferson invoked presidential privilege over executive communications, the court would not \"proceed against the president as against an ordinary individual\" but would instead require an affidavit from the defense that \"would clearly show the paper to be essential to the justice of the case.\" <em>Burr</em> , 25 F.Cas. at 192. The Solicitor General and Justice ALITO would have us apply a similar standard to a President's personal papers. But this argument does not account for the relevant passage from <em>Burr</em> : \"If there be a paper in the possession of the executive, which is <em>not of an official nature</em> , he must stand, as respects that paper, in nearly the same situation with any other individual.\" <em>Id.</em> , at 191 (emphasis added). And it is only \"nearly\"-and not \"entirely\"-because the President retains the right to assert privilege over documents that, while ostensibly private, \"partake of the character of an official paper.\" <em>Id.</em> , at 191-192.</p>\n<p id=\"p-61\">Second, neither the Solicitor General nor Justice ALITO has established that heightened protection against state subpoenas is necessary for the Executive to fulfill his Article II functions. Beyond the risk of harassment, which we addressed above, the only justification they offer for the heightened standard is protecting Presidents from \"unwarranted burdens.\" Brief for United States as <em>Amicus Curiae</em> 28; see <em>post,</em> at 2448 (asking whether \"there is an urgent and critical need for the subpoenaed information\"). In effect, they argue that even if federal subpoenas to a President are warranted whenever evidence is material, state subpoenas are warranted \"only when [the] evidence is essential.\" Brief for United States as <em>Amicus Curiae</em> 28; see <em>post,</em> at 2448. But that double standard has no basis in law. For if the state subpoena is not issued to manipulate, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2430\" href=\"#p2430\" id=\"p2430\">*2430</a><em>supra,</em> at 2428 - 2429, the documents themselves are not protected, <em>supra</em> , at 2429, and the Executive is not impaired, <em>supra,</em> at 2425 - 2426, then nothing in Article II or the Supremacy Clause supports holding state subpoenas to a higher standard than their federal counterparts.</p>\n<p id=\"p-62\">Finally, in the absence of a need to protect the Executive, the public interest in fair and effective law enforcement cuts in favor of comprehensive access to evidence. Requiring a state grand jury to meet a heightened standard of need would hobble the grand jury's ability to acquire \"all information that might possibly bear on its investigation.\" <em>R. Enterprises, Inc.</em> , <extracted-citation case-ids=\"6224097\" index=\"114\" url=\"https://cite.case.law/us/498/292/#p299\">498 U.S. at 297</extracted-citation>, <extracted-citation case-ids=\"6224097\" index=\"115\" url=\"https://cite.case.law/us/498/292/#p299\">111 S.Ct. 722</extracted-citation>. And, even assuming the evidence withheld under that standard were preserved until the conclusion of a President's term, in the interim the State would be deprived of investigative leads that the evidence might yield, allowing memories to fade and documents to disappear. This could frustrate the identification, investigation, and indictment of third parties (for whom applicable statutes of limitations might lapse). More troubling, it could prejudice the innocent by depriving the grand jury of <em>exculpatory</em> evidence.</p>\n<p id=\"p-63\">Rejecting a heightened need standard does not leave Presidents with \"no real protection.\" <em>Post,</em> at 2450 (opinion of ALITO, J.). To start, a President may avail himself of the same protections available to every other citizen. These include the right to challenge the subpoena on any grounds permitted by state law, which usually include bad faith and undue burden or breadth. See, <em>e.g.</em> , <em>Virag</em> , <extracted-citation case-ids=\"2341761\" index=\"116\" url=\"https://cite.case.law/ny2d/54/437/#p442\">54 N.Y.2d at 442-445</extracted-citation>, <extracted-citation index=\"117\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\">446 N.Y.S.2d 196</extracted-citation>, <extracted-citation index=\"118\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\">430 N.E.2d at </extracted-citation>1252-1253 ; <em>In re Grand Jury Subpoenas</em> , <extracted-citation case-ids=\"4408852\" index=\"119\" url=\"https://cite.case.law/ny2d/72/307/#p315\">72 N.Y.2d 307</extracted-citation>, 315-316, <extracted-citation index=\"120\" url=\"https://cite.case.law/citations/?q=532%20N.Y.S.2d%20722\">532 N.Y.S.2d 722</extracted-citation>, <extracted-citation index=\"121\" url=\"https://cite.case.law/citations/?q=528%20N.E.2d%201195\">528 N.E.2d 1195</extracted-citation>, 1200 (1988) (recognizing that grand jury subpoenas can be challenged as \"overly broad\" or \"unreasonably burdensome\" (internal quotation marks omitted)). And, as in federal court, \"[t]he high respect that is owed to the office of the Chief Executive ... should inform the conduct of the entire proceeding, including the timing and scope of discovery.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"122\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 707</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"123\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>. See <em><extracted-citation case-ids=\"11652833\" index=\"124\" url=\"https://cite.case.law/us/520/681/#p704\">id.</extracted-citation></em> , at 724, <extracted-citation case-ids=\"11652833\" index=\"125\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation> (BREYER, J., concurring in judgment) (stressing the need for courts presiding over suits against the President to \"schedule proceedings so as to avoid significant interference with the President's ongoing discharge of his official responsibilities\"); <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"126\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 702</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"127\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> (\"[W]here a subpoena is directed to a President ... appellate review ... should be particularly meticulous.\").</p>\n<p id=\"p-64\">Furthermore, although the Constitution does not entitle the Executive to absolute immunity or a heightened standard, he is not \"relegate[d]\" only to the challenges available to private citizens. <em>Post,</em> at 2448 - 2449 (opinion of ALITO, J.). A President can raise subpoena-specific constitutional challenges, in either a state or federal forum. As previously noted, he can challenge the subpoena as an attempt to influence the performance of his official duties, in violation of the Supremacy Clause. See <em>supra</em> , at 2428 - 2429. This avenue protects against local political machinations \"interposed as an obstacle to the effective operation of a federal constitutional power.\" <em>United States v. Belmont</em> , <extracted-citation case-ids=\"547737\" index=\"128\" url=\"https://cite.case.law/us/301/324/#p332\">301 U.S. 324</extracted-citation>, 332, <extracted-citation case-ids=\"547737\" index=\"129\" url=\"https://cite.case.law/us/301/324/#p332\">57 S.Ct. 758</extracted-citation>, <extracted-citation case-ids=\"547737\" index=\"130\" url=\"https://cite.case.law/us/301/324/#p332\">81 L.Ed. 1134</extracted-citation> (1937).</p>\n<p id=\"p-65\">In addition, the Executive can-as the district attorney concedes-argue that compliance with a particular subpoena would impede his constitutional duties. Brief for Respondent Vance 42. Incidental to the functions confided in Article II is \"the power to perform them, without obstruction or impediment.\" 3 J. Story, Commentaries on the Constitution of the United States § 1563, pp. 418-419 <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2431\" href=\"#p2431\" id=\"p2431\">*2431</a>(1833). As a result, \"once the President sets forth and explains a conflict between judicial proceeding and public duties,\" or shows that an order or subpoena would \"significantly interfere with his efforts to carry out\" those duties, \"the matter changes.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"131\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 710, 714</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"132\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation> (opinion of BREYER, J.). At that point, a court should use its inherent authority to quash or modify the subpoena, if necessary to ensure that such \"interference with the President's duties would not occur.\" <em><extracted-citation case-ids=\"11652833\" index=\"133\" url=\"https://cite.case.law/us/520/681/#p704\">Id.</extracted-citation></em> , at 708, <extracted-citation case-ids=\"11652833\" index=\"134\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation> (opinion of the Court).</p>\n<p id=\"p-66\">* * *</p>\n<p id=\"p-67\">Two hundred years ago, a great jurist of our Court established that no citizen, not even the President, is categorically above the common duty to produce evidence when called upon in a criminal proceeding. We reaffirm that principle today and hold that the President is neither absolutely immune from state criminal subpoenas seeking his private papers nor entitled to a heightened standard of need. The \"guard[ ] furnished to this high officer\" lies where it always has-in \"the conduct of a court\" applying established legal and constitutional principles to individual subpoenas in a manner that preserves both the independence of the Executive and the integrity of the criminal justice system. <em>Burr</em> , 25 F.Cas. at 34.</p>\n<p id=\"p-68\">The arguments presented here and in the Court of Appeals were limited to absolute immunity and heightened need. The Court of Appeals, however, has directed that the case be returned to the District Court, where the President may raise further arguments as appropriate. <extracted-citation index=\"135\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\">941 F.3d at 646, n. 19</extracted-citation>.<footnotemark>6</footnotemark></p>\n<p id=\"p-69\">We affirm the judgment of the Court of Appeals and remand the case for further proceedings consistent with this opinion.</p>\n<p id=\"p-70\"><em>It is so ordered.</em></p>\n<p id=\"p-71\">Justice KAVANAUGH, with whom Justice GORSUCH joins, concurring in the judgment.</p>\n<p id=\"p-72\">The Court today unanimously concludes that a President does not possess absolute immunity from a state criminal subpoena, but also unanimously agrees that this case should be remanded to the District Court, where the President may raise constitutional and legal objections to the subpoena as appropriate. See <em>ante</em> , at 2431, and n. 6; <em>post</em> , at 2439 (THOMAS, J., dissenting); <em>post</em> , at 2448 - 2450 (ALITO, J., dissenting). I agree with those two conclusions.</p>\n<p id=\"p-73\">* * *</p>\n<p id=\"p-74\">The dispute over this grand jury subpoena reflects a conflict between a State's interest in criminal investigation and a President's Article II interest in performing his or her duties without undue interference. Although this case involves personal information of the President and is therefore not an executive privilege case, the majority opinion correctly concludes based on precedent that Article II and the Supremacy Clause of the Constitution supply some protection for the Presidency against state criminal subpoenas of this sort.</p>\n<p id=\"p-75\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2432\" href=\"#p2432\" id=\"p2432\">*2432</a>In our system of government, as this Court has often stated, no one is above the law. That principle applies, of course, to a President. At the same time, in light of Article II of the Constitution, this Court has repeatedly declared-and the Court indicates again today-that a court may not proceed against a President as it would against an ordinary litigant. See <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"136\" url=\"https://cite.case.law/us/542/367/#p381\">542 U.S. 367</extracted-citation>, 381-382, <extracted-citation case-ids=\"2527206\" index=\"137\" url=\"https://cite.case.law/us/542/367/#p381\">124 S.Ct. 2576</extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"138\" url=\"https://cite.case.law/us/542/367/#p381\">159 L.Ed.2d 459</extracted-citation> (2004) (\"In no case would a court be required to proceed against the president as against an ordinary individual\" (internal quotation marks and alterations omitted)); <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"139\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. 681</extracted-citation>, 704, n. 39, <extracted-citation case-ids=\"11652833\" index=\"140\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"141\" url=\"https://cite.case.law/us/520/681/#p704\">137 L.Ed.2d 945</extracted-citation> (1997) (a court may not \"proceed against the president as against an ordinary individual\" (internal quotation marks omitted)); <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"142\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, 715, <extracted-citation case-ids=\"6174416\" index=\"143\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"144\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974) (\"In no case of this kind would a court be required to proceed against the president as against an ordinary individual\" (internal quotation marks and alterations omitted));<em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"145\" url=\"https://cite.case.law/f-cas/25/187/#p192\">25 F.Cas. 187</extracted-citation>, 192, (No. 14694) (CC Va. 1807) (Marshall, C. J.) (\"In no case of this kind would a court be required to proceed against the president as against an ordinary individual\").</p>\n<p id=\"p-76\">The question here, then, is how to balance the State's interests and the Article II interests. The longstanding precedent that has applied to federal criminal subpoenas for official, privileged Executive Branch information is <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"146\" url=\"https://cite.case.law/us/418/683/\">418 U.S. 683</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"147\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"148\" url=\"https://cite.case.law/us/418/683/\">41 L.Ed.2d 1039</extracted-citation> (1974). That landmark case requires that a prosecutor establish a \"demonstrated, specific need\" for the President's information. <em><extracted-citation case-ids=\"6174416\" index=\"149\" url=\"https://cite.case.law/us/418/683/\">Id.</extracted-citation></em> , at 713, <extracted-citation case-ids=\"6174416\" index=\"150\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> ; see also <em>In re Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"151\" url=\"https://cite.case.law/f3d/121/729/\">121 F.3d 729</extracted-citation>, 753-757 (CADC 1997) ; cf. <em>Senate Select Committee on Presidential Campaign Activities v. Nixon</em> , <extracted-citation case-ids=\"3681739,169479\" index=\"152\" url=\"https://cite.case.law/f2d/498/725/\">498 F.2d 725</extracted-citation>, 730-731 (CADC 1974) (en banc) (similar standard for congressional subpoenas to the Executive Branch).</p>\n<p id=\"p-77\">The <em>Nixon</em> \"demonstrated, specific need\" standard is a tried-and-true test that accommodates both the interests of the criminal process and the Article II interests of the Presidency. The <em>Nixon</em> standard ensures that a prosecutor's interest in subpoenaed information is sufficiently important to justify an intrusion on the Article II interests of the Presidency. The <em>Nixon</em> standard also reduces the risk of subjecting a President to unwarranted burdens, because it provides that a prosecutor may obtain a President's information only in certain defined circumstances.</p>\n<p id=\"p-78\">Although the Court adopted the <em>Nixon</em> standard in a different Article II context-there, involving the confidentiality of official, privileged information-the majority opinion today recognizes that there are also important Article II (and Supremacy Clause) interests at stake here. A state criminal subpoena to a President raises Article II and Supremacy Clause issues because of the potential for a state prosecutor to use the criminal process and issue subpoenas in a way that interferes with the President's duties, through harassment or diversion. Cf. <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"153\" url=\"https://cite.case.law/us/457/731/#p749\">457 U.S. 731</extracted-citation>, 751-753, <extracted-citation case-ids=\"6194478\" index=\"154\" url=\"https://cite.case.law/us/457/731/#p749\">102 S.Ct. 2690</extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"155\" url=\"https://cite.case.law/us/457/731/#p749\">73 L.Ed.2d 349</extracted-citation> (1982).</p>\n<p id=\"p-79\">Because this case again entails a clash between the interests of the criminal process and the Article II interests of the Presidency, I would apply the longstanding <em>Nixon</em> \"demonstrated, specific need\" standard to this case. The majority opinion does not apply the <em>Nixon</em> standard in this distinct Article II context, as I would have done. That said, the majority opinion appropriately takes account of some important concerns that also animate <em>Nixon</em> and the Constitution's balance of powers. The <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2433\" href=\"#p2433\" id=\"p2433\">*2433</a>majority opinion explains that a state prosecutor may not issue a subpoena for a President's personal information out of bad faith, malice, or an intent to harass a President, <em>ante</em> , at 2428; as a result of prosecutorial impropriety, <em><extracted-citation case-ids=\"6194478\" index=\"156\" url=\"https://cite.case.law/us/457/731/#p749\">ibid.</extracted-citation></em> ; to seek information that is not relevant to an investigation, <em>ante</em> , at 2428 - 2429 - 2430; that is overly broad or unduly burdensome, <em>ante</em> , at 2429 - 2430; to manipulate, influence, or retaliate against a President's official acts or policy decisions, <em>ante</em> , at 2428 - 2429, 2430; or in a way that would impede, conflict with, or interfere with a President's official duties, <em>ante</em> , at 2431. All nine Members of the Court agree, moreover, that a President may raise objections to a state criminal subpoena not just in state court but also in federal court.<footnotemark>1</footnotemark> And the majority opinion indicates that, in light of the \"high respect that is owed to the office of the Chief Executive,\" courts \"should be particularly meticulous\" in assessing a subpoena for a President's personal records. <em>Ante</em> , at 2430 (quoting <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"157\" url=\"https://cite.case.law/us/520/681/#p704\">520 U.S. at 707</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"158\" url=\"https://cite.case.law/us/520/681/#p704\">117 S.Ct. 1636</extracted-citation>, and <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"159\" url=\"https://cite.case.law/us/418/683/\">418 U.S. at 702</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"160\" url=\"https://cite.case.law/us/418/683/\">94 S.Ct. 3090</extracted-citation> ).</p>\n<p id=\"p-80\">In the end, much may depend on how the majority opinion's various standards are applied in future years and decades.<footnotemark>2</footnotemark> It will take future cases to determine precisely how much difference exists between (i) the various standards articulated by the majority opinion, (ii) the overarching <em>Nixon</em> \"demonstrated, specific need\" standard that I would adopt, and (iii) Justice THOMAS's and Justice ALITO's other proposed standards. In any event, in my view, lower courts in cases of this sort involving a President will almost invariably have to begin by delving into why the State wants the information; why and how much the State needs the information, including whether the State could obtain the information elsewhere; and whether compliance with the subpoena would unduly burden or interfere with a President's official duties.</p>\n<p id=\"p-81\">* * *</p>\n<p id=\"p-82\">I agree that the case should be remanded to the District Court for further proceedings, where the President may raise constitutional and legal objections to the state grand jury subpoena as appropriate.</p>\n<footnote label=\"1\">\n<p id=\"p-192\">This maxim traces at least as far back as Lord Chancellor Hardwicke, in a 1742 parliamentary debate. See 12 Parliamentary History of England 693 (1812).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-193\">The grand jury subpoena essentially copied a subpoena issued to Mazars in April 2019 by the Committee on Oversight and Reform of the U. S. House of Representatives, which is at issue in <em>Trump v. Mazars USA, LLP</em> , <extracted-citation index=\"161\" url=\"https://cite.case.law/citations/?q=2020%20WL%202848061\">2020 WL 2848061</extracted-citation> (2020). The principal difference is that the instant subpoena expressly requests tax returns.</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-194\">See generally N. Isenberg, Fallen Founder: The Life of Aaron Burr 271-365 (2007); J. Smith, John Marshall: Definer of a Nation 348-374 (1996); M. Lomask, Aaron Burr: The Conspiracy and Years of Exile, 1805-1836, pp. 222-298 (1982).</p>\n</footnote>\n<footnote label=\"4\">\n<p id=\"p-195\">Wilkinson was secretly being paid by Spain for information and influence. In the wake of Burr's trial, he was investigated by Congress and later court-martialed. But he was acquitted for want of evidence, and his duplicity was not confirmed until decades after his death, when Spanish archival material came to light.</p>\n</footnote>\n<footnote label=\"5\">\n<p id=\"p-196\">While the subpoena was directed to the President's accounting firm, the parties agree that the papers at issue belong to the President and that Mazars is merely the custodian. Thus, for purposes of immunity, it is functionally a subpoena issued to the President.</p>\n</footnote>\n<footnote label=\"6\">\n<p id=\"p-197\">The daylight between our opinion and Justice THOMAS's \"dissent\" is not as great as that label might suggest. <em>Post,</em> at 2439. We agree that Presidents are neither absolutely immune from state criminal subpoenas nor insulated by a heightened need standard. <em>Post,</em> at 2436, 2439, n. 3. We agree that Presidents may challenge specific subpoenas as impeding their Article II functions. <em>Post,</em> at 2436 - 2437. And, although we affirm while Justice THOMAS would vacate, we agree that this case will be remanded to the District Court. <em>Post,</em> at 2439.</p>\n</footnote>\n</opinion>", "html_with_citations": "<opinion type=\"majority\">\n<author id=\"p-10\">Chief Justice ROBERTS delivered the opinion of the Court.</author>\n<p id=\"p-11\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2420\" href=\"#p2420\" id=\"p2420\">*2420</a>In our judicial system, \"the public has a right to every man's evidence.\"<footnotemark>1</footnotemark> Since the earliest days of the Republic, \"every man\" has included the President of the United States. Beginning with Jefferson and carrying on through Clinton, Presidents have uniformly testified or produced documents in criminal proceedings when called upon by federal courts. This case involves-so far as we and the parties can tell-the first <em>state</em> criminal subpoena directed to a President. The President contends that the subpoena is unenforceable. We granted certiorari to decide whether Article II and the Supremacy Clause categorically preclude, or require a heightened standard for, the issuance of a state criminal subpoena to a sitting President.</p>\n<p id=\"p-12\">I</p>\n<p id=\"p-13\">In the summer of 2018, the New York County District Attorney's Office opened an investigation into what it opaquely describes as \"business transactions involving multiple individuals whose conduct may have violated state law.\" Brief for Respondent Vance 2. A year later, the office-acting on behalf of a grand jury-served a subpoena <em>duces tecum</em> (essentially a request to produce evidence) on Mazars USA, LLP, the personal accounting firm of President Donald J. Trump. The subpoena directed Mazars to produce financial records relating to the President and business organizations affiliated with him, including \"[t]ax returns and related schedules,\" from \"2011 to the present.\" App. to Pet. for Cert. 119a.<footnotemark>2</footnotemark></p>\n<p id=\"p-14\">The President, acting in his personal capacity, sued the district attorney and Mazars in Federal District Court to enjoin enforcement of the subpoena. He argued that, under Article II and the Supremacy Clause, a sitting President enjoys absolute immunity from state criminal process. He asked the court to issue a \"declaratory judgment that the subpoena is invalid and unenforceable while the President is in office\" and to permanently enjoin the district attorney \"from taking any action to enforce the subpoena.\" Amended Complaint in No. 1:19-cv-8694 (SDNY, Sept. 25, 2019), p. 19. Mazars, concluding that the dispute was between the President and the district attorney, took no position on the legal issues raised by the President.</p>\n<p id=\"p-15\">The District Court abstained from exercising jurisdiction and dismissed the case based on <em>Younger v. Harris</em> , <extracted-citation case-ids=\"11711728\" index=\"0\" url=\"https://cite.case.law/us/401/37/\"><span class=\"citation\" data-id=\"9424435\"><a href=\"/opinion/108263/younger-v-harris/\" aria-description=\"Citation for case: Younger v. Harris\">401 U. S. 37</a></span></extracted-citation>, <extracted-citation case-ids=\"11711728\" index=\"1\" url=\"https://cite.case.law/us/401/37/\"><span class=\"citation\" data-id=\"9424435\"><a href=\"/opinion/108263/younger-v-harris/\" aria-description=\"Citation for case: Younger v. Harris\">91 S.Ct. 746</a></span></extracted-citation>, <extracted-citation case-ids=\"11711728\" index=\"2\" url=\"https://cite.case.law/us/401/37/\"><span class=\"citation\" data-id=\"9424435\"><a href=\"/opinion/108263/younger-v-harris/\" aria-description=\"Citation for case: Younger v. Harris\">27 L.Ed.2d 669</a></span></extracted-citation> (1971), which generally precludes federal courts from intervening in ongoing state criminal <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2421\" href=\"#p2421\" id=\"p2421\">*2421</a>prosecutions. <extracted-citation index=\"3\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\"><span class=\"citation no-link\">395 F.Supp.3d 283</span></extracted-citation>, 290 (SDNY 2019). In an alternative holding, the court ruled that the President was not entitled to injunctive relief. <em><extracted-citation index=\"4\" url=\"https://cite.case.law/citations/?q=395%20F.%20Supp.%203d%20283\"><span class=\"citation no-link\">Ibid.</span></extracted-citation></em></p>\n<p id=\"p-16\">The Second Circuit met the District Court halfway. As to the dismissal, the Court of Appeals held that <em><span class=\"citation\" data-id=\"9424435\"><a href=\"/opinion/108263/younger-v-harris/\" aria-description=\"Citation for case: Younger v. Harris\">Younger</a></span></em> abstention was inappropriate because that doctrine's core justification-\"preventing friction\" between States and the Federal Government-is diminished when state and federal actors are already in conflict, as the district attorney and the President were. <extracted-citation index=\"5\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\"><span class=\"citation no-link\">941 F.3d 631</span></extracted-citation>, 637, 639 (2019).</p>\n<p id=\"p-17\">On the merits, the Court of Appeals agreed with the District Court's denial of a preliminary injunction. Drawing on the 200-year history of Presidents being subject to federal judicial process, the Court of Appeals concluded that \"presidential immunity does not bar the enforcement of a state grand jury subpoena directing a third party to produce non-privileged material, even when the subject matter under investigation pertains to the President.\" <em><extracted-citation index=\"6\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\"><span class=\"citation no-link\">Id.</span></extracted-citation></em> , at 640. It also rejected the argument raised by the United States as <em>amicus curiae</em> that a state grand jury subpoena must satisfy a heightened showing of need. The court reasoned that the proposed test, derived from cases addressing privileged Executive Branch communications, \"ha[d] little bearing on a subpoena\" seeking \"information relating solely to the President in his private capacity and disconnected from the discharge of his constitutional obligations.\" <em><extracted-citation index=\"7\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\"><span class=\"citation no-link\">Id.,</span></extracted-citation></em><extracted-citation index=\"7\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\"> at 645-646</extracted-citation>.</p>\n<p id=\"p-18\">We granted certiorari. 589 U. S. ----, <extracted-citation case-ids=\"12629966,12629967,12629968,12629969,12629970\" index=\"8\" url=\"https://cite.case.law/s-ct/140/659/\"><span class=\"citation multiple-matches\"><a href=\"/c/S.Ct./140/659/\">140 S.Ct. 659</a></span></extracted-citation>, <extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"9\" url=\"https://cite.case.law/l-ed-2d/205/418/\"><span class=\"citation multiple-matches\"><a href=\"/c/L.Ed.2d/205/418/\">205 L.Ed.2d 418</a></span></extracted-citation> (2019).</p>\n<p id=\"p-19\">II</p>\n<p id=\"p-20\">In the summer of 1807, all eyes were on Richmond, Virginia. Aaron Burr, the former Vice President, was on trial for treason.<footnotemark>3</footnotemark> Fallen from political grace after his fatal duel with Alexander Hamilton, and with a murder charge pending in New Jersey, Burr followed the path of many down-and-out Americans of his day-he headed West in search of new opportunity. But Burr was a man with outsized ambitions. Together with General James Wilkinson, the Governor of the Louisiana Territory, he hatched a plan to establish a new territory in Mexico, then controlled by Spain.<footnotemark>4</footnotemark> Both men anticipated that war between the United States and Spain was imminent, and when it broke out they intended to invade Spanish territory at the head of a private army.</p>\n<p id=\"p-21\">But while Burr was rallying allies to his cause, tensions with Spain eased and rumors began to swirl that Burr was conspiring to detach States by the Allegheny Mountains from the Union. Wary of being exposed as the principal co-conspirator, Wilkinson took steps to ensure that any blame would fall on Burr. He sent a series of letters to President Jefferson accusing Burr of plotting to attack New Orleans and revolutionize the Louisiana Territory.</p>\n<p id=\"p-22\">Jefferson, who despised his former running mate Burr for trying to steal the 1800 presidential election from him, was predisposed to credit Wilkinson's version of events. The President sent a special message to Congress identifying Burr as the <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2422\" href=\"#p2422\" id=\"p2422\">*2422</a>\"prime mover\" in a plot \"against the peace and safety of the Union.\" 16 Annals of Cong. 39-40 (1807). According to Jefferson, Burr contemplated either the \"severance of the Union\" or an attack on Spanish territory. <em><extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"10\" url=\"https://cite.case.law/l-ed-2d/205/418/\">Id.</extracted-citation></em> , at 41. Jefferson acknowledged that his sources contained a \"mixture of rumors, conjectures, and suspicions\" but, citing Wilkinson's letters, he assured Congress that Burr's guilt was \"beyond question.\" <em><extracted-citation case-ids=\"12629978,12629979,12629966\" index=\"11\" url=\"https://cite.case.law/l-ed-2d/205/418/\">Id.</extracted-citation></em> , at 39-40.</p>\n<p id=\"p-23\">The trial that followed was \"the greatest spectacle in the short history of the republic,\" complete with a Founder-studded cast. N. Isenberg, Fallen Founder: The Life of Aaron Burr 351 (2007). People flocked to Richmond to watch, massing in tents and covered wagons along the banks of the James River, nearly doubling the town's population of 5,000. Burr's defense team included Edmund Randolph and Luther Martin, both former delegates at the Constitutional Convention and renowned advocates. Chief Justice John Marshall, who had recently squared off with the Jefferson administration in <em>Marbury v. Madison</em> , <extracted-citation case-ids=\"6760011,6759998,12121622\" index=\"12\" url=\"https://cite.case.law/cranch/1/137/\"><span class=\"citation\" data-id=\"84759\"><a href=\"/opinion/84759/marbury-v-madison/\" aria-description=\"Citation for case: Marbury v. Madison\">1 Cranch 137</a></span></extracted-citation>, <extracted-citation case-ids=\"12121622\" index=\"13\" url=\"https://cite.case.law/us/5/137/\"><span class=\"citation\" data-id=\"84759\"><a href=\"/opinion/84759/marbury-v-madison/\" aria-description=\"Citation for case: Marbury v. Madison\">2 L.Ed. 60</a></span></extracted-citation> (1803), presided as Circuit Justice for Virginia. Meanwhile Jefferson, intent on conviction, orchestrated the prosecution from afar, dedicating Cabinet meetings to the case, peppering the prosecutors with directions, and spending nearly $100,000 from the Treasury on the five-month proceedings.</p>\n<p id=\"p-24\">In the lead-up to trial, Burr, taking aim at his accusers, moved for a subpoena <em>duces tecum</em> directed at Jefferson. The draft subpoena required the President to produce an October 21, 1806 letter from Wilkinson and accompanying documents, which Jefferson had referenced in his message to Congress. The prosecution opposed the request, arguing that a President could not be subjected to such a subpoena and that the letter might contain state secrets. Following four days of argument, Marshall announced his ruling to a packed chamber.</p>\n<p id=\"p-25\">The President, Marshall declared, does not \"stand exempt from the general provisions of the constitution\" or, in particular, the Sixth Amendment's guarantee that those accused have compulsory process for obtaining witnesses for their defense. <em>United States v. Burr</em> , <extracted-citation case-ids=\"6579548\" index=\"14\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. 30</a></span></extracted-citation>, 33-34 (No. 14,692d) (CC Va. 1807). At common law the \"single reservation\" to the duty to testify in response to a subpoena was \"the case of the king,\" whose \"dignity\" was seen as \"incompatible\" with appearing \"under the process of the court.\" <em><extracted-citation case-ids=\"6579548\" index=\"15\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 34. But, as Marshall explained, a king is born to power and can \"do no wrong.\" <em><extracted-citation case-ids=\"6579548\" index=\"16\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> The President, by contrast, is \"of the people\" and subject to the law. <em><extracted-citation case-ids=\"6579548\" index=\"17\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> According to Marshall, the sole argument for exempting the President from testimonial obligations was that his \"duties as chief magistrate demand his whole time for national objects.\" <em><extracted-citation case-ids=\"6579548\" index=\"18\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> But, in Marshall's assessment, those demands were \"not unremitting.\" <em><extracted-citation case-ids=\"6579548\" index=\"19\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> And should the President's duties preclude his attendance at a particular time and place, a court could work that out upon return of the subpoena. <em><extracted-citation case-ids=\"6579548\" index=\"20\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em></p>\n<p id=\"p-26\">Marshall also rejected the prosecution's argument that the President was immune from a subpoena <em>duces tecum</em> because executive papers might contain state secrets. \"A subpoena duces tecum,\" he said, \"may issue to any person to whom an ordinary subpoena may issue.\" <em><extracted-citation case-ids=\"6579548\" index=\"21\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> As he explained, no \"fair construction\" of the Constitution supported the conclusion that the right \"to compel the attendance of witnesses[ ] does not extend\" to requiring those witnesses to \"bring[ ] with them such papers as may be material in the defence.\" <em><extracted-citation case-ids=\"6579548\" index=\"22\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 35. And, as a matter of basic fairness, permitting such information to be withheld would \"tarnish the reputation of the court.\" <em><extracted-citation case-ids=\"6579548\" index=\"23\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 37. As for \"the propriety <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2423\" href=\"#p2423\" id=\"p2423\">*2423</a>of introducing any papers,\" that would \"depend on the character of the paper, not on the character of the person who holds it.\" <em><extracted-citation case-ids=\"6579548\" index=\"24\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 34. Marshall acknowledged that the papers sought by Burr could contain information \"the disclosure of which would endanger the public safety,\" but stated that, again, such concerns would have \"due consideration\" upon the return of the subpoena. <em><extracted-citation case-ids=\"6579548\" index=\"25\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 37.</p>\n<p id=\"p-27\">While the arguments unfolded, Jefferson, who had received word of the motion, wrote to the prosecutor indicating that he would-subject to the prerogative to decide which executive communications should be withheld-\"furnish on all occasions, whatever the purposes of justice may require.\" Letter from T. Jefferson to G. Hay (June 12, 1807), in 10 Works of Thomas Jefferson 398, n. (P. Ford ed. 1905). His \"personal attendance,\" however, was out of the question, for it \"would leave the nation without\" the \"sole branch which the constitution requires to be always in function.\" Letter from T. Jefferson to G. Hay (June 17, 1807), in <em><extracted-citation case-ids=\"6579548\" index=\"26\" url=\"https://cite.case.law/f-cas/25/30/#p33\"><span class=\"citation\" data-id=\"8638362\"><a href=\"/opinion/8658511/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">id.</a></span></extracted-citation></em> , at 400-401, n.</p>\n<p id=\"p-28\">Before Burr received the subpoenaed documents, Marshall rejected the prosecution's core legal theory for treason and Burr was accordingly acquitted. Jefferson, however, was not done. Committed to salvaging a conviction, he directed the prosecutors to proceed with a misdemeanor (yes, misdemeanor) charge for inciting war against Spain. Burr then renewed his request for Wilkinson's October 21 letter, which he later received a copy of, and subpoenaed a second letter, dated November 12, 1806, which the prosecutor claimed was privileged. Acknowledging that the President may withhold information to protect public safety, Marshall instructed that Jefferson should \"state the particular reasons\" for withholding the letter. <em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"27\" url=\"https://cite.case.law/f-cas/25/187/#p192\"><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. 187</a></span></extracted-citation>, 192, (No. 14694) (CC Va. 1807). The court, paying \"all proper respect\" to those reasons, would then decide whether to compel disclosure. <em><extracted-citation case-ids=\"6580056\" index=\"28\" url=\"https://cite.case.law/f-cas/25/187/#p192\"><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Ibid.</a></span></extracted-citation></em> But that decision was averted when the misdemeanor trial was cut short after it became clear that the prosecution lacked the evidence to convict.</p>\n<p id=\"p-29\">In the two centuries since the Burr trial, successive Presidents have accepted Marshall's ruling that the Chief Executive is subject to subpoena. In 1818, President Monroe received a subpoena to testify in a court-martial against one of his appointees. See Rotunda, Presidents and Ex-Presidents as Witnesses: A Brief Historical Footnote, 1975 U. Ill. L. Forum 1, 5. His Attorney General, William Wirt-who had served as a prosecutor during Burr's trial-advised Monroe that, per Marshall's ruling, a subpoena to testify may \"be properly awarded to the President.\" <em><extracted-citation case-ids=\"6580056\" index=\"29\" url=\"https://cite.case.law/f-cas/25/187/#p192\"><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">Id.</a></span></extracted-citation></em> , at 5-6. Monroe offered to sit for a deposition and ultimately submitted answers to written interrogatories.</p>\n<p id=\"p-30\">Following Monroe's lead, his successors have uniformly agreed to testify when called in criminal proceedings, provided they could do so at a time and place of their choosing. In 1875, President Grant submitted to a three-hour deposition in the criminal prosecution of a political appointee embroiled in a network of tax-evading whiskey distillers. See 1 R. Rotunda &amp; J. Nowak, Constitutional Law § 7.1(b)(ii), p. 996 (5th ed. 2012) (Rotunda &amp; Nowak). A century later, President Ford's attempted assassin subpoenaed him to testify in her defense. See <em>United States v. Fromme</em> , <extracted-citation case-ids=\"3839654\" index=\"30\" url=\"https://cite.case.law/f-supp/405/578/\"><span class=\"citation\" data-id=\"1432687\"><a href=\"/opinion/1432687/united-states-v-fromme/\" aria-description=\"Citation for case: United States v. Fromme\">405 F.Supp. 578</a></span></extracted-citation> (ED Cal. 1975). Ford obliged-from a safe distance-in the first videotaped deposition of a President. President Carter testified via the same means in the trial of two local officials who, while Carter was Governor of Georgia, had offered to contribute to his campaign in exchange for advance warning of any state gambling raids. See Carter's Testimony, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2424\" href=\"#p2424\" id=\"p2424\">*2424</a>on Videotape, Is Given to Georgia Gambling Trial, N. Y. Times, Apr. 20, 1978, p. A20 (Carter recounted that he \"rejected the proposition instantly.\"). Two years later, Carter gave videotaped testimony to a federal grand jury investigating whether a fugitive financier had entreated the White House to quash his extradition proceedings. See Rotunda &amp; Nowak § 7.1(b)(vi), at 997. President Clinton testified three times, twice via deposition pursuant to subpoenas in federal criminal trials of associates implicated during the Whitewater investigation, and once by video for a grand jury investigating possible perjury. See <em><extracted-citation case-ids=\"3839654\" index=\"31\" url=\"https://cite.case.law/f-supp/405/578/\">id.</extracted-citation></em> , § 7.1(c)(viii), at 1007-1008.</p>\n<p id=\"p-31\">The bookend to Marshall's ruling came in 1974 when the question he never had to decide-whether to compel the disclosure of official communications over the objection of the President-came to a head. That spring, the Special Prosecutor appointed to investigate the break-in of the Democratic National Committee Headquarters at the Watergate complex filed an indictment charging seven defendants associated with President Nixon and naming Nixon as an unindicted co-conspirator. As the case moved toward trial, the Special Prosecutor secured a subpoena <em>duces tecum</em> directing Nixon to produce, among other things, tape recordings of Oval Office meetings. Nixon moved to quash the subpoena, claiming that the Constitution provides an absolute privilege of confidentiality to all presidential communications. This Court rejected that argument in <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"32\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"33\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"34\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974), a decision we later described as \"unequivocally and emphatically endors[ing] Marshall's\" holding that Presidents are subject to subpoena. <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"35\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. 681</a></span></extracted-citation>, 704, <extracted-citation case-ids=\"11652833\" index=\"36\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"37\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997).</p>\n<p id=\"p-32\">The <em><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Nixon</a></span></em> Court readily acknowledged the importance of preserving the confidentiality of communications \"between high Government officials and those who advise and assist them.\" <extracted-citation case-ids=\"6174416\" index=\"38\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 705</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"39\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>. \"Human experience,\" the Court explained, \"teaches that those who expect public dissemination of their remarks may well temper candor with a concern for appearances and for their own interests to the detriment of the decisionmaking process.\" <em><extracted-citation case-ids=\"6174416\" index=\"40\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Ibid.</a></span></extracted-citation></em> Confidentiality thus promoted the \"public interest in candid, objective, and even blunt or harsh opinions in Presidential decisionmaking.\" <em><extracted-citation case-ids=\"6174416\" index=\"41\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Id.</a></span></extracted-citation></em> , at 708, <extracted-citation case-ids=\"6174416\" index=\"42\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>.</p>\n<p id=\"p-33\">But, like Marshall two centuries prior, the Court recognized the countervailing interests at stake. Invoking the common law maxim that \"the public has a right to every man's evidence,\" the Court observed that the public interest in fair and accurate judicial proceedings is at its height in the criminal setting, where our common commitment to justice demands that \"guilt shall not escape\" nor \"innocence suffer.\" <em><extracted-citation case-ids=\"6174416\" index=\"43\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Id.</a></span></extracted-citation></em> , at 709, <extracted-citation case-ids=\"6174416\" index=\"44\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> (internal quotation marks and alteration omitted). Because these dual aims would be \"defeated if judgments\" were \"founded on a partial or speculative presentation of the facts,\" the <em><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Nixon</a></span></em> Court recognized that it was \"imperative\" that \"compulsory process be available for the production of evidence needed either by the prosecution or the defense.\" <em><extracted-citation case-ids=\"6174416\" index=\"45\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Ibid.</a></span></extracted-citation></em></p>\n<p id=\"p-34\">The Court thus concluded that the President's \"generalized assertion of privilege must yield to the demonstrated, specific need for evidence in a pending criminal trial.\" <em><extracted-citation case-ids=\"6174416\" index=\"46\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Id.</a></span></extracted-citation></em> , at 713, <extracted-citation case-ids=\"6174416\" index=\"47\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>. Two weeks later, President Nixon dutifully released the tapes.</p>\n<p id=\"p-35\">III</p>\n<p id=\"p-36\">The history surveyed above all involved <em>federal</em> criminal proceedings. Here we are confronted for the first time with a subpoena <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2425\" href=\"#p2425\" id=\"p2425\">*2425</a>issued to the President by a local grand jury operating under the supervision of a <em>state</em> court.<footnotemark>5</footnotemark></p>\n<p id=\"p-37\">In the President's view, that distinction makes all the difference. He argues that the Supremacy Clause gives a sitting President absolute immunity from state criminal subpoenas because compliance with those subpoenas would categorically impair a President's performance of his Article II functions. The Solicitor General, arguing on behalf of the United States, agrees with much of the President's reasoning but does not commit to his bottom line. Instead, the Solicitor General urges us to resolve this case by holding that a state grand jury subpoena for a sitting President's personal records must, at the very least, \"satisfy a heightened standard of need,\" which the Solicitor General contends was not met here. Brief for United States as <em>Amicus Curiae</em> 26, 29.</p>\n<p id=\"p-38\">A</p>\n<p id=\"p-39\">We begin with the question of absolute immunity. No one doubts that Article II guarantees the independence of the Executive Branch. As the head of that branch, the President \"occupies a unique position in the constitutional scheme.\" <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"48\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, 749, <extracted-citation case-ids=\"6194478\" index=\"49\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"50\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982). His duties, which range from faithfully executing the laws to commanding the Armed Forces, are of unrivaled gravity and breadth. Quite appropriately, those duties come with protections that safeguard the President's ability to perform his vital functions. See, <em>e.g.</em> , <em><extracted-citation case-ids=\"6194478\" index=\"51\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">ibid.</a></span></extracted-citation></em> (concluding that the President enjoys \"absolute immunity from damages liability predicated on his official acts\"); <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"52\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 708</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"53\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> (recognizing that presidential communications are presumptively privileged).</p>\n<p id=\"p-40\">In addition, the Constitution guarantees \"the entire independence of the General Government from any control by the respective States.\" <em>Farmers and Mechanics Sav. Bank of Minneapolis v. Minnesota</em> , <extracted-citation case-ids=\"3672318\" index=\"54\" url=\"https://cite.case.law/us/232/516/#p521\"><span class=\"citation\" data-id=\"98109\"><a href=\"/opinion/98109/farmers-and-mechanics-sav-bank-of-minneapolis-v-minnesota/\" aria-description=\"Citation for case: Farmers and Mechanics Sav. Bank of Minneapolis v. Minnesota\">232 U.S. 516</a></span></extracted-citation>, 521, <extracted-citation case-ids=\"3672318\" index=\"55\" url=\"https://cite.case.law/us/232/516/#p521\"><span class=\"citation\" data-id=\"98109\"><a href=\"/opinion/98109/farmers-and-mechanics-sav-bank-of-minneapolis-v-minnesota/\" aria-description=\"Citation for case: Farmers and Mechanics Sav. Bank of Minneapolis v. Minnesota\">34 S.Ct. 354</a></span></extracted-citation>, <extracted-citation case-ids=\"3672318\" index=\"56\" url=\"https://cite.case.law/us/232/516/#p521\"><span class=\"citation\" data-id=\"98109\"><a href=\"/opinion/98109/farmers-and-mechanics-sav-bank-of-minneapolis-v-minnesota/\" aria-description=\"Citation for case: Farmers and Mechanics Sav. Bank of Minneapolis v. Minnesota\">58 L.Ed. 706</a></span></extracted-citation> (1914). As we have often repeated, \"States have no power ... to retard, impede, burden, or in any manner control the operations of the constitutional laws enacted by Congress.\" <em>McCulloch v. Maryland</em> , <extracted-citation case-ids=\"4702\" index=\"57\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 Wheat. 316</a></span></extracted-citation>, 436, <extracted-citation case-ids=\"4702\" index=\"58\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 L.Ed. 579</a></span></extracted-citation> (1819). It follows that States also lack the power to impede the President's execution of those laws.</p>\n<p id=\"p-41\">Marshall's ruling in <em>Burr</em> , entrenched by 200 years of practice and our decision in <em>Nixon</em> , confirms that <em>federal</em> criminal subpoenas do not \"rise to the level of constitutionally forbidden impairment of the Executive's ability to perform its constitutionally mandated functions.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"59\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 702</a></span>-703</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"60\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. But the President, joined in part by the Solicitor General, argues that <em>state</em> criminal subpoenas pose a unique threat of impairment and thus demand greater protection. To be clear, the President does not contend here that <em>this</em> subpoena, in particular, is impermissibly burdensome. Instead he makes a <em>categorical</em> argument about the burdens generally associated with state criminal subpoenas, focusing on three: diversion, stigma, and harassment. We address each in turn.</p>\n<p id=\"p-42\">1</p>\n<p id=\"p-43\">The President's primary contention, which the Solicitor General supports, is that complying with state criminal subpoenas <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2426\" href=\"#p2426\" id=\"p2426\">*2426</a>would necessarily divert the Chief Executive from his duties. He grounds that concern in <em>Nixon</em> v. <em><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Fitzgerald</a></span></em> , which recognized a President's \"absolute immunity from damages liability predicated on his official acts.\" <extracted-citation case-ids=\"6194478\" index=\"61\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. at 749</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"62\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>. In explaining the basis for that immunity, this Court observed that the prospect of such liability could \"distract a President from his public duties, to the detriment of not only the President and his office but also the Nation that the Presidency was designed to serve.\" <em><extracted-citation case-ids=\"6194478\" index=\"63\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Id.</a></span></extracted-citation></em> , at 753, <extracted-citation case-ids=\"6194478\" index=\"64\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>. The President contends that the diversion occasioned by a state criminal subpoena imposes an equally intolerable burden on a President's ability to perform his Article II functions.</p>\n<p id=\"p-44\">But <em><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Fitzgerald</a></span></em> did not hold that distraction was sufficient to confer absolute immunity. We instead drew a careful analogy to the common law absolute immunity of judges and prosecutors, concluding that a President, like those officials, must \"deal fearlessly and impartially with the duties of his office\"-not be made \"unduly cautious in the discharge of [those] duties\" by the prospect of civil liability for official acts. <em><extracted-citation case-ids=\"6194478\" index=\"65\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Id.</a></span></extracted-citation></em> , at 751-752, and n. 32, <extracted-citation case-ids=\"6194478\" index=\"66\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation> (internal quotation marks omitted). Indeed, we expressly rejected immunity based on distraction alone 15 years later in <em>Clinton</em> v. <em><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Jones</a></span></em> . There, President Clinton argued that the risk of being \"distracted by the need to participate in litigation\" entitled a sitting President to absolute immunity from civil liability, not just for official acts, as in <em><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Fitzgerald</a></span></em> , but for private conduct as well. <extracted-citation case-ids=\"11652833\" index=\"67\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/#694\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 694</a></span>, n. 19</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"68\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. We disagreed with that rationale, explaining that the \"dominant concern\" in <em><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Fitzgerald</a></span></em> was not mere distraction but the distortion of the Executive's \"decisionmaking process\" with respect to official acts that would stem from \"worry as to the possibility of damages.\" <extracted-citation case-ids=\"11652833\" index=\"69\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/#694\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 694</a></span>, n. 19</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"70\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. The Court recognized that Presidents constantly face myriad demands on their attention, \"some private, some political, and some as a result of official duty.\" <em>Id</em> ., at 705, n. 40, <extracted-citation case-ids=\"11652833\" index=\"71\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. But, the Court concluded, \"[w]hile such distractions may be vexing to those subjected to them, they do not ordinarily implicate constitutional ... concerns.\" <em><extracted-citation case-ids=\"11652833\" index=\"72\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Ibid.</a></span></extracted-citation></em></p>\n<p id=\"p-45\">The same is true of criminal subpoenas. Just as a \"properly managed\" civil suit is generally \"unlikely to occupy any substantial amount of \" a President's time or attention, <em><extracted-citation case-ids=\"11652833\" index=\"73\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">id.,</a></span></extracted-citation></em><extracted-citation case-ids=\"11652833\" index=\"73\" url=\"https://cite.case.law/us/520/681/#p704\"> at 702</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"74\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, two centuries of experience confirm that a properly tailored criminal subpoena will not normally hamper the performance of the President's constitutional duties. If anything, we expect that in the mine run of cases, where a President is subpoenaed during a proceeding targeting someone else, as Jefferson was, the burden on a President will ordinarily be lighter than the burden of defending against a civil suit.</p>\n<p id=\"p-46\">The President, however, believes the district attorney is investigating him and his businesses. In such a situation, he contends, the \"toll that criminal process ... exacts from the President is even heavier\" than the distraction at issue in <em><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">Fitzgerald</a></span></em> and <em><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Clinton</a></span></em> , because \"criminal litigation\" poses unique burdens on the President's time and will generate a \"considerable if not overwhelming degree of mental preoccupation.\" Brief for Petitioner 16-18, 30 (internal quotation marks omitted).</p>\n<p id=\"p-47\">But the President is not seeking immunity from the diversion occasioned by the prospect of future criminal <em>liability</em> . Instead he concedes-consistent with the position of the Department of Justice-that state grand juries are free to investigate a sitting President with an eye toward charging him after the completion of <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2427\" href=\"#p2427\" id=\"p2427\">*2427</a>his term. See Reply Brief 19 (citing Memorandum from Randolph D. Moss, Assistant Atty. Gen., Office of Legal Counsel, to the Atty. Gen.: A Sitting President's Amenability to Indictment and Criminal Prosecution, <extracted-citation index=\"75\" url=\"https://cite.case.law/citations/?q=24%20Op.%20O.L.C.%20222\">24 Op. OLC 222</extracted-citation>, 257, n. 36 (Oct. 16, 2000)). The President's objection therefore must be limited to the <em>additional</em> distraction caused by the subpoena itself. But that argument runs up against the 200 years of precedent establishing that Presidents, and their official communications, are subject to judicial process, see <em>Burr</em> , 25 F.Cas. at 34, even when the President is under investigation, see <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"76\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 706</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"77\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>.</p>\n<p id=\"p-48\">2</p>\n<p id=\"p-49\">The President next claims that the stigma of being subpoenaed will undermine his leadership at home and abroad. Notably, the Solicitor General does not endorse this argument, perhaps because we have twice denied absolute immunity claims by Presidents in cases involving allegations of serious misconduct. See <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"78\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 685</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"79\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation> ; <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"80\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 687</a></span></extracted-citation>,<extracted-citation case-ids=\"6174416\" index=\"81\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>. But even if a tarnished reputation were a cognizable impairment, there is nothing inherently stigmatizing about a President performing \"the citizen's normal duty of ... furnishing information relevant\" to a criminal investigation. <em>Branzburg v. Hayes</em> , <extracted-citation case-ids=\"1782792\" index=\"82\" url=\"https://cite.case.law/us/408/665/#p691\"><span class=\"citation\" data-id=\"9425020\"><a href=\"/opinion/108611/branzburg-v-hayes/\" aria-description=\"Citation for case: Branzburg v. Hayes\">408 U.S. 665</a></span></extracted-citation>, 691, <extracted-citation case-ids=\"1782792\" index=\"83\" url=\"https://cite.case.law/us/408/665/#p691\"><span class=\"citation\" data-id=\"9425020\"><a href=\"/opinion/108611/branzburg-v-hayes/\" aria-description=\"Citation for case: Branzburg v. Hayes\">92 S.Ct. 2646</a></span></extracted-citation>, <extracted-citation case-ids=\"1782792\" index=\"84\" url=\"https://cite.case.law/us/408/665/#p691\"><span class=\"citation\" data-id=\"9425020\"><a href=\"/opinion/108611/branzburg-v-hayes/\" aria-description=\"Citation for case: Branzburg v. Hayes\">33 L.Ed.2d 626</a></span></extracted-citation> (1972). Nor can we accept that the risk of association with persons or activities under criminal investigation can absolve a President of such an important public duty. Prior Presidents have weathered these associations in federal cases, <em>supra</em> , at 2422 - 2425, and there is no reason to think any attendant notoriety is necessarily greater in state court proceedings.</p>\n<p id=\"p-50\">To be sure, the consequences for a President's public standing will likely increase if he is the one under investigation. But, again, the President concedes that such investigations are permitted under Article II and the Supremacy Clause, and receipt of a subpoena would not seem to categorically magnify the harm to the President's reputation.</p>\n<p id=\"p-51\">Additionally, while the current suit has cast the Mazars subpoena into the spotlight, longstanding rules of grand jury secrecy aim to prevent the very stigma the President anticipates. See S. Beale et al., Grand Jury Law and Practice § 5:1, p. 5-3 (2d ed. 2018) (\"[T]he federal system and most states have adopted statutes or court rules\" that \"impose sharp restrictions on the extent to which matters occurring before a grand jury may be divulged\" to outside persons.). Of course, disclosure restrictions are not perfect. See <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"85\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/#687\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 687</a></span>, n. 4</extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"86\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> (observing that news media reporting made the protective order shielding the fact that the President had been named as an unindicted co-conspirator \"no longer meaningful\"). But those who make unauthorized disclosures regarding a grand jury subpoena do so at their peril. See, <em>e.g.</em> , N. Y. Penal Law Ann. § 215.70 (West 2010) (designating unlawful grand jury disclosure as a felony).</p>\n<p id=\"p-52\">3</p>\n<p id=\"p-53\">Finally, the President and the Solicitor General warn that subjecting Presidents to state criminal subpoenas will make them \"easily identifiable target[s]\" for harassment. <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"87\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. at 753</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"88\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>. But we rejected a nearly identical argument in <em><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Clinton</a></span></em> , where then-President Clinton argued that permitting civil liability for unofficial acts would \"generate a large volume of politically motivated harassing and frivolous litigation.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"89\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 708</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"90\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. The President and the Solicitor General nevertheless argue that state criminal subpoenas <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2428\" href=\"#p2428\" id=\"p2428\">*2428</a>pose a heightened risk and could undermine the President's ability to \"deal fearlessly and impartially\" with the States. <em>Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"91\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. at 752</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"92\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation> (internal quotation marks omitted). They caution that, while federal prosecutors are accountable to and removable by the President, the 2,300 district attorneys in this country are responsive to local constituencies, local interests, and local prejudices, and might \"use criminal process to register their dissatisfaction with\" the President. Brief for Petitioner 16. What is more, we are told, the state courts supervising local grand juries may not exhibit the same respect that federal courts show to the President as a coordinate branch of Government.</p>\n<p id=\"p-54\">We recognize, as does the district attorney, that harassing subpoenas could, under certain circumstances, threaten the independence or effectiveness of the Executive. See Tr. of Oral Arg. 73. Even so, in <em><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Clinton</a></span></em> we found that the risk of harassment was not \"serious\" because federal courts have the tools to deter and, where necessary, dismiss vexatious civil suits. <extracted-citation case-ids=\"11652833\" index=\"93\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 708</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"94\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. And, while we cannot ignore the possibility that state prosecutors may have political motivations, see <em>post,</em> at 2447 - 2448 (ALITO, J., dissenting), here again the law already seeks to protect against the predicted abuse.</p>\n<p id=\"p-55\">First, grand juries are prohibited from engaging in \"arbitrary fishing expeditions\" and initiating investigations \"out of malice or an intent to harass.\" <em>United States v. R. Enterprises, Inc.</em> , <extracted-citation case-ids=\"6224097\" index=\"95\" url=\"https://cite.case.law/us/498/292/#p299\"><span class=\"citation\" data-id=\"9432185\"><a href=\"/opinion/112523/united-states-v-r-enterprises-inc/\" aria-description=\"Citation for case: United States v. R. Enterprises, Inc.\">498 U.S. 292</a></span></extracted-citation>, 299, <extracted-citation case-ids=\"6224097\" index=\"96\" url=\"https://cite.case.law/us/498/292/#p299\"><span class=\"citation\" data-id=\"9432185\"><a href=\"/opinion/112523/united-states-v-r-enterprises-inc/\" aria-description=\"Citation for case: United States v. R. Enterprises, Inc.\">111 S.Ct. 722</a></span></extracted-citation>, <extracted-citation case-ids=\"6224097\" index=\"97\" url=\"https://cite.case.law/us/498/292/#p299\"><span class=\"citation\" data-id=\"9432185\"><a href=\"/opinion/112523/united-states-v-r-enterprises-inc/\" aria-description=\"Citation for case: United States v. R. Enterprises, Inc.\">112 L.Ed.2d 795</a></span></extracted-citation> (1991). See also, <em>e.g.</em> , <em>Virag v. Hynes</em> , <extracted-citation case-ids=\"2341761\" index=\"98\" url=\"https://cite.case.law/ny2d/54/437/#p442\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">54 N.Y.2d 437</a></span></extracted-citation>, 442-443, <extracted-citation index=\"99\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">446 N.Y.S.2d 196</a></span></extracted-citation>, <extracted-citation index=\"100\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">430 N.E.2d 1249</a></span></extracted-citation>, 1252 (1981) (recognizing that grand jury subpoenas can be \"challenged by an affirmative showing of impropriety,\" including \"bad faith\" (internal quotation marks omitted)). These protections, as the district attorney himself puts it, \"apply with special force to a President, in light of the office's unique position as the head of the Executive Branch.\" Brief for Respondent Vance 43. And, in the event of such harassment, a President would be entitled to the protection of federal courts. The policy against federal interference in state criminal proceedings, while strong, allows \"intervention in those cases where the District Court properly finds that the state proceeding is motivated by a desire to harass or is conducted in bad faith.\" <em>Huffman v. Pursue, Ltd.</em> , <extracted-citation case-ids=\"11644301\" index=\"101\" url=\"https://cite.case.law/us/420/592/#p611\"><span class=\"citation\" data-id=\"9426028\"><a href=\"/opinion/109216/huffman-v-pursue-ltd/\" aria-description=\"Citation for case: Huffman v. Pursue, Ltd.\">420 U.S. 592</a></span></extracted-citation>, 611, <extracted-citation case-ids=\"11644301\" index=\"102\" url=\"https://cite.case.law/us/420/592/#p611\"><span class=\"citation\" data-id=\"9426028\"><a href=\"/opinion/109216/huffman-v-pursue-ltd/\" aria-description=\"Citation for case: Huffman v. Pursue, Ltd.\">95 S.Ct. 1200</a></span></extracted-citation>, <extracted-citation case-ids=\"11644301\" index=\"103\" url=\"https://cite.case.law/us/420/592/#p611\"><span class=\"citation\" data-id=\"9426028\"><a href=\"/opinion/109216/huffman-v-pursue-ltd/\" aria-description=\"Citation for case: Huffman v. Pursue, Ltd.\">43 L.Ed.2d 482</a></span></extracted-citation> (1975).</p>\n<p id=\"p-56\">Second, contrary to Justice ALITO's characterization, our holding does not allow States to \"run roughshod over the functioning of [the Executive B]ranch.\" <em>Post,</em> at 2451. The Supremacy Clause prohibits state judges and prosecutors from interfering with a President's official duties. See, <em>e.g.,</em> <em>Tennessee v. Davis</em> , <extracted-citation case-ids=\"4666\" index=\"104\" url=\"https://cite.case.law/us/100/257/#p263\"><span class=\"citation\" data-id=\"90038\"><a href=\"/opinion/90038/tennessee-v-davis/\" aria-description=\"Citation for case: Tennessee v. Davis\">100 U.S. 257</a></span></extracted-citation>, 263, <extracted-citation case-ids=\"4666\" index=\"105\" url=\"https://cite.case.law/us/100/257/#p263\"><span class=\"citation\" data-id=\"90038\"><a href=\"/opinion/90038/tennessee-v-davis/\" aria-description=\"Citation for case: Tennessee v. Davis\">25 L.Ed. 648</a></span></extracted-citation> (1880) (\"No State government can ... obstruct [the] authorized officers\" of the Federal Government.). Any effort to manipulate a President's policy decisions or to \"retaliat[e]\" against a President for official acts through issuance of a subpoena, Brief for Respondent Vance 15, 43, would thus be an unconstitutional attempt to \"influence\" a superior sovereign \"exempt\" from such obstacles, see <em>McCulloch</em> , <extracted-citation case-ids=\"4702\" index=\"106\" url=\"https://cite.case.law/us/17/316/#p436\"><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 Wheat. at 427</a></span></extracted-citation>. We generally \"assume[ ] that state courts and prosecutors will observe constitutional limitations.\" <em>Dombrowski v. Pfister</em> , <extracted-citation case-ids=\"1525344\" index=\"107\" url=\"https://cite.case.law/us/380/479/#p484\"><span class=\"citation\" data-id=\"9423001\"><a href=\"/opinion/107025/dombrowski-v-pfister/\" aria-description=\"Citation for case: Dombrowski v. Pfister\">380 U.S. 479</a></span></extracted-citation>, 484, <extracted-citation case-ids=\"1525344\" index=\"108\" url=\"https://cite.case.law/us/380/479/#p484\"><span class=\"citation\" data-id=\"9423001\"><a href=\"/opinion/107025/dombrowski-v-pfister/\" aria-description=\"Citation for case: Dombrowski v. Pfister\">85 S.Ct. 1116</a></span></extracted-citation>, <extracted-citation case-ids=\"1525344\" index=\"109\" url=\"https://cite.case.law/us/380/479/#p484\"><span class=\"citation\" data-id=\"9423001\"><a href=\"/opinion/107025/dombrowski-v-pfister/\" aria-description=\"Citation for case: Dombrowski v. Pfister\">14 L.Ed.2d 22</a></span></extracted-citation> (1965). Failing that, federal law allows a President to challenge any allegedly unconstitutional influence in a federal forum, as the President has done here. See <extracted-citation index=\"110\" url=\"https://cite.case.law/citations/?q=42%20U.S.C.%20%C2%A7%201983\"><span class=\"citation no-link\">42 U.S.C. § 1983</span></extracted-citation> ; <em>Ex parte Young</em> , <extracted-citation case-ids=\"8288600\" index=\"111\" url=\"https://cite.case.law/us/209/123/#p155\"><span class=\"citation\" data-id=\"9418117\"><a href=\"/opinion/96819/ex-parte-young/\" aria-description=\"Citation for case: Ex Parte Young\">209 U.S. 123</a></span></extracted-citation>, 155-156, <extracted-citation case-ids=\"8288600\" index=\"112\" url=\"https://cite.case.law/us/209/123/#p155\"><span class=\"citation\" data-id=\"9418117\"><a href=\"/opinion/96819/ex-parte-young/\" aria-description=\"Citation for case: Ex Parte Young\">28 S.Ct. 441</a></span></extracted-citation>, <extracted-citation case-ids=\"8288600\" index=\"113\" url=\"https://cite.case.law/us/209/123/#p155\"><span class=\"citation\" data-id=\"9418117\"><a href=\"/opinion/96819/ex-parte-young/\" aria-description=\"Citation for case: Ex Parte Young\">52 L.Ed. 714</a></span></extracted-citation> (1908) (holding that federal courts may <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2429\" href=\"#p2429\" id=\"p2429\">*2429</a>enjoin state officials to conform their conduct to federal law).</p>\n<p id=\"p-57\">Given these safeguards and the Court's precedents, we cannot conclude that absolute immunity is necessary or appropriate under Article II or the Supremacy Clause. Our dissenting colleagues agree. Justice THOMAS reaches the same conclusion based on the original understanding of the Constitution reflected in Marshall's decision in <em>Burr</em> . <em>Post,</em> at 2434, 2435 - 2436. And Justice ALITO, also persuaded by <em>Burr</em> , \"agree[s]\" that \"not all\" state criminal subpoenas for a President's records \"should be barred.\" <em>Post,</em> at 2448. On that point the Court is unanimous.</p>\n<p id=\"p-58\">B</p>\n<p id=\"p-59\">We next consider whether a state grand jury subpoena seeking a President's private papers must satisfy a heightened need standard. The Solicitor General would require a threshold showing that the evidence sought is \"critical\" for \"specific charging decisions\" and that the subpoena is a \"last resort,\" meaning the evidence is \"not available from any other source\" and is needed \"now, rather than at the end of the President's term.\" Brief for United States as <em>Amicus Curiae</em> 29, 32 (internal quotation marks and alteration omitted). Justice ALITO, largely embracing those criteria, agrees that a state criminal subpoena to a President \"should not be allowed unless a heightened standard is met.\" <em>Post,</em> at 2448 - 2449 (asking whether the information is \"critical\" and \"necessary ... now\").</p>\n<p id=\"p-60\">We disagree, for three reasons. First, such a heightened standard would extend protection designed for official documents to the President's private papers. As the Solicitor General and Justice ALITO acknowledge, their proposed test is derived from executive privilege cases that trace back to <em>Burr</em> . Brief for United States as <em>Amicus Curiae</em> 26-28; <em>post,</em> at 2448 - 2449. There, Marshall explained that if Jefferson invoked presidential privilege over executive communications, the court would not \"proceed against the president as against an ordinary individual\" but would instead require an affidavit from the defense that \"would clearly show the paper to be essential to the justice of the case.\" <em>Burr</em> , 25 F.Cas. at 192. The Solicitor General and Justice ALITO would have us apply a similar standard to a President's personal papers. But this argument does not account for the relevant passage from <em>Burr</em> : \"If there be a paper in the possession of the executive, which is <em>not of an official nature</em> , he must stand, as respects that paper, in nearly the same situation with any other individual.\" <em>Id.</em> , at 191 (emphasis added). And it is only \"nearly\"-and not \"entirely\"-because the President retains the right to assert privilege over documents that, while ostensibly private, \"partake of the character of an official paper.\" <em>Id.</em> , at 191-192.</p>\n<p id=\"p-61\">Second, neither the Solicitor General nor Justice ALITO has established that heightened protection against state subpoenas is necessary for the Executive to fulfill his Article II functions. Beyond the risk of harassment, which we addressed above, the only justification they offer for the heightened standard is protecting Presidents from \"unwarranted burdens.\" Brief for United States as <em>Amicus Curiae</em> 28; see <em>post,</em> at 2448 (asking whether \"there is an urgent and critical need for the subpoenaed information\"). In effect, they argue that even if federal subpoenas to a President are warranted whenever evidence is material, state subpoenas are warranted \"only when [the] evidence is essential.\" Brief for United States as <em>Amicus Curiae</em> 28; see <em>post,</em> at 2448. But that double standard has no basis in law. For if the state subpoena is not issued to manipulate, <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2430\" href=\"#p2430\" id=\"p2430\">*2430</a><em>supra,</em> at 2428 - 2429, the documents themselves are not protected, <em>supra</em> , at 2429, and the Executive is not impaired, <em>supra,</em> at 2425 - 2426, then nothing in Article II or the Supremacy Clause supports holding state subpoenas to a higher standard than their federal counterparts.</p>\n<p id=\"p-62\">Finally, in the absence of a need to protect the Executive, the public interest in fair and effective law enforcement cuts in favor of comprehensive access to evidence. Requiring a state grand jury to meet a heightened standard of need would hobble the grand jury's ability to acquire \"all information that might possibly bear on its investigation.\" <em>R. Enterprises, Inc.</em> , <extracted-citation case-ids=\"6224097\" index=\"114\" url=\"https://cite.case.law/us/498/292/#p299\"><span class=\"citation\" data-id=\"9432185\"><a href=\"/opinion/112523/united-states-v-r-enterprises-inc/\" aria-description=\"Citation for case: United States v. R. Enterprises, Inc.\">498 U.S. at 297</a></span></extracted-citation>, <extracted-citation case-ids=\"6224097\" index=\"115\" url=\"https://cite.case.law/us/498/292/#p299\"><span class=\"citation\" data-id=\"9432185\"><a href=\"/opinion/112523/united-states-v-r-enterprises-inc/\" aria-description=\"Citation for case: United States v. R. Enterprises, Inc.\">111 S.Ct. 722</a></span></extracted-citation>. And, even assuming the evidence withheld under that standard were preserved until the conclusion of a President's term, in the interim the State would be deprived of investigative leads that the evidence might yield, allowing memories to fade and documents to disappear. This could frustrate the identification, investigation, and indictment of third parties (for whom applicable statutes of limitations might lapse). More troubling, it could prejudice the innocent by depriving the grand jury of <em>exculpatory</em> evidence.</p>\n<p id=\"p-63\">Rejecting a heightened need standard does not leave Presidents with \"no real protection.\" <em>Post,</em> at 2450 (opinion of ALITO, J.). To start, a President may avail himself of the same protections available to every other citizen. These include the right to challenge the subpoena on any grounds permitted by state law, which usually include bad faith and undue burden or breadth. See, <em>e.g.</em> , <em>Virag</em> , <extracted-citation case-ids=\"2341761\" index=\"116\" url=\"https://cite.case.law/ny2d/54/437/#p442\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">54 N.Y.2d at 442</a></span>-445</extracted-citation>, <extracted-citation index=\"117\" url=\"https://cite.case.law/citations/?q=446%20N.Y.S.2d%20196\"><span class=\"citation\" data-id=\"5534109\"><a href=\"/opinion/5685170/virag-v-hynes/\" aria-description=\"Citation for case: Virag v. Hynes\">446 N.Y.S.2d 196</a></span></extracted-citation>, <extracted-citation index=\"118\" url=\"https://cite.case.law/citations/?q=430%20N.E.2d%201249\">430 N.E.2d at </extracted-citation>1252-1253 ; <em>In re Grand Jury Subpoenas</em> , <extracted-citation case-ids=\"4408852\" index=\"119\" url=\"https://cite.case.law/ny2d/72/307/#p315\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">72 N.Y.2d 307</a></span></extracted-citation>, 315-316, <extracted-citation index=\"120\" url=\"https://cite.case.law/citations/?q=532%20N.Y.S.2d%20722\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">532 N.Y.S.2d 722</a></span></extracted-citation>, <extracted-citation index=\"121\" url=\"https://cite.case.law/citations/?q=528%20N.E.2d%201195\"><span class=\"citation\" data-id=\"5538517\"><a href=\"/opinion/5689287/in-re-grand-jury-subpoenas-for-local-17-135-257-608-of-united/\" aria-description=\"Citation for case: In re Grand Jury Subpoenas for Local 17, 135, 257 &amp; 608...\">528 N.E.2d 1195</a></span></extracted-citation>, 1200 (1988) (recognizing that grand jury subpoenas can be challenged as \"overly broad\" or \"unreasonably burdensome\" (internal quotation marks omitted)). And, as in federal court, \"[t]he high respect that is owed to the office of the Chief Executive ... should inform the conduct of the entire proceeding, including the timing and scope of discovery.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"122\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 707</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"123\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>. See <em><extracted-citation case-ids=\"11652833\" index=\"124\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">id.</a></span></extracted-citation></em> , at 724, <extracted-citation case-ids=\"11652833\" index=\"125\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation> (BREYER, J., concurring in judgment) (stressing the need for courts presiding over suits against the President to \"schedule proceedings so as to avoid significant interference with the President's ongoing discharge of his official responsibilities\"); <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"126\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 702</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"127\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> (\"[W]here a subpoena is directed to a President ... appellate review ... should be particularly meticulous.\").</p>\n<p id=\"p-64\">Furthermore, although the Constitution does not entitle the Executive to absolute immunity or a heightened standard, he is not \"relegate[d]\" only to the challenges available to private citizens. <em>Post,</em> at 2448 - 2449 (opinion of ALITO, J.). A President can raise subpoena-specific constitutional challenges, in either a state or federal forum. As previously noted, he can challenge the subpoena as an attempt to influence the performance of his official duties, in violation of the Supremacy Clause. See <em>supra</em> , at 2428 - 2429. This avenue protects against local political machinations \"interposed as an obstacle to the effective operation of a federal constitutional power.\" <em>United States v. Belmont</em> , <extracted-citation case-ids=\"547737\" index=\"128\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">301 U.S. 324</a></span></extracted-citation>, 332, <extracted-citation case-ids=\"547737\" index=\"129\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">57 S.Ct. 758</a></span></extracted-citation>, <extracted-citation case-ids=\"547737\" index=\"130\" url=\"https://cite.case.law/us/301/324/#p332\"><span class=\"citation\" data-id=\"9418915\"><a href=\"/opinion/102825/united-states-v-belmont/\" aria-description=\"Citation for case: United States v. Belmont\">81 L.Ed. 1134</a></span></extracted-citation> (1937).</p>\n<p id=\"p-65\">In addition, the Executive can-as the district attorney concedes-argue that compliance with a particular subpoena would impede his constitutional duties. Brief for Respondent Vance 42. Incidental to the functions confided in Article II is \"the power to perform them, without obstruction or impediment.\" 3 J. Story, Commentaries on the Constitution of the United States § 1563, pp. 418-419 <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2431\" href=\"#p2431\" id=\"p2431\">*2431</a>(1833). As a result, \"once the President sets forth and explains a conflict between judicial proceeding and public duties,\" or shows that an order or subpoena would \"significantly interfere with his efforts to carry out\" those duties, \"the matter changes.\" <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"131\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/#710\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 710</a></span>, 714</extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"132\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation> (opinion of BREYER, J.). At that point, a court should use its inherent authority to quash or modify the subpoena, if necessary to ensure that such \"interference with the President's duties would not occur.\" <em><extracted-citation case-ids=\"11652833\" index=\"133\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">Id.</a></span></extracted-citation></em> , at 708, <extracted-citation case-ids=\"11652833\" index=\"134\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation> (opinion of the Court).</p>\n<p id=\"p-66\">* * *</p>\n<p id=\"p-67\">Two hundred years ago, a great jurist of our Court established that no citizen, not even the President, is categorically above the common duty to produce evidence when called upon in a criminal proceeding. We reaffirm that principle today and hold that the President is neither absolutely immune from state criminal subpoenas seeking his private papers nor entitled to a heightened standard of need. The \"guard[ ] furnished to this high officer\" lies where it always has-in \"the conduct of a court\" applying established legal and constitutional principles to individual subpoenas in a manner that preserves both the independence of the Executive and the integrity of the criminal justice system. <em>Burr</em> , 25 F.Cas. at 34.</p>\n<p id=\"p-68\">The arguments presented here and in the Court of Appeals were limited to absolute immunity and heightened need. The Court of Appeals, however, has directed that the case be returned to the District Court, where the President may raise further arguments as appropriate. <extracted-citation index=\"135\" url=\"https://cite.case.law/citations/?q=941%20F.3d%20631\">941 F.3d at 646, n. 19</extracted-citation>.<footnotemark>6</footnotemark></p>\n<p id=\"p-69\">We affirm the judgment of the Court of Appeals and remand the case for further proceedings consistent with this opinion.</p>\n<p id=\"p-70\"><em>It is so ordered.</em></p>\n<p id=\"p-71\">Justice KAVANAUGH, with whom Justice GORSUCH joins, concurring in the judgment.</p>\n<p id=\"p-72\">The Court today unanimously concludes that a President does not possess absolute immunity from a state criminal subpoena, but also unanimously agrees that this case should be remanded to the District Court, where the President may raise constitutional and legal objections to the subpoena as appropriate. See <em>ante</em> , at 2431, and n. 6; <em>post</em> , at 2439 (THOMAS, J., dissenting); <em>post</em> , at 2448 - 2450 (ALITO, J., dissenting). I agree with those two conclusions.</p>\n<p id=\"p-73\">* * *</p>\n<p id=\"p-74\">The dispute over this grand jury subpoena reflects a conflict between a State's interest in criminal investigation and a President's Article II interest in performing his or her duties without undue interference. Although this case involves personal information of the President and is therefore not an executive privilege case, the majority opinion correctly concludes based on precedent that Article II and the Supremacy Clause of the Constitution supply some protection for the Presidency against state criminal subpoenas of this sort.</p>\n<p id=\"p-75\"><a class=\"page-label\" data-citation-index=\"1\" data-label=\"2432\" href=\"#p2432\" id=\"p2432\">*2432</a>In our system of government, as this Court has often stated, no one is above the law. That principle applies, of course, to a President. At the same time, in light of Article II of the Constitution, this Court has repeatedly declared-and the Court indicates again today-that a court may not proceed against a President as it would against an ordinary litigant. See <em>Cheney v. United States Dist. Court for D. C.</em> , <extracted-citation case-ids=\"2527206\" index=\"136\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">542 U.S. 367</a></span></extracted-citation>, 381-382, <extracted-citation case-ids=\"2527206\" index=\"137\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">124 S.Ct. 2576</a></span></extracted-citation>, <extracted-citation case-ids=\"2527206\" index=\"138\" url=\"https://cite.case.law/us/542/367/#p381\"><span class=\"citation\" data-id=\"9434668\"><a href=\"/opinion/136997/cheney-v-united-states-district-court-for-district-of-columbia/\" aria-description=\"Citation for case: Cheney v. United States District Court for District of...\">159 L.Ed.2d 459</a></span></extracted-citation> (2004) (\"In no case would a court be required to proceed against the president as against an ordinary individual\" (internal quotation marks and alterations omitted)); <em>Clinton v. Jones</em> , <extracted-citation case-ids=\"11652833\" index=\"139\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. 681</a></span></extracted-citation>, 704, n. 39, <extracted-citation case-ids=\"11652833\" index=\"140\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"141\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">137 L.Ed.2d 945</a></span></extracted-citation> (1997) (a court may not \"proceed against the president as against an ordinary individual\" (internal quotation marks omitted)); <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"142\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, 715, <extracted-citation case-ids=\"6174416\" index=\"143\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"144\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974) (\"In no case of this kind would a court be required to proceed against the president as against an ordinary individual\" (internal quotation marks and alterations omitted));<em>United States v. Burr</em> , <extracted-citation case-ids=\"6580056\" index=\"145\" url=\"https://cite.case.law/f-cas/25/187/#p192\"><span class=\"citation\" data-id=\"8638368\"><a href=\"/opinion/8658517/united-states-v-burr/\" aria-description=\"Citation for case: United States v. Burr\">25 F.Cas. 187</a></span></extracted-citation>, 192, (No. 14694) (CC Va. 1807) (Marshall, C. J.) (\"In no case of this kind would a court be required to proceed against the president as against an ordinary individual\").</p>\n<p id=\"p-76\">The question here, then, is how to balance the State's interests and the Article II interests. The longstanding precedent that has applied to federal criminal subpoenas for official, privileged Executive Branch information is <em>United States v. Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"146\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. 683</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"147\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"148\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">41 L.Ed.2d 1039</a></span></extracted-citation> (1974). That landmark case requires that a prosecutor establish a \"demonstrated, specific need\" for the President's information. <em><extracted-citation case-ids=\"6174416\" index=\"149\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">Id.</a></span></extracted-citation></em> , at 713, <extracted-citation case-ids=\"6174416\" index=\"150\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> ; see also <em>In re Sealed Case</em> , <extracted-citation case-ids=\"285176,3708318\" index=\"151\" url=\"https://cite.case.law/f3d/121/729/\"><span class=\"citation\" data-id=\"6953569\"><a href=\"/opinion/7050191/in-re-sealed-case/\" aria-description=\"Citation for case: In re Sealed Case\">121 F.3d 729</a></span></extracted-citation>, 753-757 (CADC 1997) ; cf. <em>Senate Select Committee on Presidential Campaign Activities v. Nixon</em> , <extracted-citation case-ids=\"3681739,169479\" index=\"152\" url=\"https://cite.case.law/f2d/498/725/\"><span class=\"citation\" data-id=\"7279447\"><a href=\"/opinion/7360703/senate-select-committee-on-presidential-campaign-activities-v-nixon/\" aria-description=\"Citation for case: Senate Select Committee on Presidential Campaign...\">498 F.2d 725</a></span></extracted-citation>, 730-731 (CADC 1974) (en banc) (similar standard for congressional subpoenas to the Executive Branch).</p>\n<p id=\"p-77\">The <em>Nixon</em> \"demonstrated, specific need\" standard is a tried-and-true test that accommodates both the interests of the criminal process and the Article II interests of the Presidency. The <em>Nixon</em> standard ensures that a prosecutor's interest in subpoenaed information is sufficiently important to justify an intrusion on the Article II interests of the Presidency. The <em>Nixon</em> standard also reduces the risk of subjecting a President to unwarranted burdens, because it provides that a prosecutor may obtain a President's information only in certain defined circumstances.</p>\n<p id=\"p-78\">Although the Court adopted the <em>Nixon</em> standard in a different Article II context-there, involving the confidentiality of official, privileged information-the majority opinion today recognizes that there are also important Article II (and Supremacy Clause) interests at stake here. A state criminal subpoena to a President raises Article II and Supremacy Clause issues because of the potential for a state prosecutor to use the criminal process and issue subpoenas in a way that interferes with the President's duties, through harassment or diversion. Cf. <em>Nixon v. Fitzgerald</em> , <extracted-citation case-ids=\"6194478\" index=\"153\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">457 U.S. 731</a></span></extracted-citation>, 751-753, <extracted-citation case-ids=\"6194478\" index=\"154\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">102 S.Ct. 2690</a></span></extracted-citation>, <extracted-citation case-ids=\"6194478\" index=\"155\" url=\"https://cite.case.law/us/457/731/#p749\"><span class=\"citation\" data-id=\"9428860\"><a href=\"/opinion/110762/nixon-v-fitzgerald/\" aria-description=\"Citation for case: Nixon v. Fitzgerald\">73 L.Ed.2d 349</a></span></extracted-citation> (1982).</p>\n<p id=\"p-79\">Because this case again entails a clash between the interests of the criminal process and the Article II interests of the Presidency, I would apply the longstanding <em>Nixon</em> \"demonstrated, specific need\" standard to this case. The majority opinion does not apply the <em>Nixon</em> standard in this distinct Article II context, as I would have done. That said, the majority opinion appropriately takes account of some important concerns that also animate <em>Nixon</em> and the Constitution's balance of powers. The <a class=\"page-label\" data-citation-index=\"1\" data-label=\"2433\" href=\"#p2433\" id=\"p2433\">*2433</a>majority opinion explains that a state prosecutor may not issue a subpoena for a President's personal information out of bad faith, malice, or an intent to harass a President, <em>ante</em> , at 2428; as a result of prosecutorial impropriety, <em><extracted-citation case-ids=\"6194478\" index=\"156\" url=\"https://cite.case.law/us/457/731/#p749\">ibid.</extracted-citation></em> ; to seek information that is not relevant to an investigation, <em>ante</em> , at 2428 - 2429 - 2430; that is overly broad or unduly burdensome, <em>ante</em> , at 2429 - 2430; to manipulate, influence, or retaliate against a President's official acts or policy decisions, <em>ante</em> , at 2428 - 2429, 2430; or in a way that would impede, conflict with, or interfere with a President's official duties, <em>ante</em> , at 2431. All nine Members of the Court agree, moreover, that a President may raise objections to a state criminal subpoena not just in state court but also in federal court.<footnotemark>1</footnotemark> And the majority opinion indicates that, in light of the \"high respect that is owed to the office of the Chief Executive,\" courts \"should be particularly meticulous\" in assessing a subpoena for a President's personal records. <em>Ante</em> , at 2430 (quoting <em>Clinton</em> , <extracted-citation case-ids=\"11652833\" index=\"157\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">520 U.S. at 707</a></span></extracted-citation>, <extracted-citation case-ids=\"11652833\" index=\"158\" url=\"https://cite.case.law/us/520/681/#p704\"><span class=\"citation\" data-id=\"9433464\"><a href=\"/opinion/118115/clinton-v-jones/\" aria-description=\"Citation for case: Clinton v. Jones\">117 S.Ct. 1636</a></span></extracted-citation>, and <em>Nixon</em> , <extracted-citation case-ids=\"6174416\" index=\"159\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">418 U.S. at 702</a></span></extracted-citation>, <extracted-citation case-ids=\"6174416\" index=\"160\" url=\"https://cite.case.law/us/418/683/\"><span class=\"citation\" data-id=\"109101\"><a href=\"/opinion/109101/united-states-v-nixon/\" aria-description=\"Citation for case: United States v. Nixon\">94 S.Ct. 3090</a></span></extracted-citation> ).</p>\n<p id=\"p-80\">In the end, much may depend on how the majority opinion's various standards are applied in future years and decades.<footnotemark>2</footnotemark> It will take future cases to determine precisely how much difference exists between (i) the various standards articulated by the majority opinion, (ii) the overarching <em>Nixon</em> \"demonstrated, specific need\" standard that I would adopt, and (iii) Justice THOMAS's and Justice ALITO's other proposed standards. In any event, in my view, lower courts in cases of this sort involving a President will almost invariably have to begin by delving into why the State wants the information; why and how much the State needs the information, including whether the State could obtain the information elsewhere; and whether compliance with the subpoena would unduly burden or interfere with a President's official duties.</p>\n<p id=\"p-81\">* * *</p>\n<p id=\"p-82\">I agree that the case should be remanded to the District Court for further proceedings, where the President may raise constitutional and legal objections to the state grand jury subpoena as appropriate.</p>\n<footnote label=\"1\">\n<p id=\"p-192\">This maxim traces at least as far back as Lord Chancellor Hardwicke, in a 1742 parliamentary debate. See 12 Parliamentary History of England 693 (1812).</p>\n</footnote>\n<footnote label=\"2\">\n<p id=\"p-193\">The grand jury subpoena essentially copied a subpoena issued to Mazars in April 2019 by the Committee on Oversight and Reform of the U. S. House of Representatives, which is at issue in <em>Trump v. Mazars USA, LLP</em> , <extracted-citation index=\"161\" url=\"https://cite.case.law/citations/?q=2020%20WL%202848061\"><span class=\"citation no-link\">2020 WL 2848061</span></extracted-citation> (2020). The principal difference is that the instant subpoena expressly requests tax returns.</p>\n</footnote>\n<footnote label=\"3\">\n<p id=\"p-194\">See generally N. Isenberg, Fallen Founder: The Life of Aaron Burr 271-365 (2007); J. Smith, John Marshall: Definer of a Nation 348-374 (1996); M. Lomask, Aaron Burr: The Conspiracy and Years of Exile, 1805-1836, pp. 222-298 (1982).</p>\n</footnote>\n<footnote label=\"4\">\n<p id=\"p-195\">Wilkinson was secretly being paid by Spain for information and influence. In the wake of Burr's trial, he was investigated by Congress and later court-martialed. But he was acquitted for want of evidence, and his duplicity was not confirmed until decades after his death, when Spanish archival material came to light.</p>\n</footnote>\n<footnote label=\"5\">\n<p id=\"p-196\">While the subpoena was directed to the President's accounting firm, the parties agree that the papers at issue belong to the President and that Mazars is merely the custodian. Thus, for purposes of immunity, it is functionally a subpoena issued to the President.</p>\n</footnote>\n<footnote label=\"6\">\n<p id=\"p-197\">The daylight between our opinion and Justice THOMAS's \"dissent\" is not as great as that label might suggest. <em>Post,</em> at 2439. We agree that Presidents are neither absolutely immune from state criminal subpoenas nor insulated by a heightened need standard. <em>Post,</em> at 2436, 2439, n. 3. We agree that Presidents may challenge specific subpoenas as impeding their Article II functions. <em>Post,</em> at 2436 - 2437. And, although we affirm while Justice THOMAS would vacate, we agree that this case will be remanded to the District Court. <em>Post,</em> at 2439.</p>\n</footnote>\n</opinion>", "extracted_by_ocr": false, "ordering_key": 1, "main_version": null, "opinions_cited": ["https://www.courtlistener.com/api/rest/v4/opinions/84759/", "https://www.courtlistener.com/api/rest/v4/opinions/85272/", "https://www.courtlistener.com/api/rest/v4/opinions/90038/", "https://www.courtlistener.com/api/rest/v4/opinions/98109/", "https://www.courtlistener.com/api/rest/v4/opinions/109101/", "https://www.courtlistener.com/api/rest/v4/opinions/1432687/", "https://www.courtlistener.com/api/rest/v4/opinions/5534109/", "https://www.courtlistener.com/api/rest/v4/opinions/5538517/", "https://www.courtlistener.com/api/rest/v4/opinions/6953569/", "https://www.courtlistener.com/api/rest/v4/opinions/7279447/", "https://www.courtlistener.com/api/rest/v4/opinions/8638362/", "https://www.courtlistener.com/api/rest/v4/opinions/8638368/", "https://www.courtlistener.com/api/rest/v4/opinions/9418117/", "https://www.courtlistener.com/api/rest/v4/opinions/9418915/", "https://www.courtlistener.com/api/rest/v4/opinions/9423001/", "https://www.courtlistener.com/api/rest/v4/opinions/9424435/", "https://www.courtlistener.com/api/rest/v4/opinions/9425020/", "https://www.courtlistener.com/api/rest/v4/opinions/9426028/", "https://www.courtlistener.com/api/rest/v4/opinions/9428860/", "https://www.courtlistener.com/api/rest/v4/opinions/9432185/", "https://www.courtlistener.com/api/rest/v4/opinions/9433464/", "https://www.courtlistener.com/api/rest/v4/opinions/9434668/"]}